[
  {
    "id": "africa-001",
    "authorId": "mansa-musa",
    "content": "I depart today for the holy city of Mecca. 60,000 men travel with me - soldiers, scholars, servants, and slaves. 12,000 carry gold. Each carries four pounds.\n\nLet the world see the wealth of Mali. Let them know that Africa is not a dark continent but a golden one.\n\nAllahu Akbar. The pilgrimage begins.",
    "displayDate": "1324",
    "timestamp": "1324-01-01T08:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 3456,
    "comments": 289,
    "shares": 567,
    "accuracy": "verified",
    "historicalContext": "Mansa Musa's hajj to Mecca in 1324 is legendary. He traveled with an enormous caravan carrying tons of gold. His spending in Cairo caused gold prices to crash for a decade. He is considered the richest person in human history.",
    "location": { "name": "Niani, Mali Empire", "coordinates": [11.35, -8.2] }
  },
  {
    "id": "africa-002",
    "authorId": "mansa-musa",
    "content": "Cairo has never seen anything like us.\n\nI gave gold to the poor. I gave gold to officials. I gave gold to merchants. I gave gold until there was no more to give - and still they begged for more.\n\nThey say I have broken their economy. That gold is now worthless in Egypt because I brought too much.\n\nLet them learn: Mali's wealth is beyond their imagination.",
    "displayDate": "1324",
    "timestamp": "1324-07-15T14:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 2987,
    "comments": 234,
    "shares": 445,
    "accuracy": "verified",
    "historicalContext": "Mansa Musa's generosity in Cairo was so extreme that it caused massive inflation. Gold prices in Egypt didn't recover for over a decade. On his return journey, he had to borrow gold at high interest rates.",
    "location": { "name": "Cairo, Egypt", "coordinates": [30.04, 31.24] }
  },
  {
    "id": "africa-003",
    "authorId": "mansa-musa",
    "content": "I have returned from Mecca with something more valuable than gold: architects.\n\nAbu Ishaq al-Sahili will build mosques in Timbuktu and Gao that will last a thousand years. I have seen the great buildings of Cairo and Damascus. Now Mali will have its own.\n\nKnowledge is the true gold. Books are the true treasure. Timbuktu will become a city of learning.",
    "displayDate": "1325",
    "timestamp": "1325-06-01T10:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 2345,
    "comments": 189,
    "shares": 312,
    "accuracy": "verified",
    "historicalContext": "Mansa Musa brought the architect Abu Ishaq al-Sahili from Granada to Mali. Al-Sahili built the Great Mosque of Timbuktu and the palace at Gao. Musa's patronage transformed Timbuktu into a center of Islamic learning.",
    "location": { "name": "Timbuktu, Mali Empire", "coordinates": [16.77, -3.0] }
  },
  {
    "id": "africa-004",
    "authorId": "sundiata-keita",
    "content": "They called me the Lion King. But I was not always a lion.\n\nAs a child, I could not walk. They mocked me, called me a cripple. My mother wept. When the tyrant Sumanguru killed my brothers, we fled into exile.\n\nBut the griot had prophesied: the crippled child will conquer the world.\n\nToday, at Kirina, I proved the prophecy true. Sumanguru is defeated. Mali is born.",
    "displayDate": "1235",
    "timestamp": "1235-01-01T12:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 2678,
    "comments": 223,
    "shares": 389,
    "accuracy": "verified",
    "historicalContext": "Sundiata Keita founded the Mali Empire after defeating Sumanguru Kante at the Battle of Kirina in 1235. According to tradition, he overcame childhood paralysis to become a great warrior. The epic of Sundiata is one of Africa's greatest oral traditions.",
    "location": { "name": "Kirina, Mali", "coordinates": [12.5, -8.0] }
  },
  {
    "id": "africa-005",
    "authorId": "sundiata-keita",
    "content": "I have gathered the chiefs under the great tree at Kangaba. Today we make the Kouroukan Fouga - the laws that will govern Mali.\n\nNo more slavery among our own people. Every clan has its role. Every person has dignity. The hunters will keep the peace. The griots will remember our history.\n\nThis is not just a kingdom. This is a civilization.",
    "displayDate": "1236",
    "timestamp": "1236-05-15T11:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 2123,
    "comments": 178,
    "shares": 267,
    "accuracy": "verified",
    "historicalContext": "The Kouroukan Fouga (Manden Charter) was an oral constitution established by Sundiata. It outlined social organization, rights, and responsibilities. Some scholars consider it one of the earliest declarations of human rights.",
    "location": { "name": "Kangaba, Mali", "coordinates": [11.93, -8.42] }
  },
  {
    "id": "africa-006",
    "authorId": "tunka-manin",
    "content": "The Arabs call our kingdom Ghana - 'the land of gold.' They do not know the half of it.\n\nEvery gold nugget in my realm belongs to me by right. The people may keep the gold dust, but the nuggets are mine. If I allowed them to keep all the gold, it would become worthless.\n\nThis is how an empire maintains its wealth: by controlling supply.",
    "displayDate": "1067",
    "timestamp": "1067-04-01T09:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1789,
    "comments": 145,
    "shares": 223,
    "accuracy": "verified",
    "historicalContext": "The Ghana Empire (not related to modern Ghana) controlled the gold trade in West Africa. The king monopolized gold nuggets while allowing subjects to keep gold dust, maintaining scarcity and value. Arab geographer Al-Bakri documented this in 1067.",
    "location": { "name": "Koumbi Saleh, Ghana Empire", "coordinates": [15.77, -7.97] }
  },
  {
    "id": "africa-007",
    "authorId": "tunka-manin",
    "content": "Today I held audience in the royal pavilion. I sat on a platform covered in gold, wearing a necklace and bracelets of the same. Ten pages stood behind me with shields and swords decorated with gold.\n\nThe sons of vassal kings stood to my right, their hair plaited with gold.\n\nLet the merchants of the Sahara see our wealth and tremble.\n\nGhana is the land of gold, and I am its master.",
    "displayDate": "1068",
    "timestamp": "1068-03-10T14:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1567,
    "comments": 134,
    "shares": 189,
    "accuracy": "verified",
    "historicalContext": "Al-Bakri's account describes the Ghana king's court in detail: the gold decorations, the elaborate rituals, the display of wealth. Ghana's kings used this display to impress visiting merchants and ambassadors.",
    "location": { "name": "Koumbi Saleh, Ghana Empire", "coordinates": [15.77, -7.97] }
  },
  {
    "id": "africa-008",
    "authorId": "sunni-ali",
    "content": "The scholars of Timbuktu speak against me. They call me impious because I follow the old ways alongside Islam.\n\nLet them talk. While they debate theology, I conquer.\n\nI have taken Timbuktu from the Tuareg. I have taken Djenné after a siege of seven years. The Songhai Empire stretches from the Sahara to the forest.\n\nHistory remembers conquerors, not critics.",
    "displayDate": "1473",
    "timestamp": "1473-01-01T12:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1678,
    "comments": 189,
    "shares": 234,
    "accuracy": "verified",
    "historicalContext": "Sunni Ali Ber founded the Songhai Empire, conquering Timbuktu in 1468 and Djenné in 1473. He was a brilliant military commander but controversial for maintaining traditional African religious practices alongside Islam.",
    "location": { "name": "Gao, Songhai Empire", "coordinates": [16.27, -0.04] }
  },
  {
    "id": "africa-009",
    "authorId": "askia-muhammad",
    "content": "I have performed the hajj to Mecca, as Mansa Musa did before me. But I went not only to pray - I went to learn.\n\nI brought back scholars, books, and ideas. I have reorganized the empire with provinces, each with its own governor. I have standardized weights and measures. I have expanded the universities of Timbuktu.\n\nSonghai will be an empire of law, not just conquest.",
    "displayDate": "1497",
    "timestamp": "1497-08-15T10:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1890,
    "comments": 167,
    "shares": 256,
    "accuracy": "verified",
    "historicalContext": "Askia Muhammad overthrew Sunni Ali's successor and made the hajj in 1496-97. He reorganized the Songhai Empire into provinces, established Islamic law, and promoted scholarship. Timbuktu became one of the great intellectual centers of the Islamic world.",
    "location": { "name": "Timbuktu, Songhai Empire", "coordinates": [16.77, -3.0] }
  },
  {
    "id": "africa-010",
    "authorId": "timbuktu-scholar",
    "content": "My library contains 700 volumes. My neighbor Ahmed Baba has thousands more. Timbuktu has more books than any city I have heard of outside Cairo.\n\nWe copy the Quran. We study medicine, astronomy, mathematics, law. Students come from Egypt, from Morocco, from across the Sahara.\n\nThe Europeans think Africa has no learning. They are ignorant. Timbuktu is proof.",
    "displayDate": "1510",
    "timestamp": "1510-05-20T09:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1567,
    "comments": 145,
    "shares": 212,
    "accuracy": "verified",
    "historicalContext": "Timbuktu was a major center of Islamic learning with three great mosques and numerous madrasas. Scholars like Ahmed Baba owned vast libraries. Manuscripts on theology, law, medicine, and astronomy were produced and collected there.",
    "location": { "name": "Timbuktu", "coordinates": [16.77, -3.0] }
  },
  {
    "id": "africa-011",
    "authorId": "ahmed-baba",
    "content": "The Moroccans have come with their guns and their greed. They have sacked Timbuktu. They have arrested me and my fellow scholars.\n\nThey take me to Marrakesh in chains, but they cannot take my knowledge. I carry 1,600 books in my head - memorized, safe from fire and theft.\n\nEmpires fall. Libraries burn. But learning endures in those who remember.",
    "displayDate": "1594",
    "timestamp": "1594-04-01T15:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1456,
    "comments": 189,
    "shares": 234,
    "accuracy": "verified",
    "historicalContext": "Ahmed Baba was Timbuktu's greatest scholar when Morocco invaded in 1591. He was captured and exiled to Marrakesh for 12 years. He wrote over 40 books and had a personal library of 1,600 volumes before they were confiscated.",
    "location": { "name": "Timbuktu", "coordinates": [16.77, -3.0] }
  },
  {
    "id": "africa-012",
    "authorId": "great-zimbabwe-king",
    "content": "The walls of Great Zimbabwe rise without mortar. Stone upon stone, fitted so perfectly that not even a blade of grass can grow between them.\n\nA million blocks. A thousand workers. A hundred years. This is what my ancestors built.\n\nFrom this hill, I can see the trade routes to the coast. Gold, ivory, copper - all flow through my city. We trade with Arabs, with Indians, with the Chinese.\n\nZimbabwe means 'houses of stone.' We have earned the name.",
    "displayDate": "1350",
    "timestamp": "1350-06-15T11:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1789,
    "comments": 156,
    "shares": 267,
    "accuracy": "verified",
    "historicalContext": "Great Zimbabwe was the capital of a wealthy trading kingdom in southern Africa. Its massive stone walls were built without mortar. The city controlled gold and ivory trade with Swahili coast merchants. At its peak, it housed 18,000 people.",
    "location": { "name": "Great Zimbabwe", "coordinates": [-20.27, 30.93] }
  },
  {
    "id": "africa-013",
    "authorId": "swahili-merchant",
    "content": "I speak Arabic to the traders from Oman. I speak Bantu to the people of the interior. I speak the language of gold and ivory to everyone.\n\nKilwa is my home - the greatest port on the African coast. Ships from India, from Persia, from as far as China anchor in our harbor.\n\nThey bring porcelain, cloth, and beads. They leave with gold, slaves, and ivory.\n\nThe Indian Ocean is our highway. Africa is not isolated - Africa is connected.",
    "displayDate": "1331",
    "timestamp": "1331-09-01T10:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1456,
    "comments": 134,
    "shares": 189,
    "accuracy": "verified",
    "historicalContext": "The Swahili coast cities like Kilwa, Mombasa, and Zanzibar were major trading hubs connecting Africa to the Indian Ocean world. Ibn Battuta visited Kilwa in 1331 and called it one of the most beautiful cities in the world.",
    "location": { "name": "Kilwa, East Africa", "coordinates": [-8.95, 39.52] }
  },
  {
    "id": "africa-014",
    "authorId": "ibn-battuta-africa",
    "content": "I have traveled from Morocco to Mali, following the salt roads across the Sahara. The journey nearly killed me - fifty days of sand and heat.\n\nBut Mali is worth the suffering. The people are devout Muslims. They memorize the Quran. Their king is richer than any I have seen.\n\nAnd the women! They walk unveiled, speak freely to men. Even the king's sisters show their faces. Most strange, but the Malians see nothing wrong with it.",
    "displayDate": "1352",
    "timestamp": "1352-02-15T14:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1567,
    "comments": 178,
    "shares": 223,
    "accuracy": "verified",
    "historicalContext": "Ibn Battuta visited Mali in 1352 and left detailed accounts. He praised the people's devotion to Islam but was shocked by the freedom women enjoyed compared to other Islamic societies. His Rihla is a key source on medieval Africa.",
    "location": { "name": "Mali Empire", "coordinates": [14.0, -4.0] }
  },
  {
    "id": "africa-015",
    "authorId": "salt-trader",
    "content": "In the north, salt is common as sand. In the south, gold is common as dust. My fortune is made carrying one to the other.\n\nTwenty days across the Sahara with camels loaded with salt blocks. Each block is worth its weight in gold in the markets of the Sudan.\n\nMen die of thirst on this road. Men die of heat. But those who survive become rich beyond dreams.\n\nSalt is life. Gold is wealth. I trade in both.",
    "displayDate": "1400",
    "timestamp": "1400-03-20T08:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1234,
    "comments": 112,
    "shares": 167,
    "accuracy": "likely",
    "historicalContext": "The trans-Saharan trade exchanged salt from the Sahara (essential for survival in tropical Africa) for gold from West Africa. Salt was so valuable it was sometimes traded ounce-for-ounce with gold. The trade routes created great wealth.",
    "location": { "name": "Sahara Desert", "coordinates": [23.0, 0.0] }
  },
  {
    "id": "africa-016",
    "authorId": "gold-miner",
    "content": "I work in the mines of Bambuk, where gold grows in the earth like roots. We dig when the river is low and the ground is dry.\n\nThe king's men come to collect their share - the nuggets belong to him. We keep only the dust. But even the dust makes us richer than farmers.\n\nThey say our gold goes north across the desert, then across the sea to lands we cannot imagine. Somewhere, a king wears my gold around his neck.\n\nI will never see it. But I dug it from the earth with my own hands.",
    "displayDate": "1300",
    "timestamp": "1300-11-15T10:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1123,
    "comments": 98,
    "shares": 145,
    "accuracy": "likely",
    "historicalContext": "The Bambuk and Bure goldfields were the primary sources of West African gold. Miners worked during the dry season when rivers receded. African gold flowed to the Mediterranean and eventually to Europe, fueling medieval economies.",
    "location": { "name": "Bambuk, Mali Empire", "coordinates": [12.5, -11.5] }
  },
  {
    "id": "africa-017",
    "authorId": "griot",
    "content": "I am the memory of my people. What I forget, the world forgets.\n\nI sing of Sundiata, the Lion King who could not walk. I sing of the Battle of Kirina. I sing of the founding of Mali.\n\nNo book holds these stories - only my voice, and the voices of my fathers, and their fathers before them.\n\nWhen I die, my son will carry the memory. The chain must never break.\n\nListen, and remember. This is how we defeat death.",
    "displayDate": "1380",
    "timestamp": "1380-08-01T18:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1567,
    "comments": 145,
    "shares": 212,
    "accuracy": "likely",
    "historicalContext": "Griots are the hereditary historians and musicians of West Africa. They memorize and transmit the history, genealogies, and traditions of their people through oral performance. The Epic of Sundiata has been preserved by griots for nearly 800 years.",
    "location": { "name": "Mali Empire", "coordinates": [14.0, -4.0] }
  },
  {
    "id": "africa-018",
    "authorId": "kongo-king",
    "content": "Strange men have arrived from the sea in ships with wings of cloth. They have pale skin and hair on their faces. They carry sticks that make thunder.\n\nThey say they come from a place called Portugal. They want to trade - cloth and metal for our ivory and slaves.\n\nI am curious about their God, their Jesus. Perhaps there is wisdom in their ways.\n\nI will welcome them. But I will watch them carefully.",
    "displayDate": "1483",
    "timestamp": "1483-04-01T11:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1345,
    "comments": 167,
    "shares": 189,
    "accuracy": "verified",
    "historicalContext": "Portuguese explorer Diogo Cão reached the Kingdom of Kongo in 1483. The Kongo king, Nzinga a Nkuwu, established diplomatic relations and eventually converted to Christianity, taking the name João I. This began a complex relationship between Kongo and Portugal.",
    "location": { "name": "M'banza-Kongo", "coordinates": [-6.27, 14.25] }
  },
  {
    "id": "africa-019",
    "authorId": "afonso-kongo",
    "content": "I have embraced the faith of Christ and taken the name Afonso. I have built churches. I have sent my son Henrique to study in Lisbon - he will return as the first African bishop.\n\nBut the Portuguese betray us. Their slave traders steal my people - even nobles, even Christians. They care nothing for God, only for profit.\n\nI write to the King of Portugal: stop this evil, or I will expel your merchants forever.\n\nChristianity teaches love. The Portuguese teach only greed.",
    "displayDate": "1526",
    "timestamp": "1526-07-06T09:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1456,
    "comments": 189,
    "shares": 234,
    "accuracy": "verified",
    "historicalContext": "Afonso I of Kongo was a devout Christian who tried to modernize his kingdom. His letters to the Portuguese king protesting the slave trade are among the earliest African critiques of European colonialism. His son Henrique became the first sub-Saharan African bishop.",
    "location": { "name": "M'banza-Kongo", "coordinates": [-6.27, 14.25] }
  },
  {
    "id": "africa-020",
    "authorId": "queen-amina",
    "content": "They say a woman cannot lead warriors. They said it when I first picked up a sword. They said it when I rode to war beside my brother.\n\nThey do not say it anymore.\n\nI am Amina of Zazzau. I have conquered cities from Kano to Katsina. I have built walls around every town I take - they call them 'Amina's walls.'\n\nA woman's place? Wherever she is strong enough to stand.",
    "displayDate": "1576",
    "timestamp": "1576-06-15T12:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1890,
    "comments": 212,
    "shares": 312,
    "accuracy": "verified",
    "historicalContext": "Queen Amina of Zazzau (in modern Nigeria) was a warrior queen who expanded her kingdom through conquest in the 16th century. She is credited with building defensive walls around conquered cities. Her legacy survives in Hausa oral tradition.",
    "location": { "name": "Zazzau (Zaria), Nigeria", "coordinates": [11.08, 7.71] }
  },
  {
    "id": "africa-021",
    "authorId": "ethiopian-king",
    "content": "We are the children of Solomon and Sheba. Our church has stood since the Apostles. While Europe was in darkness, we preserved the faith.\n\nThe Muslims surround us - to the north, to the east, to the south. But we endure. The mountains protect us. Our faith sustains us.\n\nRome sends priests to 'teach' us Christianity. We smile and nod. We were Christian before Rome was.",
    "displayDate": "1450",
    "timestamp": "1450-01-20T10:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1567,
    "comments": 145,
    "shares": 189,
    "accuracy": "likely",
    "historicalContext": "Ethiopia (Abyssinia) has been Christian since the 4th century, making it one of the oldest Christian nations. Ethiopian Christianity developed independently, with its own traditions, calendar, and biblical canon. The Solomonic dynasty claimed descent from Solomon and the Queen of Sheba.",
    "location": { "name": "Ethiopia", "coordinates": [9.0, 38.75] }
  },
  {
    "id": "africa-022",
    "authorId": "djenne-architect",
    "content": "The Great Mosque of Djenné is complete. Built entirely of mud brick, it is the largest mud-brick building in the world.\n\nEvery year, after the rains, the whole city comes together to replaster the walls. It is a festival - men on scaffolds, women carrying water, children mixing mud.\n\nThe mosque is not just a building. It is our community made visible.\n\nEarth to earth. People to people. This is how we build.",
    "displayDate": "1280",
    "timestamp": "1280-05-01T11:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1345,
    "comments": 123,
    "shares": 178,
    "accuracy": "verified",
    "historicalContext": "The Great Mosque of Djenné is the largest mud-brick (adobe) building in the world. The current structure dates to 1907, built on the site of earlier mosques from the 13th century. The annual replastering festival continues to this day.",
    "location": { "name": "Djenné, Mali", "coordinates": [13.91, -4.56] }
  },
  {
    "id": "africa-023",
    "authorId": "mansa-musa",
    "content": "I have established the University of Sankore in Timbuktu. It will rival Al-Azhar in Cairo.\n\nStudents will study the Quran, of course, but also mathematics, medicine, astronomy, law, and history. They will come from across the Muslim world.\n\nMy grandfather gave Mali gold. My father gave Mali peace. I will give Mali knowledge.\n\nGold can be stolen. Knowledge cannot.",
    "displayDate": "1327",
    "timestamp": "1327-09-01T10:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 2123,
    "comments": 178,
    "shares": 289,
    "accuracy": "verified",
    "historicalContext": "Mansa Musa greatly expanded the University of Sankore in Timbuktu, making it one of the foremost centers of learning in the Islamic world. At its peak, it had 25,000 students. The university's manuscripts are still being preserved today.",
    "location": { "name": "Timbuktu, Mali Empire", "coordinates": [16.77, -3.0] }
  },
  {
    "id": "africa-024",
    "authorId": "caravan-leader",
    "content": "Forty days across the Sahara. Forty days of sand and sun and thirst.\n\nWe follow the stars and the wind. We find water at the oases or we die. We have lost three men already to the desert.\n\nBut ahead lies Timbuktu - gold, salt, slaves, and profit beyond measure. Behind us lies Sijilmasa and the markets of the north.\n\nThe desert is death. But crossing the desert is life.",
    "displayDate": "1420",
    "timestamp": "1420-04-15T06:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1234,
    "comments": 112,
    "shares": 156,
    "accuracy": "likely",
    "historicalContext": "Trans-Saharan caravans could include thousands of camels and took 40-70 days to cross. The mortality rate was high - from thirst, heat, and bandits. Oases were essential waypoints, and routes were closely guarded secrets.",
    "location": { "name": "Sahara Desert", "coordinates": [25.0, 5.0] }
  },
  {
    "id": "africa-025",
    "authorId": "benin-king",
    "content": "The Portuguese have come to trade. They want our pepper, our ivory, our cloth.\n\nI have sent an ambassador to Lisbon. I have allowed them to build a trading post. But I will not allow them to buy slaves from Benin. My people are not for sale.\n\nWe will trade as equals, or we will not trade at all.\n\nLet them know: the Oba of Benin bows to no one.",
    "displayDate": "1486",
    "timestamp": "1486-08-01T14:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1567,
    "comments": 167,
    "shares": 223,
    "accuracy": "verified",
    "historicalContext": "The Kingdom of Benin had sophisticated diplomatic relations with Portugal. The Oba (king) Esigie sent ambassadors to Lisbon and received Portuguese missionaries. Benin initially restricted the slave trade, selling only war captives, not subjects.",
    "location": { "name": "Benin City", "coordinates": [6.34, 5.63] }
  },
  {
    "id": "africa-026",
    "authorId": "benin-bronzesmith",
    "content": "I am a master of the Guild of Bronze Casters. My father was a caster. His father was a caster. We serve the Oba.\n\nThe bronze plaques I make tell the history of Benin - kings and queens, warriors and priests, the Portuguese with their strange hats and guns.\n\nOne day, centuries from now, someone will look at my work and know: Benin was great. Benin had art. Benin had history.\n\nThe bronze will remember what words forget.",
    "displayDate": "1550",
    "timestamp": "1550-07-20T11:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1456,
    "comments": 145,
    "shares": 189,
    "accuracy": "likely",
    "historicalContext": "The Benin Bronzes are among Africa's greatest artistic achievements. Cast using the lost-wax technique, they depicted court life, history, and Portuguese traders. Thousands were looted by the British in 1897 and are now in museums worldwide.",
    "location": { "name": "Benin City", "coordinates": [6.34, 5.63] }
  },
  {
    "id": "africa-027",
    "authorId": "askia-muhammad",
    "content": "I have divided the empire into provinces, each with its governor. I have appointed judges to administer Islamic law. I have standardized weights and measures for trade.\n\nSunni Ali conquered. I must govern.\n\nConquest is easy - any warlord with an army can conquer. But building a state that lasts? That requires wisdom, patience, and the rule of law.\n\nSonghai will not just be powerful. Songhai will be civilized.",
    "displayDate": "1500",
    "timestamp": "1500-03-01T10:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1678,
    "comments": 156,
    "shares": 234,
    "accuracy": "verified",
    "historicalContext": "Askia Muhammad transformed the Songhai Empire from a conquest state into an organized bureaucracy. He created provinces with appointed governors, established Islamic courts, and promoted trade by standardizing commerce. His reforms made Songhai the largest empire in African history.",
    "location": { "name": "Gao, Songhai Empire", "coordinates": [16.27, -0.04] }
  },
  {
    "id": "africa-028",
    "authorId": "moroccan-soldier",
    "content": "We crossed the Sahara - 4,000 men with muskets and cannons. The Songhai had never seen such weapons.\n\nAt Tondibi, we met their army. They had cavalry, spears, and courage. But courage cannot stop bullets.\n\nThe empire of Songhai fell in a single day. Their king fled. Their cities surrendered.\n\nWe came for gold. We found a civilization. And we destroyed it for a few tons of metal.",
    "displayDate": "1591",
    "timestamp": "1591-03-13T15:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1234,
    "comments": 189,
    "shares": 178,
    "accuracy": "verified",
    "historicalContext": "Morocco invaded Songhai in 1591, crossing the Sahara with arquebusiers and cannon. At the Battle of Tondibi, firearms defeated the Songhai cavalry. The invasion ended the Songhai Empire but Morocco never fully controlled the region, and the trans-Saharan trade declined.",
    "location": { "name": "Tondibi, Songhai", "coordinates": [16.5, -1.5] }
  },
  {
    "id": "africa-029",
    "authorId": "mapungubwe-king",
    "content": "From this hilltop, I see my kingdom spread beneath me. The Limpopo River brings life to my people.\n\nWe trade gold and ivory with the coast. We shape gold into rhinoceros and cattle - sacred animals that carry our spirits.\n\nMy kingdom is not large, but it is mine. My ancestors built it. My children will inherit it.\n\nThe hill is sacred. Only royalty may climb it. Here, above the world, we are closer to the sky.",
    "displayDate": "1220",
    "timestamp": "1220-05-01T11:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1123,
    "comments": 98,
    "shares": 145,
    "accuracy": "likely",
    "historicalContext": "Mapungubwe in southern Africa (modern South Africa/Zimbabwe border) was a wealthy trading kingdom before Great Zimbabwe. The famous golden rhinoceros was found there. The hilltop settlement was restricted to royalty, showing sophisticated social hierarchy.",
    "location": { "name": "Mapungubwe, Southern Africa", "coordinates": [-22.19, 29.42] }
  },
  {
    "id": "africa-030",
    "authorId": "axum-king",
    "content": "The Prophet's followers have come to us from Arabia, fleeing persecution. They say their own people tried to kill them.\n\nI have given them refuge. Axum has always welcomed traders and travelers. These Muslims are peaceful - they pray five times a day, they do not drink wine, they speak of one God.\n\nWe Ethiopians know what it is to be different. We know what it is to keep faith when surrounded by enemies.\n\nLet them stay. Their God and ours can share this land.",
    "displayDate": "615",
    "timestamp": "0615-06-01T10:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1345,
    "comments": 123,
    "shares": 178,
    "accuracy": "verified",
    "historicalContext": "The First Hijra (615 CE) saw early Muslims flee Mecca to the Christian Kingdom of Axum (Ethiopia). King Armah gave them protection, reportedly saying 'You are safe.' This began a long tradition of Muslim-Christian coexistence in Ethiopia.",
    "location": { "name": "Axum, Ethiopia", "coordinates": [14.12, 38.72] }
  },
  {
    "id": "africa-031",
    "authorId": "timbuktu-scholar",
    "content": "A book arrived today from Cairo - a commentary on Aristotle by Ibn Rushd. I have been waiting three years for it.\n\nWe do not merely receive knowledge here in Timbuktu. We create it. My colleagues write on theology, on law, on medicine. Our manuscripts will outlive us.\n\nThe Arabs once called Africa 'the land of gold.' But our greatest wealth is not gold. It is what we know. It is what we write.\n\nPens are mightier than swords. Libraries outlast empires.",
    "displayDate": "1530",
    "timestamp": "1530-11-10T09:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1456,
    "comments": 134,
    "shares": 189,
    "accuracy": "likely",
    "historicalContext": "Timbuktu's scholars were prolific writers and avid collectors of books from across the Islamic world. The city had numerous private libraries. Many manuscripts survive today, protected by families who hid them during times of conflict.",
    "location": { "name": "Timbuktu", "coordinates": [16.77, -3.0] }
  },
  {
    "id": "africa-032",
    "authorId": "sundiata-keita",
    "content": "My mother carried me on her back across rivers and through forests. When I could not walk, she walked for both of us.\n\nIn exile, we had nothing - no kingdom, no army, no hope. But my mother never stopped believing in the prophecy.\n\n'You will be great,' she said. 'The griot has seen it.'\n\nToday I conquered an empire. But everything I am, I owe to her.\n\nRemember, warriors: behind every king stands a mother.",
    "displayDate": "1235",
    "timestamp": "1235-03-15T18:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1890,
    "comments": 189,
    "shares": 278,
    "accuracy": "likely",
    "historicalContext": "Sogolon Condé, Sundiata's mother, is a central figure in the Epic of Sundiata. She protected him during his disabled childhood and exile, never losing faith in his destiny. Her strength and devotion are celebrated in Mande oral tradition.",
    "location": { "name": "Niani, Mali Empire", "coordinates": [11.35, -8.2] }
  },
  {
    "id": "africa-033",
    "authorId": "swahili-poet",
    "content": "I write in Kiswahili - the language of the coast. We take words from Arabic, from Portuguese, from the languages of the interior. We make them our own.\n\nMy poems tell of love, of loss, of the sea. They tell of ships from distant lands and treasures from beyond the horizon.\n\nThe ocean connects us to the world. Our words connect us to each other.\n\nThis is what it means to be Swahili: to take from everywhere and create something new.",
    "displayDate": "1450",
    "timestamp": "1450-08-20T17:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1234,
    "comments": 112,
    "shares": 167,
    "accuracy": "likely",
    "historicalContext": "Kiswahili (Swahili) is a Bantu language enriched with Arabic, Persian, Portuguese, and Indian loanwords. It developed as a trade language on the East African coast and became the medium for a rich literary tradition including poetry and historical chronicles.",
    "location": { "name": "Swahili Coast", "coordinates": [-6.0, 39.0] }
  },
  {
    "id": "africa-034",
    "authorId": "mansa-musa",
    "content": "They ask me: 'How rich are you?'\n\nI tell them: I do not count my gold. I do not know how much I have. There is too much to count.\n\nBut wealth means nothing if your people are hungry. I have built granaries in every city. I have opened roads for trade. I have made Mali safe for travelers.\n\nA rich king with poor subjects is no king at all. My wealth is my people's wealth. Their prosperity is mine.",
    "displayDate": "1330",
    "timestamp": "1330-04-01T11:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 2234,
    "comments": 198,
    "shares": 334,
    "accuracy": "likely",
    "historicalContext": "Mansa Musa is often cited as the richest person in history. Adjusting for inflation, his wealth has been estimated at $400 billion. But he was also known for public works, infrastructure, and supporting his subjects during famines.",
    "location": { "name": "Niani, Mali Empire", "coordinates": [11.35, -8.2] }
  },
  {
    "id": "africa-035",
    "authorId": "kilwa-sultan",
    "content": "The monsoons rule our world. From December to March, the winds blow from the north - the Arabs sail down to us, their dhows heavy with cloth and beads.\n\nFrom April to September, the winds reverse - they sail home, carrying our gold and ivory.\n\nThe sea is not a barrier. The sea is a highway. The monsoons are our schedule.\n\nWe do not fight the wind. We use it.",
    "displayDate": "1300",
    "timestamp": "1300-01-15T10:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1345,
    "comments": 123,
    "shares": 178,
    "accuracy": "verified",
    "historicalContext": "The monsoon winds made predictable trade routes possible across the Indian Ocean. Swahili coast merchants built their commercial calendar around these seasonal winds. Kilwa Kisiwani was the most powerful Swahili city-state from the 13th to 15th centuries.",
    "location": { "name": "Kilwa Kisiwani", "coordinates": [-8.95, 39.52] }
  },
  {
    "id": "africa-036",
    "authorId": "hausa-trader",
    "content": "I trade in kola nuts - the bitter seeds that keep men awake and make friends of strangers.\n\nIn the south, kola grows on trees. In the north, Muslims prize it because they cannot drink alcohol. The profit is in the carrying.\n\nI have made this journey twenty times. I know every village, every chief, every danger.\n\nTrade is not just buying and selling. Trade is knowing. Trade is connections. Trade is trust.",
    "displayDate": "1500",
    "timestamp": "1500-06-01T08:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1123,
    "comments": 98,
    "shares": 145,
    "accuracy": "likely",
    "historicalContext": "Kola nuts were a major trade commodity in West Africa. They contain caffeine and were valued as a stimulant and for social/ritual use. The kola trade connected the forest regions with the savanna and Sahel, creating networks that predated European contact.",
    "location": { "name": "Kano, Hausaland", "coordinates": [12.0, 8.52] }
  },
  {
    "id": "africa-037",
    "authorId": "african-slave",
    "content": "They took me from my village when I was twelve. They marched me to the coast in chains. They packed me into a ship with hundreds of others.\n\nI survived the crossing. Many did not.\n\nNow I work in the cane fields of Brazil. The sun burns. The overseers beat us. I will never see home again.\n\nBut I remember. I remember my mother's face. I remember my father's voice. I remember my name.\n\nThey can take everything else. They cannot take my memory.",
    "displayDate": "1580",
    "timestamp": "1580-09-01T06:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1789,
    "comments": 267,
    "shares": 312,
    "accuracy": "likely",
    "historicalContext": "The Atlantic slave trade began in earnest in the 16th century, devastating African societies. An estimated 12.5 million Africans were forcibly transported to the Americas. The human cost was immeasurable - broken families, lost cultures, stolen lives.",
    "location": { "name": "Atlantic Ocean", "coordinates": [-5.0, -25.0] }
  },
  {
    "id": "africa-038",
    "authorId": "nzinga-queen",
    "content": "The Portuguese came offering trade. Now they demand tribute. They raid our villages for slaves. They call us savages while they tear families apart.\n\nI am Nzinga, Queen of Ndongo and Matamba. I will not kneel.\n\nI have formed alliances with their enemies. I have welcomed escaped slaves into my army. I have fought them for forty years.\n\nThey have guns. I have will. We shall see which is stronger.",
    "displayDate": "1640",
    "timestamp": "1640-03-15T11:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1890,
    "comments": 212,
    "shares": 289,
    "accuracy": "verified",
    "historicalContext": "Queen Nzinga of Ndongo and Matamba (modern Angola) resisted Portuguese colonization for over 40 years. She was a brilliant military tactician and diplomat who created a powerful state by incorporating escaped slaves and war refugees into her kingdom.",
    "location": { "name": "Matamba, Angola", "coordinates": [-9.0, 16.0] }
  },
  {
    "id": "africa-039",
    "authorId": "great-zimbabwe-builder",
    "content": "My father was a builder. His father was a builder. We know the secret of the walls.\n\nNo mortar - only stone fitted against stone. We split the granite into bricks with fire and water. We shape each piece by hand until it fits perfectly.\n\nThe king says: make the walls higher. Make them thicker. Let everyone who sees them know the power of Zimbabwe.\n\nStone does not lie. Stone does not boast. Stone simply stands, century after century, speaking of those who built it.",
    "displayDate": "1300",
    "timestamp": "1300-02-10T09:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1234,
    "comments": 112,
    "shares": 167,
    "accuracy": "likely",
    "historicalContext": "Great Zimbabwe's walls were built without mortar using precisely fitted granite blocks. The construction technique was indigenous and sophisticated. Colonial-era Europeans refused to believe Africans built it, inventing theories about lost white civilizations.",
    "location": { "name": "Great Zimbabwe", "coordinates": [-20.27, 30.93] }
  },
  {
    "id": "africa-040",
    "authorId": "lalibela-priest",
    "content": "King Lalibela has commanded us to build churches - not on the earth, but in it. We carve downward into the rock, revealing what God has hidden.\n\nEleven churches, each cut from a single stone. The Church of Saint George descends forty feet. Water channels keep it dry.\n\nPilgrims call it the New Jerusalem. They say angels helped us carve it.\n\nNo angels. Only faith, and sweat, and a king's vision.",
    "displayDate": "1220",
    "timestamp": "1220-08-15T10:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1567,
    "comments": 145,
    "shares": 212,
    "accuracy": "verified",
    "historicalContext": "The rock-hewn churches of Lalibela in Ethiopia were carved from solid volcanic rock in the 12th-13th centuries. Eleven churches connected by tunnels and passages form a complex meant to recreate Jerusalem. They remain an active pilgrimage site.",
    "location": { "name": "Lalibela, Ethiopia", "coordinates": [12.03, 39.04] }
  },
  {
    "id": "africa-041",
    "authorId": "leo-africanus",
    "content": "I was born in Granada, raised in Fez, and have traveled across Africa. I have seen Timbuktu, the city of gold and books. I have crossed the Sahara.\n\nNow the Christians have captured me and brought me to Rome. The Pope has baptized me and given me a new name - Leo Africanus.\n\nThey ask me to write about Africa. Very well. I will show them a continent they never imagined - not savage, but civilized. Not poor, but rich.\n\nLet Europe learn.",
    "displayDate": "1520",
    "timestamp": "1520-04-01T14:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1456,
    "comments": 167,
    "shares": 223,
    "accuracy": "verified",
    "historicalContext": "Leo Africanus (al-Hasan ibn Muhammad al-Wazzan) was a Berber diplomat and traveler captured by pirates and presented to Pope Leo X. His 'Description of Africa' (1526) was Europe's main source of knowledge about Africa for centuries.",
    "location": { "name": "Rome, Italy", "coordinates": [41.9, 12.5] }
  },
  {
    "id": "africa-042",
    "authorId": "sunni-ali",
    "content": "They call me Sunni Ali Ber - 'the Great.' I have conquered more than any king before me.\n\nBut I did not conquer with Islam alone. The old spirits of the river, the old gods of the forest - they still have power. I honor them as I honor Allah.\n\nThe scholars say this makes me impious. Let them say what they will. I am building an empire. What are they building?\n\nVictory justifies all.",
    "displayDate": "1468",
    "timestamp": "1468-01-30T12:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1345,
    "comments": 156,
    "shares": 189,
    "accuracy": "verified",
    "historicalContext": "Sunni Ali practiced syncretic religion, combining Islam with traditional Songhai beliefs. This made him unpopular with Muslim scholars but connected him with common people. His religious flexibility may have aided his military success.",
    "location": { "name": "Gao, Songhai Empire", "coordinates": [16.27, -0.04] }
  },
  {
    "id": "africa-043",
    "authorId": "dogon-elder",
    "content": "We live in the cliffs above the plain. When slavers come, when warriors come, we climb where they cannot follow.\n\nOur ancestors fled here generations ago. Now the cliffs are home. We carve granaries into the rock. We bury our dead in caves above the clouds.\n\nThe world below changes - empires rise and fall. We watch from the heights.\n\nThe cliffs protect us. The cliffs remember. We are the people of the stone.",
    "displayDate": "1500",
    "timestamp": "1500-07-01T09:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1123,
    "comments": 98,
    "shares": 145,
    "accuracy": "likely",
    "historicalContext": "The Dogon people settled in the Bandiagara Cliffs of Mali, escaping from slave raiders and empires. Their cliff dwellings, granaries, and burial caves are architectural marvels. Dogon cosmology and art have influenced thinkers worldwide.",
    "location": { "name": "Bandiagara Cliffs, Mali", "coordinates": [14.35, -3.61] }
  },
  {
    "id": "africa-044",
    "authorId": "fulani-herder",
    "content": "My people follow the cattle. Where the grass is green, we go. We know no borders - the savanna is our home, from Senegal to Lake Chad.\n\nThe settled people fear us. They call us wanderers, rootless. But we are not rootless - our roots are in our cattle, in our families, in our traditions.\n\nEmpires build walls. We walk around them. Empires fall. We remain.\n\nThe grass grows back. The cattle move on. So do we.",
    "displayDate": "1450",
    "timestamp": "1450-10-15T07:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 987,
    "comments": 87,
    "shares": 123,
    "accuracy": "likely",
    "historicalContext": "The Fulani are traditionally pastoralists who moved across the West African Sahel with their cattle. Their mobility made them hard to control but also made them influential across multiple kingdoms. Some Fulani later founded their own states.",
    "location": { "name": "Sahel, West Africa", "coordinates": [14.0, 0.0] }
  },
  {
    "id": "africa-045",
    "authorId": "afonso-kongo",
    "content": "I have learned to read. I have learned to write. I have studied the Bible in Portuguese and Latin.\n\nNow I write letters - to the Pope, to the King of Portugal, to anyone who will listen. I tell them: stop the slave trade. It is destroying my kingdom.\n\nBut paper cannot stop ships. Words cannot stop chains.\n\nI believed Christianity would save us. Instead, Christian merchants sell my people like cattle.\n\nWhat god do they truly worship? Not the God of love.",
    "displayDate": "1540",
    "timestamp": "1540-10-18T11:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1567,
    "comments": 198,
    "shares": 256,
    "accuracy": "verified",
    "historicalContext": "Afonso I of Kongo wrote numerous letters protesting the slave trade. His letters to Portugal and the Vatican are among the earliest African documents critiquing European exploitation. Despite his pleas, the trade continued and intensified.",
    "location": { "name": "M'banza-Kongo", "coordinates": [-6.27, 14.25] }
  },
  {
    "id": "africa-046",
    "authorId": "saharan-guide",
    "content": "I know the desert like I know my own face. Every dune, every oasis, every well that holds water in the dry season.\n\nThe merchants pay me to guide them across. Without me, they would die in days. The Sahara does not forgive mistakes.\n\nI show them the stars we navigate by. I show them the signs of water - the plants, the birds, the color of the sand.\n\nThe desert is not empty. The desert is full of secrets. I know them all.",
    "displayDate": "1350",
    "timestamp": "1350-05-20T05:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1123,
    "comments": 98,
    "shares": 145,
    "accuracy": "likely",
    "historicalContext": "Desert guides were essential for trans-Saharan trade. They knew the locations of wells, safe routes, and seasonal patterns. Their knowledge was passed down through generations and was literally a matter of life and death for caravans.",
    "location": { "name": "Sahara Desert", "coordinates": [23.0, 3.0] }
  },
  {
    "id": "africa-047",
    "authorId": "mansa-musa",
    "content": "The European maps now show my kingdom. They draw me sitting on a throne, holding gold.\n\nGood. Let them know.\n\nWhen I crossed the Sahara, the world changed. Before my hajj, they thought Africa was empty - a blank space on their maps. Now they know.\n\nMali is real. Mali is rich. Mali is civilized.\n\nI did not just go to Mecca to pray. I went to be seen. To be remembered.\n\nMission accomplished.",
    "displayDate": "1335",
    "timestamp": "1335-01-01T10:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 2456,
    "comments": 234,
    "shares": 389,
    "accuracy": "verified",
    "historicalContext": "The 1375 Catalan Atlas shows Mansa Musa holding gold, the first African ruler depicted on a European map. His hajj put West Africa on the mental map of Europe and the Middle East, transforming perceptions of the continent.",
    "location": { "name": "Mali Empire", "coordinates": [14.0, -4.0] }
  },
  {
    "id": "africa-048",
    "authorId": "ethiopian-scribe",
    "content": "I copy the holy books by hand - the Gospels in Ge'ez, our sacred language. I illuminate the margins with saints and angels, with the Virgin Mary, with the lion of Judah.\n\nEuropean books are printed now, made by machines. But we still copy by hand, as our fathers did.\n\nEach letter is a prayer. Each page is devotion. The machine cannot pray.\n\nSome things should not be made faster. Some things should be made with love.",
    "displayDate": "1520",
    "timestamp": "1520-12-25T09:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1234,
    "comments": 112,
    "shares": 167,
    "accuracy": "likely",
    "historicalContext": "Ethiopian scribes maintained a tradition of hand-copying and illuminating religious manuscripts long after printing spread elsewhere. Ethiopian illuminated manuscripts are distinctive, featuring unique iconography and the Ge'ez script, which is still used liturgically.",
    "location": { "name": "Ethiopia", "coordinates": [9.0, 38.75] }
  },
  {
    "id": "africa-049",
    "authorId": "great-zimbabwe-king",
    "content": "The walls are falling. The gold is running out. Our trade with the coast has declined.\n\nMy people are leaving - moving north, moving south, seeking better land. The city that was the center of the world is emptying.\n\nPerhaps this is the way of things. Kingdoms rise and fall. Cities grow and shrink.\n\nBut the walls will remain. A thousand years from now, someone will stand here and wonder: who built this? Who were they?\n\nWe were Zimbabwe. We were great.",
    "displayDate": "1420",
    "timestamp": "1420-06-01T15:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1345,
    "comments": 145,
    "shares": 189,
    "accuracy": "likely",
    "historicalContext": "Great Zimbabwe declined in the 15th century due to environmental degradation, overgrazing, and shifting trade routes. The population dispersed to other regions, founding new states like Mutapa and Torwa. The ruins remained, eventually becoming a symbol of African achievement.",
    "location": { "name": "Great Zimbabwe", "coordinates": [-20.27, 30.93] }
  },
  {
    "id": "africa-050",
    "authorId": "ahmed-baba",
    "content": "The Moroccans have destroyed everything. Our libraries are looted. Our scholars are dead or exiled.\n\nBut they cannot burn what I have memorized. They cannot silence what I have taught.\n\nMy students have scattered across Africa. Each one carries knowledge. Each one will teach others.\n\nTimbuktu may fall. The books may burn. But learning survives in those who learned.\n\nThis is how knowledge defeats empires. This is how wisdom defeats swords.\n\nTeach. Remember. Pass it on.",
    "displayDate": "1599",
    "timestamp": "1599-08-01T17:00:00Z",
    "era": "african-kingdoms",
    "type": "post",
    "likes": 1678,
    "comments": 189,
    "shares": 267,
    "accuracy": "likely",
    "historicalContext": "After the Moroccan invasion destroyed Songhai, Timbuktu never regained its prominence as a center of learning. But scholars like Ahmed Baba dispersed across Africa, carrying their knowledge. Many Timbuktu manuscripts were hidden by families and survive today.",
    "location": { "name": "Marrakesh, Morocco", "coordinates": [31.63, -8.0] }
  }
]
