[
  {
    "id": "exploration-001",
    "authorId": "christopher-columbus",
    "content": "Land! After thirty-three days at sea. The men were ready to mutiny yesterday. Today they're crying and praying. I told them we'd find land. I was right. I'm always right. Now let's see what we've found.",
    "displayDate": "October 12, 1492",
    "timestamp": "1492-10-12T02:00:00Z",
    "era": "age-of-exploration",
    "type": "event",
    "likes": 4567,
    "comments": 890,
    "shares": 678,
    "accuracy": "verified",
    "historicalContext": "Columbus landed in the Bahamas on October 12, 1492, believing he had reached Asia. His voyage would transform world history, though the consequences for indigenous peoples would be catastrophic.",
    "location": { "name": "The Bahamas" }
  },
  {
    "id": "exploration-002",
    "authorId": "ferdinand-magellan",
    "content": "The strait is behind us. The Pacific lies ahead. Forty days of wind and rocks and terror, but we made it through. Now... now we just have to cross the largest ocean on Earth. Simple.",
    "displayDate": "November 28, 1520",
    "timestamp": "1520-11-28T14:00:00Z",
    "era": "age-of-exploration",
    "type": "event",
    "likes": 2345,
    "comments": 456,
    "shares": 345,
    "accuracy": "documented",
    "historicalContext": "Magellan navigated the strait that now bears his name, connecting the Atlantic to the Pacific. He named the new ocean 'Pacific' for its calmness. He would not survive to complete the voyage.",
    "location": { "name": "Strait of Magellan" }
  },
  {
    "id": "exploration-003",
    "authorId": "zheng-he",
    "content": "Three hundred ships. Twenty-seven thousand men. The treasure fleet sails again. The Emperor sends his greetings to the distant kingdoms. And his reminder that China watches.",
    "displayDate": "1405",
    "timestamp": "1405-07-11T08:00:00Z",
    "era": "age-of-exploration",
    "type": "event",
    "likes": 3456,
    "comments": 678,
    "shares": 567,
    "accuracy": "documented",
    "historicalContext": "Admiral Zheng He commanded the largest naval expeditions in history before the modern era. His treasure fleet reached Africa, the Persian Gulf, and possibly further, projecting Ming China's power.",
    "location": { "name": "Nanjing, China" }
  },
  {
    "id": "exploration-004",
    "authorId": "taino-elder",
    "content": "Strangers came from the sea today. White men with strange clothes and stranger weapons. They seem to think they've discovered something. We've been here for generations. But they don't ask. They just take.",
    "displayDate": "October 1492",
    "timestamp": "1492-10-13T10:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 2345,
    "comments": 567,
    "shares": 456,
    "accuracy": "inferred",
    "historicalContext": "The Taíno people of the Caribbean were the first indigenous Americans to encounter Columbus. Within decades, their population would be decimated by disease, enslavement, and violence.",
    "location": { "name": "The Bahamas" }
  },
  {
    "id": "exploration-005",
    "authorId": "vasco-da-gama",
    "content": "Reached India by sea. The spice trade is ours now. No more Muslim middlemen, no more Venetian profits. Portugal will be rich beyond imagination. The king will be pleased.",
    "displayDate": "May 20, 1498",
    "timestamp": "1498-05-20T12:00:00Z",
    "era": "age-of-exploration",
    "type": "event",
    "likes": 1890,
    "comments": 345,
    "shares": 278,
    "accuracy": "verified",
    "historicalContext": "Da Gama's voyage around Africa to India established a sea route that broke Venice's spice trade monopoly. It made Portugal wealthy and began European colonization of Asia.",
    "location": { "name": "Calicut, India" }
  },
  {
    "id": "exploration-006",
    "authorId": "spanish-sailor",
    "content": "The captain-general is dead. Killed in the Philippines fighting natives who didn't want to be converted. We're down to two ships and half our men. But we keep sailing west. There's no turning back.",
    "displayDate": "April 27, 1521",
    "timestamp": "1521-04-27T16:00:00Z",
    "era": "age-of-exploration",
    "type": "event",
    "likes": 1234,
    "comments": 234,
    "shares": 178,
    "accuracy": "verified",
    "historicalContext": "Magellan was killed at the Battle of Mactan in the Philippines. Juan Sebastián Elcano took command and completed the first circumnavigation of the globe with only 18 survivors.",
    "location": { "name": "Mactan, Philippines" }
  },
  {
    "id": "exploration-007",
    "authorId": "hernan-cortes",
    "content": "Burned the ships. No retreat now. Tenochtitlan lies ahead. The Aztecs have gold—mountains of it, they say. We have guns and horses and God. Let's see who wins.",
    "displayDate": "1519",
    "timestamp": "1519-08-15T09:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 1567,
    "comments": 456,
    "shares": 234,
    "accuracy": "documented",
    "historicalContext": "Cortés scuttled his ships to prevent retreat and marched inland with 500 men to conquer the Aztec Empire. Disease, indigenous allies, and superior weapons led to Spanish victory.",
    "location": { "name": "Veracruz, Mexico" }
  },
  {
    "id": "exploration-008",
    "authorId": "montezuma",
    "content": "The strangers approach. The omens spoke of gods returning from the sea. Are these men or gods? Their weapons breathe fire. Their beasts are like nothing we've seen. I will welcome them. I will learn what they want.",
    "displayDate": "November 1519",
    "timestamp": "1519-11-08T10:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 1890,
    "comments": 456,
    "shares": 345,
    "accuracy": "inferred",
    "historicalContext": "Montezuma II initially welcomed Cortés, possibly believing Aztec prophecies about returning gods. His hospitality would prove fatal—he died during the Spanish siege of Tenochtitlan.",
    "location": { "name": "Tenochtitlan, Mexico" }
  },
  {
    "id": "exploration-009",
    "authorId": "christopher-columbus",
    "content": "They say I'm lying about where I've been. They say these aren't the Indies. Maybe they're right. But I found new lands, new peoples, new routes. That should count for something. That should count for everything.",
    "displayDate": "1504",
    "timestamp": "1504-11-07T15:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 890,
    "comments": 234,
    "shares": 145,
    "accuracy": "inferred",
    "historicalContext": "Columbus died in 1506 still believing he had reached Asia. He never acknowledged that he had found a 'New World.' His reputation declined before his death as the truth emerged.",
    "location": { "name": "Valladolid, Spain" }
  },
  {
    "id": "exploration-010",
    "authorId": "bartolome-de-las-casas",
    "content": "What we do to the natives is not Christianity. It is murder. It is slavery. It is sin. I came to convert souls and found only corpses. Someone must speak for those who cannot speak.",
    "displayDate": "1542",
    "timestamp": "1542-06-15T11:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 2345,
    "comments": 567,
    "shares": 456,
    "accuracy": "documented",
    "historicalContext": "Bartolomé de las Casas, initially a colonial encomendero, became the most famous defender of indigenous rights. His 'Brief Account of the Destruction of the Indies' exposed Spanish atrocities.",
    "location": { "name": "Spain" }
  },
  {
    "id": "exploration-011",
    "authorId": "portuguese-captain",
    "content": "Lost three men to scurvy this week. Gums bleeding, teeth falling out, the men too weak to work the sails. We have no fresh food. Two months from any port. This is how sailors die.",
    "displayDate": "1520",
    "timestamp": "1520-03-10T18:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 567,
    "comments": 145,
    "shares": 89,
    "accuracy": "inferred",
    "historicalContext": "Scurvy killed more sailors than storms, battles, or shipwrecks. Caused by vitamin C deficiency, it wasn't understood until the 18th century. Long voyages were death sentences for many.",
    "location": { "name": "Atlantic Ocean" }
  },
  {
    "id": "exploration-012",
    "authorId": "zheng-he",
    "content": "The Emperor has ordered the voyages to end. The ships will be burned. The logs destroyed. Too expensive, they say. Too ambitious. China turns inward. I wonder what we might have found.",
    "displayDate": "1433",
    "timestamp": "1433-05-20T10:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 1567,
    "comments": 345,
    "shares": 234,
    "accuracy": "documented",
    "historicalContext": "After Zheng He's death, China abandoned its maritime expeditions. The decision to turn inward left the oceans to European powers. Some historians consider this a turning point in world history.",
    "location": { "name": "Nanjing, China" }
  },
  {
    "id": "exploration-013",
    "authorId": "inca-messenger",
    "content": "The bearded strangers have taken the Sapa Inca. Atahualpa himself, captured by a few hundred men. They have weapons that kill from far away. They have beasts that carry men. The world is ending.",
    "displayDate": "November 1532",
    "timestamp": "1532-11-16T17:00:00Z",
    "era": "age-of-exploration",
    "type": "event",
    "likes": 1234,
    "comments": 345,
    "shares": 234,
    "accuracy": "documented",
    "historicalContext": "Francisco Pizarro captured Atahualpa at Cajamarca with about 180 men, exploiting surprise and Spanish weapons. Despite paying an enormous ransom, Atahualpa was executed. The Inca Empire collapsed.",
    "location": { "name": "Cajamarca, Peru" }
  },
  {
    "id": "exploration-014",
    "authorId": "african-king",
    "content": "The Portuguese want slaves. They trade guns for people. We need the guns to protect ourselves—from other kingdoms with guns. This is the trap they've set. Buy guns or be enslaved. There is no good choice.",
    "displayDate": "1520",
    "timestamp": "1520-08-12T14:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 1890,
    "comments": 456,
    "shares": 345,
    "accuracy": "inferred",
    "historicalContext": "The Atlantic slave trade created a brutal cycle. African kingdoms traded captives for European goods, especially guns. Refusal to participate meant vulnerability to slave raids by better-armed neighbors.",
    "location": { "name": "West Africa" }
  },
  {
    "id": "exploration-015",
    "authorId": "ferdinand-magellan",
    "content": "Three years. Three years to sail around the world. I won't live to see it. But someone will. Someone will complete what I started. The world is round. We'll prove it with our bodies.",
    "displayDate": "1520",
    "timestamp": "1520-12-20T08:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 1234,
    "comments": 234,
    "shares": 178,
    "accuracy": "inferred",
    "historicalContext": "Magellan's expedition left with five ships and 270 men. One ship with 18 men returned. Though Magellan died in the Philippines, his voyage proved the Earth's circumference and the existence of a westward route to Asia.",
    "location": { "name": "Pacific Ocean" }
  },
  {
    "id": "exploration-016",
    "authorId": "vasco-da-gama",
    "content": "The locals here trade pepper and cinnamon like we trade salt. A fortune in spices for a handful of glass beads. The king thinks he's cheating us. He has no idea what these spices sell for in Lisbon.",
    "displayDate": "1498",
    "timestamp": "1498-05-28T11:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 890,
    "comments": 234,
    "shares": 145,
    "accuracy": "inferred",
    "historicalContext": "The spice trade generated enormous profits. Pepper, cinnamon, nutmeg, and cloves were worth more than gold by weight in Europe. Controlling the source meant controlling immense wealth.",
    "location": { "name": "Calicut, India" }
  },
  {
    "id": "exploration-017",
    "authorId": "spanish-missionary",
    "content": "The natives are not savages. They have cities, laws, astronomy. Their temples are wrong—they worship demons, not God. But they are people. They have souls. They can be saved. They must be saved.",
    "displayDate": "1530",
    "timestamp": "1530-04-15T09:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 678,
    "comments": 234,
    "shares": 123,
    "accuracy": "inferred",
    "historicalContext": "Spanish missionaries debated whether indigenous peoples had souls and could be converted. The church ultimately affirmed their humanity, though this didn't prevent brutal colonial exploitation.",
    "location": { "name": "Mexico" }
  },
  {
    "id": "exploration-018",
    "authorId": "taino-elder",
    "content": "The sickness spreads. Half our village is dead. The strangers brought it. They seem unharmed while we die. Perhaps they are evil spirits. Perhaps we have angered the gods. Perhaps we are simply dying.",
    "displayDate": "1494",
    "timestamp": "1494-06-20T15:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 1234,
    "comments": 345,
    "shares": 234,
    "accuracy": "inferred",
    "historicalContext": "European diseases—smallpox, measles, typhus—killed up to 90% of indigenous Americans. Having no immunity to Old World diseases, entire populations were wiped out within decades.",
    "location": { "name": "Caribbean" }
  },
  {
    "id": "exploration-019",
    "authorId": "hernan-cortes",
    "content": "Tenochtitlan has fallen. The Aztec Empire is no more. Montezuma is dead, his city burned, his gold in our ships. I've conquered a civilization with 500 men. History will remember this.",
    "displayDate": "August 13, 1521",
    "timestamp": "1521-08-13T18:00:00Z",
    "era": "age-of-exploration",
    "type": "event",
    "likes": 1567,
    "comments": 456,
    "shares": 345,
    "accuracy": "verified",
    "historicalContext": "The fall of Tenochtitlan ended the Aztec Empire. Spanish victory came through indigenous allies, disease, and siege warfare. Mexico City was built on Tenochtitlan's ruins.",
    "location": { "name": "Tenochtitlan, Mexico" }
  },
  {
    "id": "exploration-020",
    "authorId": "portuguese-captain",
    "content": "Rounding the Cape of Good Hope. The weather is terrible. Waves tall as cathedrals. Three ships lost this voyage already. But on the other side is India. On the other side is fortune.",
    "displayDate": "1502",
    "timestamp": "1502-03-25T06:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 567,
    "comments": 145,
    "shares": 89,
    "accuracy": "inferred",
    "historicalContext": "The Cape of Good Hope earned its name ironically—it was the 'Cape of Storms' to sailors. Rounding Africa's southern tip was treacherous, but it opened the sea route to India.",
    "location": { "name": "Cape of Good Hope" }
  },
  {
    "id": "exploration-021",
    "authorId": "zheng-he",
    "content": "The African coast is far from China but not beyond our reach. We've traded silk for ivory, porcelain for gold. The Emperor's name is known from Nanjing to Malindi. The ocean connects us all.",
    "displayDate": "1418",
    "timestamp": "1418-02-10T12:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 1890,
    "comments": 345,
    "shares": 278,
    "accuracy": "documented",
    "historicalContext": "Zheng He's fleet reached East Africa, trading Chinese goods and establishing diplomatic relations. His voyages mapped maritime routes and demonstrated Chinese naval supremacy decades before Columbus.",
    "location": { "name": "East African Coast" }
  },
  {
    "id": "exploration-022",
    "authorId": "amerigo-vespucci",
    "content": "This is not Asia. The coastline goes on too far, the people are too different, the lands too vast. This is a new world. A whole continent undreamed of. And they'll name it after me? That seems... unlikely.",
    "displayDate": "1502",
    "timestamp": "1502-09-05T10:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 1234,
    "comments": 345,
    "shares": 234,
    "accuracy": "documented",
    "historicalContext": "Vespucci recognized that the lands Columbus found were not Asia but a 'New World.' His name was applied to the continents by mapmaker Martin Waldseemüller in 1507.",
    "location": { "name": "South America" }
  },
  {
    "id": "exploration-023",
    "authorId": "aztec-warrior",
    "content": "We've captured the strangers' beast. It's not a spirit—it's an animal. Large, fast, terrifying, but mortal. It bleeds. It dies. If their beasts can die, so can they. We can fight this.",
    "displayDate": "1520",
    "timestamp": "1520-06-30T14:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 890,
    "comments": 234,
    "shares": 156,
    "accuracy": "inferred",
    "historicalContext": "Aztec warriors initially believed Spanish horses were supernatural creatures. Once they understood horses were animals, they developed tactics to neutralize Spanish cavalry. But disease and alliances had already doomed them.",
    "location": { "name": "Tenochtitlan, Mexico" }
  },
  {
    "id": "exploration-024",
    "authorId": "spanish-sailor",
    "content": "We've circled the world. Eighteen of us left from 270. The ship barely floats. We're skin and bones. But we've done what no one has ever done. We've proven the world is round. We've proven there's only one ocean.",
    "displayDate": "September 6, 1522",
    "timestamp": "1522-09-06T12:00:00Z",
    "era": "age-of-exploration",
    "type": "event",
    "likes": 3456,
    "comments": 678,
    "shares": 567,
    "accuracy": "verified",
    "historicalContext": "The Victoria returned to Spain on September 6, 1522, completing the first circumnavigation of the Earth. Only 18 of the original 270 crew survived. They had been gone almost three years.",
    "location": { "name": "Seville, Spain" }
  },
  {
    "id": "exploration-025",
    "authorId": "inca-messenger",
    "content": "They killed the Sapa Inca. After he gave them a room full of gold. They promised to release him. They lied. The empire crumbles. The roads are empty. The messengers run with no messages. We are lost.",
    "displayDate": "July 1533",
    "timestamp": "1533-07-26T18:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 1234,
    "comments": 345,
    "shares": 234,
    "accuracy": "verified",
    "historicalContext": "Atahualpa paid the largest ransom in history—a room filled with gold—and was still executed. Pizarro used charges of treason and heresy to justify the murder, which accelerated the empire's collapse.",
    "location": { "name": "Cajamarca, Peru" }
  },
  {
    "id": "exploration-026",
    "authorId": "bartolome-de-las-casas",
    "content": "I proposed using African slaves instead of natives. I thought I was saving souls. I was trading one evil for another. I was wrong. I was terribly wrong. God forgive me.",
    "displayDate": "1560",
    "timestamp": "1560-08-20T16:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 1567,
    "comments": 456,
    "shares": 345,
    "accuracy": "documented",
    "historicalContext": "Las Casas initially advocated importing African slaves to replace dying Native Americans. He later deeply regretted this, recognizing he had helped justify the Atlantic slave trade.",
    "location": { "name": "Spain" }
  },
  {
    "id": "exploration-027",
    "authorId": "african-king",
    "content": "My son was taken. The slavers came at night. My guards were paid off. My own son, in chains, on a ship to the lands of the strangers. I am a king who cannot protect his children.",
    "displayDate": "1540",
    "timestamp": "1540-05-15T05:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 1890,
    "comments": 456,
    "shares": 345,
    "accuracy": "inferred",
    "historicalContext": "The slave trade spared no one. Even African royalty could fall victim to raids or treachery. The trade destabilized societies and created a climate of fear across West and Central Africa.",
    "location": { "name": "West Africa" }
  },
  {
    "id": "exploration-028",
    "authorId": "montezuma",
    "content": "My people stone me in the streets. They say I've betrayed them by hosting the strangers. Perhaps they're right. I tried to understand them. I failed. Now everything burns.",
    "displayDate": "June 1520",
    "timestamp": "1520-06-29T20:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 890,
    "comments": 234,
    "shares": 145,
    "accuracy": "documented",
    "historicalContext": "Montezuma died during the Spanish siege, reportedly stoned by his own people while trying to calm them. Whether this or a Spanish sword killed him remains debated.",
    "location": { "name": "Tenochtitlan, Mexico" }
  },
  {
    "id": "exploration-029",
    "authorId": "christopher-columbus",
    "content": "First voyage: discovery. Second voyage: conquest. Third voyage: chains. They sent me back to Spain in chains. Me, the Admiral of the Ocean Sea. This is gratitude. This is Spain.",
    "displayDate": "1500",
    "timestamp": "1500-10-15T14:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 567,
    "comments": 189,
    "shares": 123,
    "accuracy": "verified",
    "historicalContext": "Columbus was arrested and sent to Spain in chains in 1500 after allegations of tyranny in Hispaniola. Though he was released, he never fully recovered his reputation or authority.",
    "location": { "name": "Atlantic Ocean" }
  },
  {
    "id": "exploration-030",
    "authorId": "spanish-missionary",
    "content": "We destroy their temples, burn their books, forbid their gods. But in their new Christian prayers, I hear the old names. They bow to the Virgin and see their own goddess. Perhaps God works in mysterious ways.",
    "displayDate": "1545",
    "timestamp": "1545-12-25T10:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 678,
    "comments": 178,
    "shares": 123,
    "accuracy": "inferred",
    "historicalContext": "Indigenous peoples often syncretized Catholic and traditional beliefs. The Virgin of Guadalupe, for example, incorporated aspects of the Aztec goddess Tonantzin. The Church alternately tolerated and suppressed these practices.",
    "location": { "name": "Mexico" }
  },
  {
    "id": "exploration-031",
    "authorId": "portuguese-captain",
    "content": "The spice islands at last. Nutmeg grows on trees like apples. Cloves scent the air for miles. These islands are worth more than kingdoms. And now they belong to Portugal.",
    "displayDate": "1512",
    "timestamp": "1512-04-08T09:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 1234,
    "comments": 234,
    "shares": 178,
    "accuracy": "documented",
    "historicalContext": "The Maluku (Spice Islands) were the only source of nutmeg and cloves. Controlling them meant monopolizing the most valuable spices in the world. Portugal, then the Dutch, fought bloody wars for this control.",
    "location": { "name": "Maluku Islands, Indonesia" }
  },
  {
    "id": "exploration-032",
    "authorId": "ferdinand-magellan",
    "content": "The natives here are friendly. They bring us food and water. They seem curious about us, especially our weapons. I've decided to help their king fight his enemies. Christian duty. Also diplomacy.",
    "displayDate": "April 1521",
    "timestamp": "1521-04-14T11:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 456,
    "comments": 145,
    "shares": 89,
    "accuracy": "documented",
    "historicalContext": "Magellan converted the ruler of Cebu and agreed to fight his rival Lapu-Lapu. This intervention led to Magellan's death at the Battle of Mactan—killed by the people he'd tried to subjugate.",
    "location": { "name": "Cebu, Philippines" }
  },
  {
    "id": "exploration-033",
    "authorId": "vasco-da-gama",
    "content": "They refused to trade. Said our goods were worthless. So I bombarded their port. Burned their fishing boats. Now they'll trade. This is how commerce works when you have cannons and they don't.",
    "displayDate": "1503",
    "timestamp": "1503-02-12T14:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 456,
    "comments": 234,
    "shares": 89,
    "accuracy": "documented",
    "historicalContext": "Portuguese trade was often backed by violence. Da Gama bombarded Calicut and other ports that resisted Portuguese demands. Naval superiority allowed small European forces to dominate much larger Asian powers.",
    "location": { "name": "Calicut, India" }
  },
  {
    "id": "exploration-034",
    "authorId": "aztec-warrior",
    "content": "La Noche Triste. The Sad Night. We drove the strangers from Tenochtitlan. They fled across the causeway, dying in the hundreds. We thought we'd won. We were wrong. They came back.",
    "displayDate": "June 30, 1520",
    "timestamp": "1520-06-30T23:00:00Z",
    "era": "age-of-exploration",
    "type": "event",
    "likes": 1234,
    "comments": 345,
    "shares": 234,
    "accuracy": "verified",
    "historicalContext": "La Noche Triste was the Aztecs' greatest victory over Cortés, who lost hundreds of men and most of his gold. But smallpox had already entered the city. Cortés returned a year later to finish the conquest.",
    "location": { "name": "Tenochtitlan, Mexico" }
  },
  {
    "id": "exploration-035",
    "authorId": "hernan-cortes",
    "content": "The gold. There's so much gold. Rooms full of it. Temples covered in it. They worked it like we work iron. And now it's all going to Spain. Every last ounce. The King will be pleased.",
    "displayDate": "1520",
    "timestamp": "1520-03-15T16:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 890,
    "comments": 234,
    "shares": 145,
    "accuracy": "inferred",
    "historicalContext": "Aztec gold and later Inca silver flooded into Spain, transforming the European economy. The influx caused massive inflation and funded Spanish wars for generations. Much was melted down, destroying priceless artworks.",
    "location": { "name": "Tenochtitlan, Mexico" }
  },
  {
    "id": "exploration-036",
    "authorId": "taino-elder",
    "content": "There are so few of us left. The old songs are forgotten. The young ones speak the strangers' tongue. We are ghosts in our own land. Soon even the ghosts will be gone.",
    "displayDate": "1510",
    "timestamp": "1510-08-20T18:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 1567,
    "comments": 345,
    "shares": 278,
    "accuracy": "inferred",
    "historicalContext": "The Taíno population collapsed from perhaps a million to near-extinction within decades of Columbus's arrival. Disease, enslavement, and massacres reduced them to a tiny remnant by 1550.",
    "location": { "name": "Caribbean" }
  },
  {
    "id": "exploration-037",
    "authorId": "spanish-sailor",
    "content": "Forty days without sight of land. The Pacific is not peaceful—it's endless. The men eat leather and drink their own urine. Some have died. More will die. But the captain says keep sailing west. So we sail west.",
    "displayDate": "1521",
    "timestamp": "1521-01-25T12:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 456,
    "comments": 123,
    "shares": 78,
    "accuracy": "documented",
    "historicalContext": "Magellan's Pacific crossing took 99 days without resupply. Men died of scurvy and starvation. They ate rats, sawdust, and leather from the ship's rigging. The ocean was far larger than anyone had imagined.",
    "location": { "name": "Pacific Ocean" }
  },
  {
    "id": "exploration-038",
    "authorId": "zheng-he",
    "content": "I was born Ma He, a Muslim boy taken in war. They made me a eunuch, gave me to the prince. He made me an admiral. Life takes strange turns. Now I command the largest fleet in history.",
    "displayDate": "1420",
    "timestamp": "1420-09-15T08:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 1234,
    "comments": 278,
    "shares": 189,
    "accuracy": "documented",
    "historicalContext": "Zheng He was captured at age 10, castrated, and raised as a servant to Prince Zhu Di. When Zhu Di became emperor, he rewarded his loyal servant with command of the treasure fleet.",
    "location": { "name": "Nanjing, China" }
  },
  {
    "id": "exploration-039",
    "authorId": "inca-messenger",
    "content": "The quipu carries news across the empire. Knots and colors telling stories. The strangers don't understand it. They think we have no writing. We have writing in rope. They just can't read it.",
    "displayDate": "1530",
    "timestamp": "1530-06-10T10:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 890,
    "comments": 234,
    "shares": 156,
    "accuracy": "documented",
    "historicalContext": "The Inca quipu was a complex recording system using knotted strings. It encoded census data, tribute records, and possibly narratives. Most quipus were destroyed by the Spanish; their full meaning remains partially undeciphered.",
    "location": { "name": "Inca Empire" }
  },
  {
    "id": "exploration-040",
    "authorId": "african-king",
    "content": "The strangers build forts on our coast. They say it's for trade. But their cannon point both ways—out to sea and in toward us. These are not trading posts. These are prisons waiting to be filled.",
    "displayDate": "1482",
    "timestamp": "1482-11-20T15:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 1234,
    "comments": 345,
    "shares": 234,
    "accuracy": "documented",
    "historicalContext": "Elmina Castle, built by the Portuguese in 1482, was the first European fort in sub-Saharan Africa. It became a major slave trading post. Similar fortresses eventually dotted the African coast.",
    "location": { "name": "Gold Coast, Africa" }
  },
  {
    "id": "exploration-041",
    "authorId": "amerigo-vespucci",
    "content": "Columbus thought he'd reached Asia. I know better. These lands are too vast, too different, too new. We've found a New World—a fourth continent. The ancients knew three. We've added a fourth.",
    "displayDate": "1503",
    "timestamp": "1503-04-18T11:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 890,
    "comments": 234,
    "shares": 156,
    "accuracy": "documented",
    "historicalContext": "Vespucci's letters describing a 'Mundus Novus' (New World) popularized the realization that the Americas were separate continents. This challenged ancient geography and transformed European worldview.",
    "location": { "name": "Florence, Italy" }
  },
  {
    "id": "exploration-042",
    "authorId": "spanish-missionary",
    "content": "Burned the codices today. Thousands of their books, centuries of their knowledge, all flames. The bishop says they're works of the devil. I wonder what secrets died with them. I wonder what we've lost.",
    "displayDate": "1562",
    "timestamp": "1562-07-12T14:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 1567,
    "comments": 456,
    "shares": 345,
    "accuracy": "verified",
    "historicalContext": "Bishop Diego de Landa ordered the burning of Mayan codices at Maní. Only four Mayan books survived. He later wrote a study of Mayan culture that became one of the few sources for their civilization.",
    "location": { "name": "Yucatan, Mexico" }
  },
  {
    "id": "exploration-043",
    "authorId": "portuguese-captain",
    "content": "Landed at Brazil. Claimed it for Portugal. The Treaty of Tordesillas gives us everything east of the line. Spain gets the west. Two nations dividing a world neither of them knew existed.",
    "displayDate": "April 1500",
    "timestamp": "1500-04-22T10:00:00Z",
    "era": "age-of-exploration",
    "type": "event",
    "likes": 890,
    "comments": 234,
    "shares": 145,
    "accuracy": "verified",
    "historicalContext": "Pedro Álvares Cabral claimed Brazil for Portugal in 1500. The Treaty of Tordesillas (1494) had already divided the non-Christian world between Portugal and Spain, with Brazil falling on Portugal's side.",
    "location": { "name": "Brazil" }
  },
  {
    "id": "exploration-044",
    "authorId": "bartolome-de-las-casas",
    "content": "The encomienda is slavery by another name. The colonists claim souls but demand labor. The natives die in mines and fields while their masters speak of Christian duty. This is not Christianity. This is greed with a cross.",
    "displayDate": "1550",
    "timestamp": "1550-08-15T16:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 1890,
    "comments": 456,
    "shares": 345,
    "accuracy": "documented",
    "historicalContext": "The encomienda system granted colonists the right to indigenous labor in exchange for Christianization. In practice, it was often brutal slavery. Las Casas fought for decades to reform or abolish it.",
    "location": { "name": "Spain" }
  },
  {
    "id": "exploration-045",
    "authorId": "aztec-warrior",
    "content": "The last emperor has surrendered. Cuauhtémoc, tortured for gold that doesn't exist. The city of our fathers is rubble. Our gods are silent. Our children will grow up as slaves. We are the last of the Mexica.",
    "displayDate": "August 1521",
    "timestamp": "1521-08-15T20:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 1234,
    "comments": 345,
    "shares": 234,
    "accuracy": "documented",
    "historicalContext": "Cuauhtémoc, the last Aztec emperor, was captured, tortured for gold, and eventually executed. His resistance became legendary. Modern Mexico honors him as a national hero.",
    "location": { "name": "Tenochtitlan, Mexico" }
  },
  {
    "id": "exploration-046",
    "authorId": "christopher-columbus",
    "content": "Four voyages. New worlds. New peoples. New routes. And what do I get? Lawsuits. Rivals. Poverty. They said I'd be Admiral of the Ocean Sea forever. Forever turns out to be shorter than I expected.",
    "displayDate": "1505",
    "timestamp": "1505-05-20T15:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 567,
    "comments": 189,
    "shares": 123,
    "accuracy": "inferred",
    "historicalContext": "Columbus died in 1506, largely forgotten and stripped of most honors. His family spent years in lawsuits with the Spanish crown. Only later did his reputation as a great explorer revive.",
    "location": { "name": "Valladolid, Spain" }
  },
  {
    "id": "exploration-047",
    "authorId": "hernan-cortes",
    "content": "They send accountants now. Lawyers. Bureaucrats. To count my gold and question my authority. I conquered an empire with 500 men. Now they audit my receipts. This is gratitude.",
    "displayDate": "1530",
    "timestamp": "1530-07-10T11:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 567,
    "comments": 178,
    "shares": 89,
    "accuracy": "inferred",
    "historicalContext": "After the conquest, Cortés faced legal challenges to his authority and wealth. The Spanish crown preferred bureaucrats to conquistadors, who were too independent and ambitious.",
    "location": { "name": "Mexico City" }
  },
  {
    "id": "exploration-048",
    "authorId": "inca-messenger",
    "content": "The roads still run. From Quito to Cusco, the paths the Sapa Inca built remain. But the empire is gone. The runners carry messages for strangers now. The roads remember what we've lost.",
    "displayDate": "1540",
    "timestamp": "1540-12-10T08:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 789,
    "comments": 189,
    "shares": 145,
    "accuracy": "inferred",
    "historicalContext": "The Inca road system was one of the most extensive in the ancient world, spanning 25,000 miles. The Spanish used it to consolidate their conquest. Parts remain visible today.",
    "location": { "name": "Former Inca Empire" }
  },
  {
    "id": "exploration-049",
    "authorId": "vasco-da-gama",
    "content": "Dying now. The fever took me in India, where I made my name. I opened the sea routes. I made Portugal rich. They'll remember the route. They'll forget the man. That's how history works.",
    "displayDate": "December 24, 1524",
    "timestamp": "1524-12-24T22:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 890,
    "comments": 234,
    "shares": 156,
    "accuracy": "documented",
    "historicalContext": "Da Gama died in Cochin, India, on his third voyage. He had been appointed Viceroy just before his death. His voyages established Portuguese dominance in the Indian Ocean for a century.",
    "location": { "name": "Cochin, India" }
  },
  {
    "id": "exploration-050",
    "authorId": "spanish-sailor",
    "content": "Home. Three years. Around the world. Eighteen of us left. The survivors drink and weep. We crossed the endless ocean. We proved the world is round. We lost everything. We proved everything.",
    "displayDate": "September 8, 1522",
    "timestamp": "1522-09-08T12:00:00Z",
    "era": "age-of-exploration",
    "type": "status",
    "likes": 2345,
    "comments": 456,
    "shares": 345,
    "accuracy": "documented",
    "historicalContext": "Juan Sebastián Elcano and 17 other survivors completed the first circumnavigation. Their voyage proved the Earth's spherical shape and opened new possibilities for global trade and empire.",
    "location": { "name": "Seville, Spain" }
  }
]
