[
  {
    "id": "civilwar-001",
    "authorId": "abraham-lincoln",
    "content": "War. It's started. Fort Sumter has fallen. I've called for 75,000 volunteers. I hope that's enough. I hope this is over quickly. I hope a lot of things that probably won't come true.",
    "displayDate": "April 15, 1861",
    "timestamp": "1861-04-15T10:00:00Z",
    "era": "american-civil-war",
    "type": "event",
    "likes": 1234,
    "comments": 345,
    "shares": 234,
    "accuracy": "verified",
    "historicalContext": "After Confederate forces bombarded Fort Sumter, Lincoln called for 75,000 volunteers to suppress the rebellion. The call prompted four more states to secede. The war would last four years and cost 620,000 lives.",
    "location": { "name": "Washington, D.C." }
  },
  {
    "id": "civilwar-002",
    "authorId": "robert-e-lee",
    "content": "They offered me command of the Union army. I said no. Virginia is my home. I cannot raise my sword against her. God forgive me if I'm wrong. I'm not sure I can forgive myself either way.",
    "displayDate": "April 20, 1861",
    "timestamp": "1861-04-20T18:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 678,
    "comments": 234,
    "shares": 145,
    "accuracy": "documented",
    "historicalContext": "Robert E. Lee declined Lincoln's offer to command the Union armies when Virginia seceded. His choice to follow his state rather than his nation defined the war's character and his own tragic legacy.",
    "location": { "name": "Arlington, Virginia" }
  },
  {
    "id": "civilwar-003",
    "authorId": "frederick-douglass",
    "content": "They're fighting over whether men can own other men. Don't let anyone tell you different. All the talk of states' rights and constitutional principles—it comes down to chains. It always comes down to chains.",
    "displayDate": "May 1861",
    "timestamp": "1861-05-10T14:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 1567,
    "comments": 456,
    "shares": 345,
    "accuracy": "inferred",
    "historicalContext": "Frederick Douglass, the most prominent Black abolitionist, consistently argued that slavery was the war's true cause. He pushed for Black enlistment and equal treatment of Black soldiers.",
    "location": { "name": "Rochester, New York" }
  },
  {
    "id": "civilwar-004",
    "authorId": "union-soldier",
    "content": "Marched twenty miles today. Blisters on my blisters. The sergeant says we'll see the elephant soon. That means battle. I hope the elephant isn't as big as everyone says.",
    "displayDate": "July 1861",
    "timestamp": "1861-07-15T20:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 234,
    "comments": 56,
    "shares": 23,
    "accuracy": "inferred",
    "historicalContext": "'Seeing the elephant' was Civil War slang for experiencing combat for the first time. Many soldiers who eagerly enlisted were unprepared for the reality of industrial-age warfare.",
    "location": { "name": "Virginia" }
  },
  {
    "id": "civilwar-005",
    "authorId": "confederate-soldier",
    "content": "Letter from home. Ma says the crops are coming in and little Joseph is walking now. I won't see it. Might not see it ever. But I keep the letter in my pocket. Read it every night before sleep.",
    "displayDate": "August 1862",
    "timestamp": "1862-08-20T21:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 345,
    "comments": 89,
    "shares": 45,
    "accuracy": "inferred",
    "historicalContext": "Soldiers on both sides wrote and received letters constantly. These letters are now invaluable historical sources, showing the personal toll of a war that touched every American family.",
    "location": { "name": "Northern Virginia" }
  },
  {
    "id": "civilwar-006",
    "authorId": "ulysses-grant",
    "content": "Took Vicksburg. The Mississippi is ours. The Confederacy is cut in two. They can't reinforce, can't supply, can't hold. It's just a matter of time now. Bloody, terrible time.",
    "displayDate": "July 4, 1863",
    "timestamp": "1863-07-04T12:00:00Z",
    "era": "american-civil-war",
    "type": "event",
    "likes": 1123,
    "comments": 234,
    "shares": 189,
    "accuracy": "verified",
    "historicalContext": "Vicksburg's fall on July 4, 1863—the same day Lee retreated from Gettysburg—was the war's strategic turning point. The Union controlled the Mississippi River, splitting the Confederacy.",
    "location": { "name": "Vicksburg, Mississippi" }
  },
  {
    "id": "civilwar-007",
    "authorId": "harriet-tubman",
    "content": "Leading the raid on Combahee River. Freed 750 people today. 750 souls walking to freedom. My heart is so full it hurts. This is what I was born for. This is the Lord's work.",
    "displayDate": "June 2, 1863",
    "timestamp": "1863-06-02T05:00:00Z",
    "era": "american-civil-war",
    "type": "event",
    "likes": 2345,
    "comments": 567,
    "shares": 456,
    "accuracy": "verified",
    "historicalContext": "Harriet Tubman led the Combahee River Raid, the first armed assault in American history planned and led by a woman. It freed more than 700 enslaved people in South Carolina.",
    "location": { "name": "Combahee River, South Carolina" }
  },
  {
    "id": "civilwar-008",
    "authorId": "clara-barton",
    "content": "The surgeons work by candlelight. The screaming never stops. I hold hands. I write letters for dying men. I give water to boys who won't see morning. This is nursing in war. This is hell on earth.",
    "displayDate": "September 1862",
    "timestamp": "1862-09-18T03:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 678,
    "comments": 145,
    "shares": 89,
    "accuracy": "inferred",
    "historicalContext": "Clara Barton, the 'Angel of the Battlefield,' brought medical supplies to the front lines, often under fire. She would later found the American Red Cross.",
    "location": { "name": "Antietam, Maryland" }
  },
  {
    "id": "civilwar-009",
    "authorId": "abraham-lincoln",
    "content": "Emancipation goes into effect today. All persons held as slaves in rebel states are free. It's done. What we began, we cannot turn back from. The war is now about liberation. As it should have been from the start.",
    "displayDate": "January 1, 1863",
    "timestamp": "1863-01-01T12:00:00Z",
    "era": "american-civil-war",
    "type": "event",
    "likes": 3456,
    "comments": 678,
    "shares": 567,
    "accuracy": "verified",
    "historicalContext": "The Emancipation Proclamation freed enslaved people in Confederate states, transforming the war into a fight for freedom. It also opened military service to Black men.",
    "location": { "name": "Washington, D.C." }
  },
  {
    "id": "civilwar-010",
    "authorId": "robert-e-lee",
    "content": "Gettysburg. We threw everything at them. Pickett's men marched into the cannon fire like it was nothing. Half of them never came back. I ordered it. Their blood is on my hands.",
    "displayDate": "July 3, 1863",
    "timestamp": "1863-07-03T18:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 789,
    "comments": 234,
    "shares": 156,
    "accuracy": "documented",
    "historicalContext": "Pickett's Charge was a disastrous frontal assault on the third day of Gettysburg. Lee took full responsibility, telling survivors 'It is all my fault.' The defeat ended Confederate hopes of invading the North.",
    "location": { "name": "Gettysburg, Pennsylvania" }
  },
  {
    "id": "civilwar-011",
    "authorId": "enslaved-man",
    "content": "Ran last night. Master's sons at war, overseer drunk. The North Star guided me. My legs shake but I keep walking. Freedom is north. Freedom is walking. Freedom is not looking back.",
    "displayDate": "March 1863",
    "timestamp": "1863-03-15T04:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 1234,
    "comments": 234,
    "shares": 189,
    "accuracy": "inferred",
    "historicalContext": "The war disrupted plantation slavery. With white men at war, enslaved people escaped in increasing numbers. Many headed for Union lines, where they became 'contraband' and eventually free.",
    "location": { "name": "The South" }
  },
  {
    "id": "civilwar-012",
    "authorId": "union-nurse",
    "content": "A boy died in my arms today. He was seventeen. He called me 'mother.' I am twenty-four and have held more dying men than I can count. This war ages everyone.",
    "displayDate": "May 1864",
    "timestamp": "1864-05-10T22:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 456,
    "comments": 123,
    "shares": 67,
    "accuracy": "inferred",
    "historicalContext": "Thousands of women served as nurses during the Civil War, often with minimal training. They faced not only the horror of wounds and death but also resistance from male doctors and officials.",
    "location": { "name": "Virginia" }
  },
  {
    "id": "civilwar-013",
    "authorId": "usct-soldier",
    "content": "They finally let us fight. 54th Massachusetts. They said we couldn't soldier. At Fort Wagner, we proved them wrong. Lost half our regiment, including Colonel Shaw. But we proved them wrong.",
    "displayDate": "July 18, 1863",
    "timestamp": "1863-07-18T20:00:00Z",
    "era": "american-civil-war",
    "type": "event",
    "likes": 1567,
    "comments": 345,
    "shares": 278,
    "accuracy": "verified",
    "historicalContext": "The 54th Massachusetts was one of the first Black regiments in the Union Army. Their assault on Fort Wagner, though unsuccessful, proved Black soldiers' courage and helped change public opinion.",
    "location": { "name": "Fort Wagner, South Carolina" }
  },
  {
    "id": "civilwar-014",
    "authorId": "confederate-soldier",
    "content": "No shoes. No food. No ammunition. But we keep fighting. For what? I don't know anymore. The cause feels far away. What's close is the man next to me. I fight for him. He fights for me.",
    "displayDate": "February 1865",
    "timestamp": "1865-02-20T19:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 345,
    "comments": 89,
    "shares": 45,
    "accuracy": "inferred",
    "historicalContext": "By late war, Confederate forces faced severe shortages. Men fought barefoot, on reduced rations, with worn equipment. Unit cohesion and loyalty to comrades kept many fighting.",
    "location": { "name": "Petersburg, Virginia" }
  },
  {
    "id": "civilwar-015",
    "authorId": "mary-todd-lincoln",
    "content": "Willie is dead. Our beautiful boy. Typhoid took him. Abraham barely speaks. I can barely stand. How does one bury a child and keep living? How does one govern a war and grieve?",
    "displayDate": "February 1862",
    "timestamp": "1862-02-22T15:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 567,
    "comments": 145,
    "shares": 89,
    "accuracy": "documented",
    "historicalContext": "William 'Willie' Lincoln died of typhoid fever at age 11 in the White House. Both parents were devastated. Mary Todd Lincoln never fully recovered, and Lincoln's grief deepened his famous melancholy.",
    "location": { "name": "Washington, D.C." }
  },
  {
    "id": "civilwar-016",
    "authorId": "ulysses-grant",
    "content": "They call me a butcher. They say I throw away men's lives. They don't understand. Lee is a defensive genius. The only way to beat him is to keep pressing, keep bleeding him, until he has nothing left. I hate it. But I do it.",
    "displayDate": "June 1864",
    "timestamp": "1864-06-05T10:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 456,
    "comments": 189,
    "shares": 78,
    "accuracy": "inferred",
    "historicalContext": "Grant's Overland Campaign was brutally costly—60,000 Union casualties in six weeks. But Grant understood that the Union could replace losses while the Confederacy could not.",
    "location": { "name": "Cold Harbor, Virginia" }
  },
  {
    "id": "civilwar-017",
    "authorId": "frederick-douglass",
    "content": "Met Lincoln today. He received me as a gentleman receives another. Not as white men usually receive Black men. There is something in him. Something that might actually believe what he says.",
    "displayDate": "August 1863",
    "timestamp": "1863-08-10T14:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 1234,
    "comments": 234,
    "shares": 178,
    "accuracy": "documented",
    "historicalContext": "Douglass met with Lincoln multiple times. Their first meeting impressed Douglass, who found Lincoln 'the first great man that I talked with in the United States freely' who treated him as an equal.",
    "location": { "name": "White House, Washington, D.C." }
  },
  {
    "id": "civilwar-018",
    "authorId": "william-sherman",
    "content": "Atlanta is ours. Burned what we couldn't use. Some call it barbarous. I call it ending the war faster. The sooner they feel the hard hand of war, the sooner they stop fighting. War is hell. I didn't invent it.",
    "displayDate": "November 1864",
    "timestamp": "1864-11-15T08:00:00Z",
    "era": "american-civil-war",
    "type": "event",
    "likes": 678,
    "comments": 345,
    "shares": 156,
    "accuracy": "documented",
    "historicalContext": "Sherman's March to the Sea destroyed military infrastructure and civilian resources, aiming to break Southern will to fight. It was controversial then and remains so, but it helped end the war.",
    "location": { "name": "Atlanta, Georgia" }
  },
  {
    "id": "civilwar-019",
    "authorId": "southern-woman",
    "content": "Yankees came through last week. Took the silver, the ham, the horses. They laughed. I stood there with my children and watched everything burn. I hate them. I will hate them until I die.",
    "displayDate": "December 1864",
    "timestamp": "1864-12-10T16:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 234,
    "comments": 89,
    "shares": 34,
    "accuracy": "inferred",
    "historicalContext": "Sherman's march devastated the Georgia countryside. Foraging parties took what they wanted, and some troops committed acts of theft and destruction beyond military necessity. The bitterness lasted generations.",
    "location": { "name": "Georgia" }
  },
  {
    "id": "civilwar-020",
    "authorId": "abraham-lincoln",
    "content": "Four score and seven years ago... I've been working on this speech for days. It's short. Maybe too short. Everyone will speak at Gettysburg. I hope someone remembers what I say.",
    "displayDate": "November 19, 1863",
    "timestamp": "1863-11-19T11:00:00Z",
    "era": "american-civil-war",
    "type": "event",
    "likes": 4567,
    "comments": 890,
    "shares": 678,
    "accuracy": "documented",
    "historicalContext": "The Gettysburg Address was only 272 words, following a two-hour oration by Edward Everett. Lincoln thought it a failure. It became the most famous American speech ever delivered.",
    "location": { "name": "Gettysburg, Pennsylvania" }
  },
  {
    "id": "civilwar-021",
    "authorId": "robert-e-lee",
    "content": "It is over. I've surrendered the army. The men wept. I wept. But there's no more fight left. No more supplies, no more hope. It's better to stop the bleeding. The cause is lost. The killing stops.",
    "displayDate": "April 9, 1865",
    "timestamp": "1865-04-09T16:00:00Z",
    "era": "american-civil-war",
    "type": "event",
    "likes": 1234,
    "comments": 345,
    "shares": 234,
    "accuracy": "verified",
    "historicalContext": "Lee surrendered to Grant at Appomattox Court House, effectively ending the Civil War. Grant offered generous terms, and Confederate soldiers were allowed to keep their horses and return home.",
    "location": { "name": "Appomattox Court House, Virginia" }
  },
  {
    "id": "civilwar-022",
    "authorId": "ulysses-grant",
    "content": "Lee asked for terms. I gave him generous ones. These men aren't criminals. They were enemies, now they're countrymen again. Vengeance would poison the peace. We need peace.",
    "displayDate": "April 9, 1865",
    "timestamp": "1865-04-09T17:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 890,
    "comments": 234,
    "shares": 156,
    "accuracy": "documented",
    "historicalContext": "Grant's terms at Appomattox were notably lenient—no prisoners, no prosecutions, officers kept sidearms, soldiers kept horses. Lincoln had instructed 'Let 'em up easy.'",
    "location": { "name": "Appomattox Court House, Virginia" }
  },
  {
    "id": "civilwar-023",
    "authorId": "harriet-tubman",
    "content": "Free. All of them free. Not contraband, not refugees—free. Citizens. It's not enough, not yet, not by far. But the chains are broken. The rest we fight for tomorrow.",
    "displayDate": "April 1865",
    "timestamp": "1865-04-15T10:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 2345,
    "comments": 456,
    "shares": 345,
    "accuracy": "inferred",
    "historicalContext": "The war's end and the 13th Amendment freed four million enslaved people. But true freedom—economic, political, social—remained to be fought for through Reconstruction and beyond.",
    "location": { "name": "Auburn, New York" }
  },
  {
    "id": "civilwar-024",
    "authorId": "confederate-soldier",
    "content": "Walking home. No army, no flag, no cause. Just walking. Don't know what I'll find when I get there. Don't know if the farm's still standing. Don't know if anyone's waiting. Just walking.",
    "displayDate": "April 1865",
    "timestamp": "1865-04-20T08:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 345,
    "comments": 89,
    "shares": 45,
    "accuracy": "inferred",
    "historicalContext": "After Appomattox, Confederate soldiers simply walked home. Many returned to devastation—burned farms, dead family members, a collapsed economy. The journey home was just the beginning.",
    "location": { "name": "Virginia" }
  },
  {
    "id": "civilwar-025",
    "authorId": "abraham-lincoln",
    "content": "The war is over. We won. But winning was the easy part. Now we must bind the nation's wounds. Care for him who shall have borne the battle. This is harder than fighting. This is the real work.",
    "displayDate": "April 14, 1865",
    "timestamp": "1865-04-14T10:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 1890,
    "comments": 456,
    "shares": 345,
    "accuracy": "documented",
    "historicalContext": "Lincoln spoke of reconciliation in his second inaugural address. That evening, he went to Ford's Theatre. He never saw the reconstruction he envisioned.",
    "location": { "name": "Washington, D.C." }
  },
  {
    "id": "civilwar-026",
    "authorId": "mary-todd-lincoln",
    "content": "My husband is dead. Shot in a theatre. He died this morning. I cannot... I cannot... The President is dead. Abraham is dead. Everything is dead.",
    "displayDate": "April 15, 1865",
    "timestamp": "1865-04-15T08:00:00Z",
    "era": "american-civil-war",
    "type": "event",
    "likes": 1567,
    "comments": 456,
    "shares": 345,
    "accuracy": "documented",
    "historicalContext": "John Wilkes Booth shot Lincoln at Ford's Theatre on April 14, 1865. Lincoln died the next morning. The assassination shocked a nation still celebrating the war's end.",
    "location": { "name": "Washington, D.C." }
  },
  {
    "id": "civilwar-027",
    "authorId": "union-soldier",
    "content": "Three years of marching, fighting, dying. We won. I'm alive. Going home. Can't believe it. Keep touching my face to make sure I'm real. I'm real. I'm going home.",
    "displayDate": "May 1865",
    "timestamp": "1865-05-10T15:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 456,
    "comments": 89,
    "shares": 56,
    "accuracy": "inferred",
    "historicalContext": "Union soldiers who survived the war faced the challenge of returning to civilian life. Many suffered from what we now recognize as PTSD. The homecoming was often difficult.",
    "location": { "name": "Washington, D.C." }
  },
  {
    "id": "civilwar-028",
    "authorId": "clara-barton",
    "content": "They're asking me to help find the missing. Thousands of families don't know if their sons are dead or alive. I have lists. I have records. Maybe I can give them answers. Maybe closure is all I can offer.",
    "displayDate": "June 1865",
    "timestamp": "1865-06-15T10:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 567,
    "comments": 123,
    "shares": 89,
    "accuracy": "documented",
    "historicalContext": "After the war, Clara Barton led an effort to identify missing soldiers and notify families. Her Office of Missing Soldiers eventually identified over 22,000 men.",
    "location": { "name": "Washington, D.C." }
  },
  {
    "id": "civilwar-029",
    "authorId": "usct-soldier",
    "content": "We fought. We bled. We died. Same as white soldiers. Now they say thank you and send us home. Same as white soldiers? Not quite. Not yet. But we showed them what we are. That counts for something.",
    "displayDate": "July 1865",
    "timestamp": "1865-07-04T14:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 890,
    "comments": 234,
    "shares": 156,
    "accuracy": "inferred",
    "historicalContext": "Nearly 180,000 Black men served in the Union Army. They were paid less, given worse equipment, and faced execution if captured. Their service advanced the cause of civil rights even as discrimination continued.",
    "location": { "name": "Philadelphia, Pennsylvania" }
  },
  {
    "id": "civilwar-030",
    "authorId": "frederick-douglass",
    "content": "The war is won. Slavery is dead. But the struggle for true freedom has just begun. The ballot box, the schoolhouse, the courthouse—these are the next battlefields. We've barely started.",
    "displayDate": "August 1865",
    "timestamp": "1865-08-01T11:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 1234,
    "comments": 345,
    "shares": 234,
    "accuracy": "inferred",
    "historicalContext": "Douglass immediately turned to Reconstruction, pushing for Black voting rights and equal citizenship. His prediction proved correct—the struggle would continue for another century and beyond.",
    "location": { "name": "Rochester, New York" }
  },
  {
    "id": "civilwar-031",
    "authorId": "enslaved-man",
    "content": "My name is now my own. I chose it myself. No more master's name. I have land—forty acres the Yankees promised. I have a mule. I am building a house. I am building a life. I am free.",
    "displayDate": "June 1865",
    "timestamp": "1865-06-20T08:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 1567,
    "comments": 345,
    "shares": 278,
    "accuracy": "inferred",
    "historicalContext": "Sherman's Field Order No. 15 promised 'forty acres and a mule' to freed people. Though largely reversed by President Johnson, it represented the hopes of millions for economic independence.",
    "location": { "name": "South Carolina" }
  },
  {
    "id": "civilwar-032",
    "authorId": "southern-woman",
    "content": "The slaves are gone. All of them. Walked off when the Yankees came. The fields are empty. The house is empty. We have nothing. What happens now? What happens to us?",
    "displayDate": "May 1865",
    "timestamp": "1865-05-05T16:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 234,
    "comments": 123,
    "shares": 45,
    "accuracy": "inferred",
    "historicalContext": "Emancipation devastated the Southern economy. Plantation owners lost their workforce and much of their wealth. Many struggled to adapt to a world where they had to work or pay wages.",
    "location": { "name": "Georgia" }
  },
  {
    "id": "civilwar-033",
    "authorId": "union-nurse",
    "content": "Closing the hospital. The last patients are going home. Four years of blood and death and somehow I'm still standing. I don't know what to do with peace. War was terrible but at least I had purpose.",
    "displayDate": "July 1865",
    "timestamp": "1865-07-20T18:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 345,
    "comments": 89,
    "shares": 56,
    "accuracy": "inferred",
    "historicalContext": "Many nurses struggled with the transition to peacetime. They had gained skills and independence that peacetime society didn't recognize. Some, like Clara Barton, continued humanitarian work.",
    "location": { "name": "Washington, D.C." }
  },
  {
    "id": "civilwar-034",
    "authorId": "robert-e-lee",
    "content": "They want me to write my memoirs. To justify, to explain, to relitigate. I'm done with all that. The war is over. Let it stay buried. I just want to teach young men and watch things grow.",
    "displayDate": "September 1865",
    "timestamp": "1865-09-10T10:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 345,
    "comments": 145,
    "shares": 67,
    "accuracy": "documented",
    "historicalContext": "Lee became president of Washington College after the war. He discouraged former Confederates from continuing resistance and urged reconciliation, though he never sought a pardon.",
    "location": { "name": "Lexington, Virginia" }
  },
  {
    "id": "civilwar-035",
    "authorId": "william-sherman",
    "content": "People ask if I enjoyed the march. Enjoyed watching everything burn? No. But I'd do it again. Every burned barn shortened the war. Every scared civilian was one more pressure on the Confederacy to quit. It worked.",
    "displayDate": "August 1865",
    "timestamp": "1865-08-15T14:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 456,
    "comments": 234,
    "shares": 89,
    "accuracy": "inferred",
    "historicalContext": "Sherman remained unapologetic about his tactics. He argued that making war terrible was the fastest way to peace. His approach influenced military thinking for generations.",
    "location": { "name": "St. Louis, Missouri" }
  },
  {
    "id": "civilwar-036",
    "authorId": "harriet-tubman",
    "content": "They called me Moses. Said I led my people to freedom. But I was just one woman with a pistol and a prayer. The people freed themselves. I just showed them the way north.",
    "displayDate": "December 1865",
    "timestamp": "1865-12-06T16:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 2345,
    "comments": 456,
    "shares": 345,
    "accuracy": "inferred",
    "historicalContext": "Tubman made 13 trips to the South and freed around 70 people through the Underground Railroad. During the war, she served as scout, spy, and raid leader. She never lost a passenger.",
    "location": { "name": "Auburn, New York" }
  },
  {
    "id": "civilwar-037",
    "authorId": "union-soldier",
    "content": "The nightmares won't stop. Close my eyes and I'm back at Antietam. The cornfield. The bodies. The screaming. My wife says I scream in my sleep. The doctors say it will pass. The doctors are lying.",
    "displayDate": "October 1865",
    "timestamp": "1865-10-20T22:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 345,
    "comments": 123,
    "shares": 67,
    "accuracy": "inferred",
    "historicalContext": "What we now call PTSD was called 'soldier's heart' or 'nostalgia' during the Civil War. Many veterans suffered for years, with little understanding or support from society.",
    "location": { "name": "Ohio" }
  },
  {
    "id": "civilwar-038",
    "authorId": "confederate-soldier",
    "content": "Found the farm. Still standing. Ma died while I was gone. Pa's gone simple in the head. The fields are weeds. But the house stands. I'm home. I have to believe that's enough.",
    "displayDate": "June 1865",
    "timestamp": "1865-06-01T17:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 289,
    "comments": 78,
    "shares": 34,
    "accuracy": "inferred",
    "historicalContext": "Many Confederate soldiers returned to find devastation. The war destroyed much of the South's infrastructure, killed a generation of men, and left families struggling to survive.",
    "location": { "name": "Georgia" }
  },
  {
    "id": "civilwar-039",
    "authorId": "ulysses-grant",
    "content": "They talk about my drinking. Yes, I've struggled. But I won the war sober, clear-headed, doing what needed to be done. Let them talk. The men who served with me know the truth.",
    "displayDate": "November 1865",
    "timestamp": "1865-11-10T20:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 567,
    "comments": 145,
    "shares": 89,
    "accuracy": "inferred",
    "historicalContext": "Grant's reputation for drinking followed him throughout his career. While he had struggled with alcohol earlier, he was notably sober during the most critical campaigns of the war.",
    "location": { "name": "Washington, D.C." }
  },
  {
    "id": "civilwar-040",
    "authorId": "freed-woman",
    "content": "Learning to read. At forty-three years old. The letters are hard but I will master them. My children will read. Their children will read. The knowledge they forbade us—we will take it back.",
    "displayDate": "September 1865",
    "timestamp": "1865-09-15T10:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 1890,
    "comments": 345,
    "shares": 278,
    "accuracy": "inferred",
    "historicalContext": "Teaching enslaved people to read was illegal in most of the South. After emancipation, freedpeople flooded into schools. Literacy rates among Black Americans rose dramatically in the following decades.",
    "location": { "name": "South Carolina" }
  },
  {
    "id": "civilwar-041",
    "authorId": "mary-todd-lincoln",
    "content": "The ghost of my husband haunts this house. Every room. Every corner. They say I should move on. Move on from Abraham? Move on from everything? I don't know how to live in a world without him.",
    "displayDate": "May 1865",
    "timestamp": "1865-05-20T21:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 456,
    "comments": 145,
    "shares": 78,
    "accuracy": "inferred",
    "historicalContext": "Mary Todd Lincoln never recovered from her husband's assassination. She struggled with depression and grief, was briefly committed to an asylum, and died largely forgotten in 1882.",
    "location": { "name": "Chicago, Illinois" }
  },
  {
    "id": "civilwar-042",
    "authorId": "surgeon",
    "content": "Sixty thousand amputations in four years. I've done hundreds myself. Saved lives, they say. Maybe. But I dream about the legs and arms I cut off. Mountains of them. I became a doctor to heal, not to maim.",
    "displayDate": "August 1865",
    "timestamp": "1865-08-05T23:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 345,
    "comments": 89,
    "shares": 45,
    "accuracy": "inferred",
    "historicalContext": "Military surgeons performed an estimated 60,000 amputations during the war. The Minié ball shattered bone, making amputation often the only option. Thousands of veterans lived as amputees.",
    "location": { "name": "Philadelphia, Pennsylvania" }
  },
  {
    "id": "civilwar-043",
    "authorId": "frederick-douglass",
    "content": "President Johnson vetoes Black civil rights. After all we sacrificed. After all who died. The slaveholders lost the war but they're winning the peace. We must fight again. We always must fight again.",
    "displayDate": "February 1866",
    "timestamp": "1866-02-20T14:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 1234,
    "comments": 345,
    "shares": 234,
    "accuracy": "documented",
    "historicalContext": "Andrew Johnson opposed civil rights for freedpeople and vetoed key Reconstruction legislation. His presidency marked the beginning of the failure of Reconstruction.",
    "location": { "name": "Washington, D.C." }
  },
  {
    "id": "civilwar-044",
    "authorId": "clara-barton",
    "content": "Twenty-two thousand names. Twenty-two thousand families who finally know. Dead, yes, but named and buried. Sometimes that's all you can give. Sometimes knowing is the last gift.",
    "displayDate": "December 1865",
    "timestamp": "1865-12-15T15:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 678,
    "comments": 145,
    "shares": 89,
    "accuracy": "documented",
    "historicalContext": "Barton's Office of Missing Soldiers helped identify over 22,000 missing men. She corresponded with families across the country, providing closure where possible.",
    "location": { "name": "Washington, D.C." }
  },
  {
    "id": "civilwar-045",
    "authorId": "freed-man",
    "content": "Registered to vote today. First time in my life. First time in my family's history. They tried to scare me on the way. Didn't work. I walked in, I gave my name, I voted. I am a citizen. Finally.",
    "displayDate": "1867",
    "timestamp": "1867-11-05T11:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 1567,
    "comments": 345,
    "shares": 278,
    "accuracy": "inferred",
    "historicalContext": "The 15th Amendment (1870) prohibited denying the vote based on race. Black men voted in large numbers during Reconstruction. By the 1890s, Jim Crow laws had largely stripped that right away again.",
    "location": { "name": "South Carolina" }
  },
  {
    "id": "civilwar-046",
    "authorId": "southern-woman",
    "content": "We lost everything. The war, the slaves, the money, the way of life. But we didn't lose our pride. We'll rebuild. Different, maybe. But we'll rebuild. The South always rebuilds.",
    "displayDate": "January 1866",
    "timestamp": "1866-01-10T09:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 234,
    "comments": 145,
    "shares": 56,
    "accuracy": "inferred",
    "historicalContext": "The 'Lost Cause' mythology began forming even as the war ended. White Southerners rewrote the war as a noble struggle for states' rights, obscuring slavery's central role.",
    "location": { "name": "Virginia" }
  },
  {
    "id": "civilwar-047",
    "authorId": "abraham-lincoln",
    "content": "With malice toward none, with charity for all... to bind up the nation's wounds. I wrote those words. I believed them. I hope whoever comes after me believes them too. We must be better than vengeance.",
    "displayDate": "March 4, 1865",
    "timestamp": "1865-03-04T12:00:00Z",
    "era": "american-civil-war",
    "type": "event",
    "likes": 3456,
    "comments": 567,
    "shares": 456,
    "accuracy": "verified",
    "historicalContext": "Lincoln's second inaugural address called for reconciliation while acknowledging that slavery was the war's cause. It remains one of the greatest speeches in American history.",
    "location": { "name": "Washington, D.C." }
  },
  {
    "id": "civilwar-048",
    "authorId": "usct-soldier",
    "content": "Richmond has fallen. We marched into the Confederate capital. Us. Black soldiers. The slaves are cheering us, touching our uniforms, crying. This is the day. This is the day we were born for.",
    "displayDate": "April 3, 1865",
    "timestamp": "1865-04-03T10:00:00Z",
    "era": "american-civil-war",
    "type": "event",
    "likes": 2345,
    "comments": 456,
    "shares": 345,
    "accuracy": "verified",
    "historicalContext": "Black Union troops were among the first to enter Richmond when it fell. Lincoln visited the city two days later, greeted by crowds of freed people who fell to their knees before him.",
    "location": { "name": "Richmond, Virginia" }
  },
  {
    "id": "civilwar-049",
    "authorId": "robert-e-lee",
    "content": "The boys are going home. My boys. Some walking, some limping, some being carried. They did everything I asked. They deserve better than defeat. They deserve a better general. They deserve a better cause.",
    "displayDate": "April 10, 1865",
    "timestamp": "1865-04-10T08:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 567,
    "comments": 189,
    "shares": 123,
    "accuracy": "inferred",
    "historicalContext": "After surrendering, Lee bid farewell to his army in General Order No. 9. The soldiers who had followed him for four years went home, paroled but defeated.",
    "location": { "name": "Appomattox Court House, Virginia" }
  },
  {
    "id": "civilwar-050",
    "authorId": "harriet-tubman",
    "content": "They call me a hero now. But I remember the fear, the cold, the dogs barking in the dark. Every trip could have been my last. I wasn't brave. I was just too angry to be scared.",
    "displayDate": "June 1865",
    "timestamp": "1865-06-25T16:00:00Z",
    "era": "american-civil-war",
    "type": "status",
    "likes": 1890,
    "comments": 345,
    "shares": 278,
    "accuracy": "inferred",
    "historicalContext": "Tubman spent the rest of her long life advocating for women's suffrage and civil rights. She received a military pension but died in relative poverty in 1913.",
    "location": { "name": "Auburn, New York" }
  }
]
