[
  {
    "id": "egypt-001",
    "authorId": "pharaoh-khufu",
    "content": "They keep asking how long the pyramid will take. Twenty years, I tell them. Maybe thirty. They look at me like I'm mad. I won't live to see it finished. But it will stand forever. That's the point.",
    "displayDate": "2570 BCE",
    "timestamp": "-2570-06-15T10:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 892,
    "comments": 156,
    "shares": 234,
    "accuracy": "inferred",
    "historicalContext": "The Great Pyramid of Giza took approximately 20 years to build. Khufu (Cheops) commissioned it as his eternal tomb. It remained the tallest man-made structure for over 3,800 years.",
    "location": { "name": "Giza, Egypt" }
  },
  {
    "id": "egypt-002",
    "authorId": "pyramid-worker",
    "content": "Hauled stones all day. Back is killing me. They gave us extra beer rations though. And onions. The onions help somehow. The engineers say we're behind schedule. Engineers always say we're behind schedule.",
    "displayDate": "2568 BCE",
    "timestamp": "-2568-08-20T18:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 234,
    "comments": 56,
    "shares": 23,
    "accuracy": "inferred",
    "historicalContext": "Pyramid workers were not slaves but paid laborers. Archaeological evidence shows they received bread, beer, onions, and meat. Many took pride in their work and were buried near the pyramids they built.",
    "location": { "name": "Giza, Egypt" }
  },
  {
    "id": "egypt-003",
    "authorId": "cleopatra",
    "content": "Rolled myself up in a carpet today. Snuck past Caesar's guards. Worth it for the look on his face. Politics is mostly about surprise.",
    "displayDate": "48 BCE",
    "timestamp": "-0048-10-15T21:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 1245,
    "comments": 234,
    "shares": 189,
    "accuracy": "documented",
    "historicalContext": "Cleopatra VII reportedly had herself smuggled into Julius Caesar's presence wrapped in a carpet or bed linen to avoid her brother's guards. This dramatic first meeting led to their famous alliance.",
    "location": { "name": "Alexandria, Egypt" }
  },
  {
    "id": "egypt-004",
    "authorId": "ramesses-ii",
    "content": "Sixty-six years on the throne. Ninety children. Two hundred wives and concubines. Built more temples than any pharaoh in history. They'll call me the Great. I know this because I've already told them to.",
    "displayDate": "1225 BCE",
    "timestamp": "-1225-03-10T12:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 789,
    "comments": 167,
    "shares": 134,
    "accuracy": "documented",
    "historicalContext": "Ramesses II ruled for 66 years, the second-longest reign in Egyptian history. He had numerous children and wives, and his building projects were so extensive that later pharaohs often repurposed his monuments.",
    "location": { "name": "Pi-Ramesses, Egypt" }
  },
  {
    "id": "egypt-005",
    "authorId": "hatshepsut",
    "content": "They said a woman cannot be pharaoh. I said watch me. Now I wear the false beard and the double crown. Let them whisper. I'll be too busy ruling to listen.",
    "displayDate": "1478 BCE",
    "timestamp": "-1478-04-01T09:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 1123,
    "comments": 234,
    "shares": 189,
    "accuracy": "documented",
    "historicalContext": "Hatshepsut was one of the most successful pharaohs. She initially ruled as regent for her stepson but declared herself pharaoh, adopting male regalia and titles. Her reign brought prosperity and monumental building projects.",
    "location": { "name": "Thebes, Egypt" }
  },
  {
    "id": "egypt-006",
    "authorId": "scribe-amenhotep",
    "content": "My hand is cramped from writing all day. The temple wants inventories. The palace wants records. Everyone wants something written. Nobody wants to learn to write it themselves.",
    "displayDate": "1350 BCE",
    "timestamp": "-1350-07-18T16:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 234,
    "comments": 67,
    "shares": 23,
    "accuracy": "inferred",
    "historicalContext": "Scribes were essential to Egyptian bureaucracy. Literacy was rare and valuable. Scribes spent years learning hieroglyphs and hieratic script, often from childhood. They enjoyed high social status.",
    "location": { "name": "Thebes, Egypt" }
  },
  {
    "id": "egypt-007",
    "authorId": "nefertiti",
    "content": "My husband wants to change everything. One god instead of many. A new capital. New art. New ways of worship. I believe in his vision. I'm just not sure Egypt does.",
    "displayDate": "1345 BCE",
    "timestamp": "-1345-11-05T10:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 678,
    "comments": 145,
    "shares": 89,
    "accuracy": "inferred",
    "historicalContext": "Nefertiti was the Great Royal Wife of Akhenaten, who revolutionized Egyptian religion by promoting worship of the Aten (sun disk) above all other gods. The changes were reversed after his death.",
    "location": { "name": "Akhetaten (Amarna), Egypt" }
  },
  {
    "id": "egypt-008",
    "authorId": "akhenaten",
    "content": "The priests hate me. The nobles whisper behind my back. But when I look at the Aten rising, I know I am right. There is only one true god. They'll understand eventually. Or they won't. Either way, I will be proven correct.",
    "displayDate": "1340 BCE",
    "timestamp": "-1340-06-21T06:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 456,
    "comments": 189,
    "shares": 67,
    "accuracy": "inferred",
    "historicalContext": "Akhenaten's religious revolution was unpopular with the priesthood and was quickly reversed after his death. His name was erased from monuments. His son Tutankhamun restored the old gods.",
    "location": { "name": "Akhetaten (Amarna), Egypt" }
  },
  {
    "id": "egypt-009",
    "authorId": "tutankhamun",
    "content": "Nine years old and they've made me pharaoh. I barely understand what the advisors are telling me. They say nod and look serious. I can do that. I think.",
    "displayDate": "1332 BCE",
    "timestamp": "-1332-01-15T11:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 567,
    "comments": 89,
    "shares": 67,
    "accuracy": "inferred",
    "historicalContext": "Tutankhamun became pharaoh at around age 9 and died at 19. His reign was largely controlled by advisors, particularly Ay and Horemheb. His fame comes not from his reign but from his intact tomb.",
    "location": { "name": "Thebes, Egypt" }
  },
  {
    "id": "egypt-010",
    "authorId": "priest-of-amun",
    "content": "The boy king has restored the old ways. The temples of Amun are open again. The heretic's city stands empty. Ma'at is restored. The gods are pleased. At least, I assume they are. They haven't complained.",
    "displayDate": "1328 BCE",
    "timestamp": "-1328-05-10T08:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 345,
    "comments": 78,
    "shares": 45,
    "accuracy": "inferred",
    "historicalContext": "Tutankhamun's reign saw the restoration of traditional polytheistic worship. The city of Akhetaten was abandoned, and the temples of Amun and other gods were reopened and restored.",
    "location": { "name": "Thebes, Egypt" }
  },
  {
    "id": "egypt-011",
    "authorId": "cleopatra",
    "content": "They say I'm Greek, not Egyptian. I am the first of my family to learn Egyptian. I worship Isis. I am the Nile's daughter. Let Rome call me what they will.",
    "displayDate": "45 BCE",
    "timestamp": "-0045-02-20T14:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 789,
    "comments": 167,
    "shares": 123,
    "accuracy": "documented",
    "historicalContext": "Cleopatra VII was of Macedonian Greek descent but embraced Egyptian culture. She was reportedly the first Ptolemaic ruler to speak Egyptian. She presented herself as the reincarnation of Isis.",
    "location": { "name": "Alexandria, Egypt" }
  },
  {
    "id": "egypt-012",
    "authorId": "pyramid-worker",
    "content": "The overseer says we're making history. I say we're making a very large pile of rocks. History is for pharaohs. For us, it's just work. Good work, though. The beer helps.",
    "displayDate": "2565 BCE",
    "timestamp": "-2565-09-12T17:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 289,
    "comments": 45,
    "shares": 34,
    "accuracy": "inferred",
    "historicalContext": "Pyramid workers left graffiti and records showing pride in their work. Work gangs had names like 'Friends of Khufu' and 'Drunkards of Menkaure'. They were organized laborers, not enslaved people.",
    "location": { "name": "Giza, Egypt" }
  },
  {
    "id": "egypt-013",
    "authorId": "pharaoh-khufu",
    "content": "The architect says we need more limestone. We always need more limestone. The treasury says we're spending too much. The treasury always says we're spending too much. I say dig faster.",
    "displayDate": "2567 BCE",
    "timestamp": "-2567-04-08T11:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 456,
    "comments": 89,
    "shares": 56,
    "accuracy": "inferred",
    "historicalContext": "The Great Pyramid required an estimated 2.3 million stone blocks. Limestone was quarried locally, while granite came from Aswan, 500 miles upriver. The logistics were extraordinary.",
    "location": { "name": "Giza, Egypt" }
  },
  {
    "id": "egypt-014",
    "authorId": "ramesses-ii",
    "content": "Kadesh was a victory. I said so. I had it carved on every temple in Egypt. If anyone disagrees, they can take it up with the carvings.",
    "displayDate": "1274 BCE",
    "timestamp": "-1274-05-15T16:00:00Z",
    "era": "ancient-egypt",
    "type": "event",
    "likes": 567,
    "comments": 234,
    "shares": 89,
    "accuracy": "documented",
    "historicalContext": "The Battle of Kadesh against the Hittites was likely a stalemate, but Ramesses II portrayed it as a great victory. It led to history's first known peace treaty, preserved in both Egyptian and Hittite versions.",
    "location": { "name": "Kadesh, Syria" }
  },
  {
    "id": "egypt-015",
    "authorId": "hatshepsut",
    "content": "The expedition to Punt has returned. Myrrh, ebony, gold, baboons. The baboons are surprisingly difficult to manage. Worth it for the look on the courtiers' faces.",
    "displayDate": "1470 BCE",
    "timestamp": "-1470-10-20T10:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 678,
    "comments": 123,
    "shares": 89,
    "accuracy": "documented",
    "historicalContext": "Hatshepsut's expedition to Punt (possibly modern Eritrea or Somalia) was a major diplomatic and trading achievement. The journey is documented in detailed reliefs at her mortuary temple at Deir el-Bahri.",
    "location": { "name": "Thebes, Egypt" }
  },
  {
    "id": "egypt-016",
    "authorId": "embalmer",
    "content": "Seventy days for proper mummification. The family always wants it faster. The dead need time to become Osiris. You can't rush eternity.",
    "displayDate": "1250 BCE",
    "timestamp": "-1250-12-03T15:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 234,
    "comments": 67,
    "shares": 34,
    "accuracy": "documented",
    "historicalContext": "Mummification took about 70 days and involved removing organs, drying the body with natron, and wrapping in linen. It was essential for the afterlife, as Egyptians believed the soul needed the body.",
    "location": { "name": "Thebes, Egypt" }
  },
  {
    "id": "egypt-017",
    "authorId": "nile-farmer",
    "content": "The flood came on time this year. Good height. Not too much, not too little. The fields will be rich. Thank Hapy. Thank Osiris. Thank whoever's listening.",
    "displayDate": "1400 BCE",
    "timestamp": "-1400-08-15T07:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 178,
    "comments": 34,
    "shares": 12,
    "accuracy": "inferred",
    "historicalContext": "Egyptian civilization depended on the annual Nile flood. Too little meant famine; too much meant destruction. The Nilometer measured flood levels, and Hapy was the god of the flood.",
    "location": { "name": "Nile Valley, Egypt" }
  },
  {
    "id": "egypt-018",
    "authorId": "scribe-amenhotep",
    "content": "A student asked why we spend so many years learning to write. I told him: the tongue lasts a moment, the stylus lasts forever. He didn't look convinced. He'll understand when he's older. Or he won't graduate.",
    "displayDate": "1348 BCE",
    "timestamp": "-1348-02-28T09:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 267,
    "comments": 56,
    "shares": 45,
    "accuracy": "inferred",
    "historicalContext": "Scribal training began in childhood and lasted years. Students practiced on ostraca (pottery shards) before graduating to papyrus. Scribal wisdom literature emphasized the importance of their profession.",
    "location": { "name": "Thebes, Egypt" }
  },
  {
    "id": "egypt-019",
    "authorId": "cleopatra",
    "content": "Caesar is dead. Murdered in Rome. Our son is just a child. I must think carefully now. Very carefully. Egypt's future depends on the choices I make next.",
    "displayDate": "March 44 BCE",
    "timestamp": "-0044-03-20T18:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 567,
    "comments": 145,
    "shares": 89,
    "accuracy": "documented",
    "historicalContext": "Julius Caesar's assassination left Cleopatra politically vulnerable. She returned to Egypt and eventually allied with Mark Antony. Her son Caesarion was nominally co-ruler but was killed after her death.",
    "location": { "name": "Alexandria, Egypt" }
  },
  {
    "id": "egypt-020",
    "authorId": "tomb-painter",
    "content": "The noble wants more gold in his tomb paintings. More lapis blue. More of everything. He wants to impress the gods. I just want to finish before my eyes give out from painting in torchlight.",
    "displayDate": "1300 BCE",
    "timestamp": "-1300-05-15T20:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 189,
    "comments": 34,
    "shares": 12,
    "accuracy": "inferred",
    "historicalContext": "Tomb painters worked in teams, often in cramped, dark spaces lit by oil lamps. Colors came from mineral pigments: red and yellow ochre, blue from lapis lazuli or copper, green from malachite.",
    "location": { "name": "Valley of the Kings, Egypt" }
  },
  {
    "id": "egypt-021",
    "authorId": "nefertiti",
    "content": "They made a bust of me today. The sculptor seems pleased with it. I suppose it's a good likeness. It will probably end up in a museum someday. Is that what immortality looks like?",
    "displayDate": "1345 BCE",
    "timestamp": "-1345-08-12T14:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 1234,
    "comments": 234,
    "shares": 189,
    "accuracy": "inferred",
    "historicalContext": "The famous bust of Nefertiti, discovered in 1912, is one of the most recognized works of ancient art. It was found in the workshop of the sculptor Thutmose and is now in Berlin.",
    "location": { "name": "Akhetaten (Amarna), Egypt" }
  },
  {
    "id": "egypt-022",
    "authorId": "priest-of-amun",
    "content": "A cat died in the temple today. Of course we're mummifying it. Of course we're holding a funeral. Some of the younger priests think we're excessive. They don't understand. Cats are sacred. End of discussion.",
    "displayDate": "1100 BCE",
    "timestamp": "-1100-09-08T16:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 456,
    "comments": 89,
    "shares": 67,
    "accuracy": "documented",
    "historicalContext": "Cats were sacred to Bastet and highly revered in Egypt. Killing a cat, even accidentally, could be punishable by death. Thousands of mummified cats have been found in temple cemeteries.",
    "location": { "name": "Thebes, Egypt" }
  },
  {
    "id": "egypt-023",
    "authorId": "ramesses-ii",
    "content": "The Hittites want peace. After Kadesh, after all these years. They're sending a princess for my harem. Very well. Peace it is. I'm too old for another campaign anyway. Don't tell anyone I said that.",
    "displayDate": "1258 BCE",
    "timestamp": "-1258-11-21T10:00:00Z",
    "era": "ancient-egypt",
    "type": "event",
    "likes": 678,
    "comments": 134,
    "shares": 89,
    "accuracy": "verified",
    "historicalContext": "The Egyptian-Hittite peace treaty of 1258 BCE is the oldest surviving peace treaty. Both empires agreed to non-aggression and mutual defense. A Hittite princess became one of Ramesses' many wives.",
    "location": { "name": "Pi-Ramesses, Egypt" }
  },
  {
    "id": "egypt-024",
    "authorId": "embalmer",
    "content": "The heart stays. The brain comes out through the nose. The liver, lungs, stomach, intestines—each in its own jar, each with its own god. The family doesn't need to know the details. They just need to know it's done right.",
    "displayDate": "1400 BCE",
    "timestamp": "-1400-01-18T19:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 345,
    "comments": 78,
    "shares": 45,
    "accuracy": "documented",
    "historicalContext": "The brain was removed with hooks through the nose and discarded. The heart, believed to be the seat of intelligence and emotion, was left in place for the judgment of the dead before Osiris.",
    "location": { "name": "Thebes, Egypt" }
  },
  {
    "id": "egypt-025",
    "authorId": "akhenaten",
    "content": "Moved the capital to Akhetaten. Fresh city, fresh start. No old temples, no old priests whispering in corners. Just the Aten, the sky, and me. Is it lonely? Sometimes. Is it right? Always.",
    "displayDate": "1346 BCE",
    "timestamp": "-1346-03-25T06:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 345,
    "comments": 89,
    "shares": 56,
    "accuracy": "documented",
    "historicalContext": "Akhenaten built an entirely new capital city, Akhetaten (modern Amarna), on virgin ground. It was abandoned after his death and systematically dismantled. His religious revolution died with him.",
    "location": { "name": "Akhetaten (Amarna), Egypt" }
  },
  {
    "id": "egypt-026",
    "authorId": "nile-farmer",
    "content": "The taxman came. He always comes. He counted my grain, counted my cattle, counted everything. Then he took a third. The pharaoh needs it, he says. The pharaoh always needs something.",
    "displayDate": "1280 BCE",
    "timestamp": "-1280-10-05T10:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 167,
    "comments": 45,
    "shares": 12,
    "accuracy": "inferred",
    "historicalContext": "Egyptian taxation was primarily in kind—grain, cattle, linen. Scribes kept detailed records. Tax evasion was punished harshly. The system funded temples, the military, and monumental building projects.",
    "location": { "name": "Nile Valley, Egypt" }
  },
  {
    "id": "egypt-027",
    "authorId": "cleopatra",
    "content": "Antony has lost the war. The Romans are coming. I've tried the asp. It's quick, they say. Painless. Better than being paraded through Rome in chains. Egypt dies with me. At least let me choose how.",
    "displayDate": "August 12, 30 BCE",
    "timestamp": "-0030-08-12T15:00:00Z",
    "era": "ancient-egypt",
    "type": "event",
    "likes": 1567,
    "comments": 345,
    "shares": 278,
    "accuracy": "documented",
    "historicalContext": "Cleopatra's death by suicide (traditionally by asp bite) ended the Ptolemaic dynasty and three millennia of pharaonic rule. Egypt became a Roman province. Her death marks the end of ancient Egypt.",
    "location": { "name": "Alexandria, Egypt" }
  },
  {
    "id": "egypt-028",
    "authorId": "tomb-painter",
    "content": "The foreman says my ibis looks more like a duck. I say the nobleman won't know the difference. He's never seen an ibis up close. Neither have I, honestly. I'm working from another painting.",
    "displayDate": "1320 BCE",
    "timestamp": "-1320-06-14T12:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 234,
    "comments": 56,
    "shares": 23,
    "accuracy": "inferred",
    "historicalContext": "Egyptian art followed strict conventions, but artisans still brought individual skill and sometimes humor to their work. Sketch ostraca show practice work and even caricatures.",
    "location": { "name": "Valley of the Kings, Egypt" }
  },
  {
    "id": "egypt-029",
    "authorId": "tutankhamun",
    "content": "Married my half-sister today. That's just how it works in the royal family. At least she's nice. The advisors seem happy. I'm just trying to keep up with all the ceremonies.",
    "displayDate": "1330 BCE",
    "timestamp": "-1330-04-20T14:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 345,
    "comments": 89,
    "shares": 45,
    "accuracy": "documented",
    "historicalContext": "Royal incest was common in Egyptian dynasties to preserve bloodlines and divine status. Tutankhamun married Ankhesenamun, who was likely his half-sister. They had two stillborn daughters.",
    "location": { "name": "Thebes, Egypt" }
  },
  {
    "id": "egypt-030",
    "authorId": "priest-of-amun",
    "content": "Another day of offerings. Incense, bread, beer, meat. The god eats well. We eat what he leaves. Which is everything, because statues don't actually eat. Don't tell the commoners I said that.",
    "displayDate": "1200 BCE",
    "timestamp": "-1200-07-22T08:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 289,
    "comments": 67,
    "shares": 34,
    "accuracy": "inferred",
    "historicalContext": "Temple offerings were presented to the god's statue, then 'reverted' to the priests who ate them. This was the primary income for many temple staff. Temples were major economic institutions.",
    "location": { "name": "Karnak, Thebes" }
  },
  {
    "id": "egypt-031",
    "authorId": "hatshepsut",
    "content": "My nephew grows restless. He wants the throne for himself alone. Perhaps I should be worried. Perhaps I should have him watched more carefully. But I built Egypt, and I will not be pushed aside by a boy.",
    "displayDate": "1458 BCE",
    "timestamp": "-1458-02-14T17:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 567,
    "comments": 123,
    "shares": 89,
    "accuracy": "inferred",
    "historicalContext": "Thutmose III eventually ruled alone after Hatshepsut's death. Years later, he ordered her images and names erased from monuments, possibly to eliminate a precedent for female rule.",
    "location": { "name": "Thebes, Egypt" }
  },
  {
    "id": "egypt-032",
    "authorId": "pyramid-worker",
    "content": "Accident on the site today. Rope broke, stone fell. Three men crushed. We buried them with honors. The overseer says we're still behind schedule. The dead are dead. The pyramid continues.",
    "displayDate": "2566 BCE",
    "timestamp": "-2566-11-08T19:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 178,
    "comments": 56,
    "shares": 23,
    "accuracy": "inferred",
    "historicalContext": "Archaeological evidence shows pyramid workers received medical care and were buried with care near the pyramids. Injuries were common, but workers were valued, not disposable.",
    "location": { "name": "Giza, Egypt" }
  },
  {
    "id": "egypt-033",
    "authorId": "scribe-amenhotep",
    "content": "Teaching a new boy today. He can't hold the stylus right. His hieratic looks like bird tracks in mud. But he's eager. Eagerness counts for something. I was worse at his age. Probably.",
    "displayDate": "1346 BCE",
    "timestamp": "-1346-09-30T10:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 234,
    "comments": 45,
    "shares": 23,
    "accuracy": "inferred",
    "historicalContext": "Scribal education involved years of copying texts, learning different scripts, and mastering mathematical calculations. Mistakes on practice ostraca show the learning process.",
    "location": { "name": "Thebes, Egypt" }
  },
  {
    "id": "egypt-034",
    "authorId": "nefertiti",
    "content": "The king is dead. My husband, the heretic, is dead. The court looks at me differently now. The old priests are circling. I must be very careful. I must be very wise. I must survive.",
    "displayDate": "1336 BCE",
    "timestamp": "-1336-01-05T20:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 456,
    "comments": 123,
    "shares": 67,
    "accuracy": "inferred",
    "historicalContext": "Nefertiti's fate after Akhenaten's death is unknown. She may have briefly ruled as pharaoh under the name Smenkhkare, or she may have died before her husband. Her mummy has never been definitively identified.",
    "location": { "name": "Akhetaten (Amarna), Egypt" }
  },
  {
    "id": "egypt-035",
    "authorId": "ramesses-ii",
    "content": "Buried another wife today. Buried more sons than I can count. Outlived everyone. The curse of a long life is watching everyone leave before you. But still, I build. What else is there?",
    "displayDate": "1223 BCE",
    "timestamp": "-1223-08-25T18:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 456,
    "comments": 145,
    "shares": 89,
    "accuracy": "inferred",
    "historicalContext": "Ramesses II died at about 90, having outlived many of his children and several of his principal wives. His thirteenth son, Merneptah, finally succeeded him.",
    "location": { "name": "Pi-Ramesses, Egypt" }
  },
  {
    "id": "egypt-036",
    "authorId": "nile-farmer",
    "content": "Hippo in the field again. The beast ate half my crops and looked at me like I was the problem. Tried to chase it off. The hippo laughed. Hippos shouldn't be able to laugh. And yet.",
    "displayDate": "1150 BCE",
    "timestamp": "-1150-09-18T07:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 345,
    "comments": 89,
    "shares": 56,
    "accuracy": "inferred",
    "historicalContext": "Hippopotamuses were a real danger to farmers along the Nile. They destroyed crops and killed more people than crocodiles. Hunting them was considered a sport of kings.",
    "location": { "name": "Nile Valley, Egypt" }
  },
  {
    "id": "egypt-037",
    "authorId": "embalmer",
    "content": "Worked on a baby today. Barely lived a week. The parents want full mummification. Full canopic jars. Full ceremonies. So small, and so loved. This is the hard part of the job.",
    "displayDate": "1280 BCE",
    "timestamp": "-1280-03-12T21:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 234,
    "comments": 67,
    "shares": 23,
    "accuracy": "inferred",
    "historicalContext": "Infant mortality was high in ancient Egypt. Mummified infants and stillborns have been found, showing that even the youngest were prepared for the afterlife when families could afford it.",
    "location": { "name": "Thebes, Egypt" }
  },
  {
    "id": "egypt-038",
    "authorId": "cleopatra",
    "content": "Met Antony at Tarsus today. Arrived on a golden barge. Purple sails. Musicians, incense, servants dressed as cupids. If you're going to make an entrance, make an entrance. He was impressed. I think.",
    "displayDate": "41 BCE",
    "timestamp": "-0041-10-15T17:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 1123,
    "comments": 234,
    "shares": 178,
    "accuracy": "documented",
    "historicalContext": "Cleopatra's meeting with Mark Antony at Tarsus was a calculated display of Egyptian wealth and power. The spectacle worked—Antony followed her to Alexandria and their famous alliance began.",
    "location": { "name": "Tarsus, Cilicia" }
  },
  {
    "id": "egypt-039",
    "authorId": "pharaoh-khufu",
    "content": "They're saying it can't be done. The engineers, the priests, everyone. Too big, too ambitious, too expensive. I say: that's exactly why we're doing it. Anyone can build small.",
    "displayDate": "2575 BCE",
    "timestamp": "-2575-01-10T09:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 567,
    "comments": 89,
    "shares": 78,
    "accuracy": "inferred",
    "historicalContext": "The Great Pyramid was unprecedented in scale. At 481 feet originally, it required revolutionary engineering. Khufu's reign saw a massive mobilization of resources for this single project.",
    "location": { "name": "Giza, Egypt" }
  },
  {
    "id": "egypt-040",
    "authorId": "tomb-painter",
    "content": "Finished the Weighing of the Heart scene today. Ammit looks particularly hungry. The nobleman visiting his tomb seemed nervous. Good. That's the point. Behave in life or face the consequences.",
    "displayDate": "1285 BCE",
    "timestamp": "-1285-12-20T15:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 289,
    "comments": 56,
    "shares": 34,
    "accuracy": "inferred",
    "historicalContext": "The Weighing of the Heart showed the dead person's heart weighed against Ma'at (truth). If the heart was heavy with sin, Ammit—part crocodile, lion, and hippopotamus—would devour it.",
    "location": { "name": "Valley of the Kings, Egypt" }
  },
  {
    "id": "egypt-041",
    "authorId": "priest-of-amun",
    "content": "The temple treasury is full. The storehouses overflow. Donations from the pharaoh, from nobles, from commoners seeking blessings. Amun is powerful. And so are we. Best not to forget either.",
    "displayDate": "1250 BCE",
    "timestamp": "-1250-06-08T11:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 234,
    "comments": 78,
    "shares": 45,
    "accuracy": "inferred",
    "historicalContext": "The temples of Amun at Thebes accumulated enormous wealth. By the New Kingdom, the priesthood of Amun rivaled the pharaoh in power. Their influence was a constant political factor.",
    "location": { "name": "Karnak, Thebes" }
  },
  {
    "id": "egypt-042",
    "authorId": "akhenaten",
    "content": "Closed the temples of Amun. Redirected the offerings to the Aten. The priests are furious. The people are confused. But they'll understand. The truth takes time. Truth always takes time.",
    "displayDate": "1348 BCE",
    "timestamp": "-1348-07-05T10:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 234,
    "comments": 145,
    "shares": 56,
    "accuracy": "documented",
    "historicalContext": "Akhenaten's religious revolution included closing temples, redirecting offerings, and even erasing the name of Amun from monuments. It was the most radical change in Egyptian religious history.",
    "location": { "name": "Thebes, Egypt" }
  },
  {
    "id": "egypt-043",
    "authorId": "tutankhamun",
    "content": "My leg hurts all the time. The physicians say it's the bone. They give me herbs and prayers. Neither helps much. Being pharaoh should exempt you from pain. It doesn't.",
    "displayDate": "1325 BCE",
    "timestamp": "-1325-10-15T20:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 345,
    "comments": 89,
    "shares": 45,
    "accuracy": "documented",
    "historicalContext": "CT scans of Tutankhamun's mummy reveal a broken leg that became infected, possibly contributing to his death. He also had a club foot and used walking sticks found in his tomb.",
    "location": { "name": "Thebes, Egypt" }
  },
  {
    "id": "egypt-044",
    "authorId": "scribe-amenhotep",
    "content": "Archive inventory complete. Three thousand papyri catalogued. My predecessor was not organized. That's putting it kindly. Took me six months to sort through the chaos. Archives are civilization. Chaos is the enemy.",
    "displayDate": "1344 BCE",
    "timestamp": "-1344-04-12T16:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 189,
    "comments": 45,
    "shares": 23,
    "accuracy": "inferred",
    "historicalContext": "Egyptian bureaucracy produced vast amounts of records—tax rolls, legal documents, letters, inventories. Archives were essential. Much of what we know about daily life comes from these records.",
    "location": { "name": "Thebes, Egypt" }
  },
  {
    "id": "egypt-045",
    "authorId": "hatshepsut",
    "content": "The obelisks at Karnak are finished. Tallest in Egypt. Electrum-plated tips that catch the sun. The priests complained about the cost. I reminded them who pays their salaries.",
    "displayDate": "1457 BCE",
    "timestamp": "-1457-09-18T12:00:00Z",
    "era": "ancient-egypt",
    "type": "event",
    "likes": 678,
    "comments": 123,
    "shares": 89,
    "accuracy": "documented",
    "historicalContext": "Hatshepsut erected two massive obelisks at Karnak, among the tallest ever built in Egypt. One still stands. Inscriptions describe them as reaching the sky, with tips of electrum.",
    "location": { "name": "Karnak, Thebes" }
  },
  {
    "id": "egypt-046",
    "authorId": "nile-farmer",
    "content": "The flood was weak this year. Barely covered the low fields. Going to be a hungry winter. The granary master says there's enough. Granary masters always say there's enough. Until there isn't.",
    "displayDate": "1185 BCE",
    "timestamp": "-1185-09-25T07:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 156,
    "comments": 45,
    "shares": 12,
    "accuracy": "inferred",
    "historicalContext": "Low floods meant famine. Egypt's granary system stored surplus from good years, but consecutive low floods could be catastrophic. Climate records show correlations between Nile levels and social stability.",
    "location": { "name": "Nile Valley, Egypt" }
  },
  {
    "id": "egypt-047",
    "authorId": "ramesses-ii",
    "content": "Ninety years old. Still pharaoh. Still building. They'll have to pry the crook and flail from my cold, dead hands. Which, at this rate, should be any day now. But not today. Today I build.",
    "displayDate": "1213 BCE",
    "timestamp": "-1213-07-08T10:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 567,
    "comments": 145,
    "shares": 89,
    "accuracy": "inferred",
    "historicalContext": "Ramesses II died at around 90 after one of the longest reigns in history. His mummy shows a bent spine, worn teeth, and arthritis—the marks of an extremely long life by ancient standards.",
    "location": { "name": "Pi-Ramesses, Egypt" }
  },
  {
    "id": "egypt-048",
    "authorId": "embalmer",
    "content": "Royal commission today. Won't say who—discretion is everything in this business. Let's just say the funeral will be the biggest in a generation. And the pay? Also the biggest in a generation.",
    "displayDate": "1213 BCE",
    "timestamp": "-1213-08-20T15:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 345,
    "comments": 89,
    "shares": 56,
    "accuracy": "inferred",
    "historicalContext": "Royal mummification was an elaborate process involving the best embalmers, finest materials, and most elaborate rituals. Ramesses II's mummy is exceptionally well-preserved.",
    "location": { "name": "Thebes, Egypt" }
  },
  {
    "id": "egypt-049",
    "authorId": "priest-of-amun",
    "content": "The heretic king's city stands empty. His temples ruined. His name erased. We told him the old gods would not be forgotten. We told him. He didn't listen. No one ever listens.",
    "displayDate": "1325 BCE",
    "timestamp": "-1325-03-05T09:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 234,
    "comments": 78,
    "shares": 34,
    "accuracy": "inferred",
    "historicalContext": "After Akhenaten's death, his religious revolution was systematically reversed. Akhetaten was abandoned, his monuments destroyed, and his name erased from king lists. The restoration was thorough.",
    "location": { "name": "Karnak, Thebes" }
  },
  {
    "id": "egypt-050",
    "authorId": "cleopatra",
    "content": "Seven languages. Two great loves. Three children. One kingdom. Zero regrets. Well. Maybe one or two. But a queen doesn't admit regrets. A queen holds her head high to the end.",
    "displayDate": "August 10, 30 BCE",
    "timestamp": "-0030-08-10T18:00:00Z",
    "era": "ancient-egypt",
    "type": "status",
    "likes": 1345,
    "comments": 234,
    "shares": 189,
    "accuracy": "inferred",
    "historicalContext": "Cleopatra VII was the last pharaoh of Egypt, speaking multiple languages and ruling through multiple crises. Her death by suicide ended the Ptolemaic dynasty and pharaonic Egypt itself.",
    "location": { "name": "Alexandria, Egypt" }
  }
]
