[
  {
    "id": "ind-001",
    "authorId": "james-watt",
    "type": "status",
    "content": "Been staring at this Newcomen engine for months. So inefficient. All that heat just wasted. What if we had a separate condenser? Keep the cylinder hot, condense the steam elsewhere. Sketching it out tonight.",
    "timestamp": "1765-05-15T19:30:00Z",
    "displayDate": "May 15, 1765",
    "likes": 34560,
    "comments": 2340,
    "shares": 5670,
    "accuracy": "documented",
    "historicalContext": "James Watt conceived the idea of a separate condenser for the steam engine while walking on Glasgow Green in 1765. This single improvement would dramatically increase engine efficiency and help power the Industrial Revolution.",
    "era": "industrial-revolution",
    "location": { "name": "Glasgow, Scotland", "modern": "Glasgow, Scotland" }
  },
  {
    "id": "ind-002",
    "authorId": "richard-arkwright",
    "type": "status",
    "content": "The water frame is working. Stronger thread than any spinner can make by hand. Now I just need capital. Visited Jedediah Strutt in Nottingham. He sees the potential. We're going to build a proper mill.",
    "timestamp": "1769-08-03T14:00:00Z",
    "displayDate": "August 3, 1769",
    "likes": 23450,
    "comments": 1890,
    "shares": 4320,
    "accuracy": "documented",
    "historicalContext": "Richard Arkwright patented the water frame in 1769 and partnered with Jedediah Strutt to build mills. His Cromford Mill (1771) is considered the first successful water-powered cotton spinning factory.",
    "era": "industrial-revolution",
    "location": { "name": "Nottingham, England", "modern": "Nottingham, England" }
  },
  {
    "id": "ind-003",
    "authorId": "matthew-boulton",
    "type": "status",
    "content": "Met James Watt today. Brilliant man. Terrible businessman. I told him - come to Birmingham. We'll make engines together. I sell what all the world desires to have: POWER.",
    "timestamp": "1773-05-17T16:00:00Z",
    "displayDate": "May 17, 1773",
    "likes": 28900,
    "comments": 2100,
    "shares": 4890,
    "accuracy": "documented",
    "historicalContext": "Matthew Boulton's partnership with James Watt, formed in 1775, created the Boulton & Watt company that manufactured steam engines for mines, mills, and factories across Britain and beyond.",
    "era": "industrial-revolution",
    "location": { "name": "Soho, Birmingham", "modern": "Birmingham, England" }
  },
  {
    "id": "ind-004",
    "authorId": "josiah-wedgwood",
    "type": "status",
    "content": "Queen Charlotte ordered a tea set. THE QUEEN. Now I can call it \"Queen's Ware\" and everyone will want it. Marketing, gentlemen. That's the real art.",
    "timestamp": "1765-09-12T11:00:00Z",
    "displayDate": "September 12, 1765",
    "likes": 19870,
    "comments": 1560,
    "shares": 3450,
    "accuracy": "documented",
    "historicalContext": "Josiah Wedgwood received royal patronage from Queen Charlotte in 1765, allowing him to market his cream-colored earthenware as 'Queen's Ware.' This combination of quality manufacturing and marketing genius made Wedgwood ceramics famous worldwide.",
    "era": "industrial-revolution",
    "location": { "name": "Burslem, Staffordshire", "modern": "Stoke-on-Trent, England" }
  },
  {
    "id": "ind-005",
    "authorId": "handloom-weaver",
    "type": "status",
    "content": "Twenty years ago I earned three guineas a week. Good money. Now these mill owners pay a shilling for what took me days. Can't feed a family on that. My son says I should work in the factory. I'd rather die.",
    "timestamp": "1800-03-20T20:00:00Z",
    "displayDate": "March 20, 1800",
    "likes": 12340,
    "comments": 2890,
    "shares": 4560,
    "accuracy": "inferred",
    "historicalContext": "Handloom weavers saw their wages collapse as power looms increased production. A weaver earning 21 shillings in 1800 might earn only 5 shillings by 1830 for the same work. Many faced starvation or factory work.",
    "era": "industrial-revolution",
    "location": { "name": "Bolton, Lancashire", "modern": "Bolton, England" }
  },
  {
    "id": "ind-006",
    "authorId": "factory-child",
    "type": "status",
    "content": "Fell asleep standing up again. The overlooker hit me with his strap. Fourteen hours today. My hands are bleeding from the threads. I want to go home but this IS home now.",
    "timestamp": "1825-11-08T21:30:00Z",
    "displayDate": "November 8, 1825",
    "likes": 34560,
    "comments": 5670,
    "shares": 8900,
    "accuracy": "inferred",
    "historicalContext": "Child laborers in textile mills often worked 14-16 hour days. Overseers ('overlookers') kept children awake with straps or cold water. Many children were orphans or from workhouses, essentially owned by factory masters.",
    "era": "industrial-revolution",
    "location": { "name": "Manchester, England", "modern": "Manchester, England" }
  },
  {
    "id": "ind-007",
    "authorId": "cotton-mill-worker",
    "type": "status",
    "content": "Can't stop coughing. The cotton dust gets in your lungs. They call it 'spinner's phthisis.' Two girls on my floor died this year. Both younger than me. The machines keep running.",
    "timestamp": "1828-02-14T06:30:00Z",
    "displayDate": "February 14, 1828",
    "likes": 18760,
    "comments": 3450,
    "shares": 5670,
    "accuracy": "inferred",
    "historicalContext": "Cotton mill workers suffered from respiratory diseases caused by inhaling cotton dust, known as byssinosis or 'brown lung.' Factory conditions were often deadly, with no ventilation and machinery that could maim or kill workers.",
    "era": "industrial-revolution",
    "location": { "name": "Manchester, England", "modern": "Manchester, England" }
  },
  {
    "id": "ind-008",
    "authorId": "robert-owen",
    "type": "status",
    "content": "Opened the school at New Lanark today. Children as young as three, learning to read instead of working the machines. My partners think I'm mad. But educated workers are better workers. And they're still human beings.",
    "timestamp": "1816-01-02T10:00:00Z",
    "displayDate": "January 2, 1816",
    "likes": 45670,
    "comments": 4560,
    "shares": 7890,
    "accuracy": "documented",
    "historicalContext": "Robert Owen's New Lanark mills were a model of enlightened factory management. He provided education for workers' children, decent housing, fair prices at the company store, and reduced working hours - while still remaining profitable.",
    "era": "industrial-revolution",
    "location": { "name": "New Lanark, Scotland", "modern": "New Lanark, Scotland" }
  },
  {
    "id": "ind-009",
    "authorId": "william-blake",
    "type": "status",
    "content": "And did those feet in ancient time walk upon England's mountains green? Now I see only dark Satanic mills. We must build Jerusalem again, but not with chimneys and child labor.",
    "timestamp": "1804-04-15T22:00:00Z",
    "displayDate": "April 15, 1804",
    "likes": 67890,
    "comments": 5670,
    "shares": 12340,
    "accuracy": "attributed",
    "historicalContext": "William Blake wrote the poem 'Jerusalem' around 1804. The 'dark Satanic mills' likely referred to both literal factories and metaphorical spiritual oppression. The poem later became an anthem for social reform movements.",
    "era": "industrial-revolution",
    "location": { "name": "London, England", "modern": "London, England" }
  },
  {
    "id": "ind-010",
    "authorId": "george-stephenson",
    "type": "status",
    "content": "The Rocket won. Thirty miles an hour! The horse owners laughed at us. They're not laughing now. This is the future. Iron roads across the whole country. You'll see.",
    "timestamp": "1829-10-14T15:00:00Z",
    "displayDate": "October 14, 1829",
    "likes": 56780,
    "comments": 4560,
    "shares": 9870,
    "accuracy": "documented",
    "historicalContext": "The Rainhill Trials of 1829 tested locomotives for the Liverpool and Manchester Railway. Stephenson's Rocket won decisively, reaching 30 mph. This proved the viability of steam railways for passenger and freight transport.",
    "era": "industrial-revolution",
    "location": { "name": "Rainhill, Lancashire", "modern": "Rainhill, Merseyside, England" }
  },
  {
    "id": "ind-011",
    "authorId": "george-stephenson",
    "type": "status",
    "content": "A man was killed today. William Huskisson, member of Parliament. Stepped onto the track and the Rocket couldn't stop in time. First day of the Liverpool-Manchester line. I feel sick.",
    "timestamp": "1830-09-15T14:30:00Z",
    "displayDate": "September 15, 1830",
    "likes": 34560,
    "comments": 5670,
    "shares": 7890,
    "accuracy": "documented",
    "historicalContext": "William Huskisson became the first railway passenger fatality when he was struck by the Rocket during the opening ceremony of the Liverpool and Manchester Railway. Despite this tragedy, the railway was a commercial success.",
    "era": "industrial-revolution",
    "location": { "name": "Parkside, Lancashire", "modern": "Newton-le-Willows, England" }
  },
  {
    "id": "ind-012",
    "authorId": "coal-miner",
    "type": "status",
    "content": "Explosion in the Felling pit. Ninety-two dead. My cousin among them. The firedamp. We've been warning them for years. But coal must flow and men are cheap.",
    "timestamp": "1812-05-25T19:00:00Z",
    "displayDate": "May 25, 1812",
    "likes": 23450,
    "comments": 4560,
    "shares": 6780,
    "accuracy": "documented",
    "historicalContext": "The Felling mine disaster killed 92 miners. Such disasters were common - methane gas (firedamp) and coal dust caused explosions. This tragedy led Humphry Davy to develop the safety lamp in 1815.",
    "era": "industrial-revolution",
    "location": { "name": "Felling, County Durham", "modern": "Gateshead, England" }
  },
  {
    "id": "ind-013",
    "authorId": "humphry-davy",
    "type": "status",
    "content": "The lamp works. A wire gauze around the flame prevents the firedamp from igniting. So simple. But it will save lives. I won't patent it - this belongs to everyone.",
    "timestamp": "1815-11-09T11:00:00Z",
    "displayDate": "November 9, 1815",
    "likes": 45670,
    "comments": 3450,
    "shares": 7890,
    "accuracy": "documented",
    "historicalContext": "Humphry Davy invented the safety lamp in 1815, allowing miners to detect dangerous gases without causing explosions. He refused to patent it, believing safety devices should be freely available. George Stephenson independently developed a similar lamp.",
    "era": "industrial-revolution",
    "location": { "name": "London, England", "modern": "London, England" }
  },
  {
    "id": "ind-014",
    "authorId": "mary-shelley",
    "type": "status",
    "content": "Finished the story. About a man who creates life through science, through galvanism. But the creature he makes - what happens when we play God? Called it Frankenstein. Percy says it's good.",
    "timestamp": "1817-05-14T23:00:00Z",
    "displayDate": "May 14, 1817",
    "likes": 78900,
    "comments": 6780,
    "shares": 15670,
    "accuracy": "documented",
    "historicalContext": "Mary Shelley wrote Frankenstein at age 18-19. The novel reflects anxieties about scientific progress, industrialization, and the ethics of technological advancement. It was published anonymously in 1818.",
    "era": "industrial-revolution",
    "location": { "name": "Marlow, Buckinghamshire", "modern": "Marlow, England" }
  },
  {
    "id": "ind-015",
    "authorId": "eli-whitney",
    "type": "status",
    "content": "One slave with my cotton gin can clean fifty pounds of cotton a day. Before, it took one slave a whole day to clean one pound. Southern planters are ordering hundreds. I should feel proud, I suppose.",
    "timestamp": "1794-03-14T12:00:00Z",
    "displayDate": "March 14, 1794",
    "likes": 19870,
    "comments": 5670,
    "shares": 4560,
    "accuracy": "documented",
    "historicalContext": "Eli Whitney's cotton gin (1794) revolutionized cotton processing but had devastating consequences - it made cotton cultivation massively profitable and caused an explosion in American slavery. Whitney himself was conflicted about this legacy.",
    "era": "industrial-revolution",
    "location": { "name": "Georgia, USA", "modern": "Georgia, USA" }
  },
  {
    "id": "ind-016",
    "authorId": "handloom-weaver",
    "type": "status",
    "content": "They're breaking the machines. The lads in Nottingham smashed the frames. Call themselves Luddites after some Ned Ludd. I understand the anger. Those machines took everything from us.",
    "timestamp": "1811-11-12T21:00:00Z",
    "displayDate": "November 12, 1811",
    "likes": 23450,
    "comments": 4560,
    "shares": 6780,
    "accuracy": "documented",
    "historicalContext": "The Luddite movement began in Nottingham in 1811 when textile workers destroyed labor-saving machinery. Named after the possibly mythical Ned Ludd, the movement spread across northern England before being suppressed by the army.",
    "era": "industrial-revolution",
    "location": { "name": "Bolton, Lancashire", "modern": "Bolton, England" }
  },
  {
    "id": "ind-017",
    "authorId": "railway-navvy",
    "type": "status",
    "content": "Dug through a hill today. Twenty feet of rock and clay. Lost two men in a collapse. The contractor says keep digging. We're Irish, we're expendable. But the pay feeds my family back home.",
    "timestamp": "1835-07-22T19:30:00Z",
    "displayDate": "July 22, 1835",
    "likes": 12340,
    "comments": 2890,
    "shares": 4560,
    "accuracy": "inferred",
    "historicalContext": "Railway 'navvies' (navigators) built Britain's rail network by hand. Often Irish immigrants fleeing poverty, they lived in camps, worked in dangerous conditions, and died in the thousands from accidents and disease.",
    "era": "industrial-revolution",
    "location": { "name": "Yorkshire, England", "modern": "Yorkshire, England" }
  },
  {
    "id": "ind-018",
    "authorId": "isambard-brunel",
    "type": "status",
    "content": "The tunnel under the Thames is flooded AGAIN. Father's design is brilliant but the river keeps breaking through. Nearly drowned last week. We'll finish this thing if it kills me. (It might.)",
    "timestamp": "1828-01-12T16:00:00Z",
    "displayDate": "January 12, 1828",
    "likes": 34560,
    "comments": 3450,
    "shares": 5670,
    "accuracy": "documented",
    "historicalContext": "The Thames Tunnel, built by Marc and Isambard Brunel, suffered multiple floods and collapses. Isambard nearly died in a flood in 1828. The tunnel took 18 years to complete (1825-1843) and was the first tunnel under a navigable river.",
    "era": "industrial-revolution",
    "location": { "name": "Rotherhithe, London", "modern": "London, England" }
  },
  {
    "id": "ind-019",
    "authorId": "isambard-brunel",
    "type": "status",
    "content": "Launched the Great Western today. Largest steamship ever built. They said you couldn't cross the Atlantic by steam alone. We'll prove them wrong. Bristol to New York in fifteen days.",
    "timestamp": "1838-04-08T11:00:00Z",
    "displayDate": "April 8, 1838",
    "likes": 45670,
    "comments": 4560,
    "shares": 8900,
    "accuracy": "documented",
    "historicalContext": "Brunel's SS Great Western was the largest passenger ship in the world when launched. It proved that steamships could cross the Atlantic faster and more reliably than sailing ships, revolutionizing transatlantic travel.",
    "era": "industrial-revolution",
    "location": { "name": "Bristol, England", "modern": "Bristol, England" }
  },
  {
    "id": "ind-020",
    "authorId": "michael-faraday",
    "type": "status",
    "content": "Wound a coil of wire around an iron ring. Passed current through one coil and the other coil showed a pulse of current too. No direct connection. The magnetic field carries the force. This changes everything.",
    "timestamp": "1831-08-29T15:00:00Z",
    "displayDate": "August 29, 1831",
    "likes": 56780,
    "comments": 4560,
    "shares": 9870,
    "accuracy": "documented",
    "historicalContext": "Michael Faraday's discovery of electromagnetic induction in 1831 laid the groundwork for electric generators and transformers. This discovery would eventually lead to the electrical age and power our modern world.",
    "era": "industrial-revolution",
    "location": { "name": "Royal Institution, London", "modern": "London, England" }
  },
  {
    "id": "ind-021",
    "authorId": "lord-shaftesbury",
    "type": "status",
    "content": "Visited the mines today. Children as young as five working underground. Girls pulling coal carts on all fours, chained like animals. This must end. I will make Parliament see.",
    "timestamp": "1840-04-15T18:00:00Z",
    "displayDate": "April 15, 1840",
    "likes": 34560,
    "comments": 5670,
    "shares": 8900,
    "accuracy": "documented",
    "historicalContext": "Lord Shaftesbury championed the Mines Act of 1842, which banned women and children under 10 from working underground. His investigations revealed horrific conditions - children worked in darkness for 14 hours pulling heavy coal carts.",
    "era": "industrial-revolution",
    "location": { "name": "Yorkshire Coalfield", "modern": "Yorkshire, England" }
  },
  {
    "id": "ind-022",
    "authorId": "domestic-servant",
    "type": "status",
    "content": "The master bought a new gas lamp for the drawing room. No more candles to trim! But cook says the smell gives her headaches. Progress, they call it. I just want Sunday afternoon off.",
    "timestamp": "1820-12-03T21:00:00Z",
    "displayDate": "December 3, 1820",
    "likes": 8760,
    "comments": 1230,
    "shares": 2340,
    "accuracy": "speculative",
    "historicalContext": "Gas lighting began to replace candles and oil lamps in wealthy homes during the 1810s-1820s. While revolutionary, gas lamps produced fumes and required careful handling. Domestic servants often worked 16+ hour days with minimal time off.",
    "era": "industrial-revolution",
    "location": { "name": "Manchester, England", "modern": "Manchester, England" }
  },
  {
    "id": "ind-023",
    "authorId": "james-watt",
    "type": "status",
    "content": "Boulton showed me the new foundry at Soho. We're making engines for mines, for mills, for anything that needs power. The patent runs until 1800. After that, who knows what the world will do with steam.",
    "timestamp": "1776-03-08T14:00:00Z",
    "displayDate": "March 8, 1776",
    "likes": 29870,
    "comments": 2340,
    "shares": 4560,
    "accuracy": "documented",
    "historicalContext": "The Boulton & Watt partnership transformed steam engine manufacturing. Their patent on the separate condenser (extended to 1800) gave them a virtual monopoly on efficient steam engines, which powered mines, factories, and later transportation.",
    "era": "industrial-revolution",
    "location": { "name": "Soho, Birmingham", "modern": "Birmingham, England" }
  },
  {
    "id": "ind-024",
    "authorId": "cotton-mill-worker",
    "type": "status",
    "content": "The overlooker docked my pay again. Said I was too slow. My fingers are raw from piecing threads. Twelve hours and I've earned sixpence. My grandmother earned more spinning at home.",
    "timestamp": "1815-06-17T20:00:00Z",
    "displayDate": "June 17, 1815",
    "likes": 14560,
    "comments": 3450,
    "shares": 4560,
    "accuracy": "inferred",
    "historicalContext": "Factory workers, especially women and children, earned a fraction of what skilled craftspeople once made. Fines for lateness, 'bad work,' or machine breakage often reduced wages further. Many workers earned barely enough to survive.",
    "era": "industrial-revolution",
    "location": { "name": "Manchester, England", "modern": "Manchester, England" }
  },
  {
    "id": "ind-025",
    "authorId": "robert-owen",
    "type": "status",
    "content": "The Ten Hours Bill failed again. Parliament protects factory owners, not workers. They call me a radical. I call them blind. An exhausted worker is an inefficient worker. It's just mathematics.",
    "timestamp": "1819-06-30T17:00:00Z",
    "displayDate": "June 30, 1819",
    "likes": 23450,
    "comments": 3890,
    "shares": 5670,
    "accuracy": "documented",
    "historicalContext": "Robert Owen advocated for limiting the working day to 10 hours. The movement for the Ten Hours Bill began in 1830 but didn't succeed until 1847. Owen argued that shorter hours actually increased productivity and worker health.",
    "era": "industrial-revolution",
    "location": { "name": "London, England", "modern": "London, England" }
  },
  {
    "id": "ind-026",
    "authorId": "coal-miner",
    "type": "status",
    "content": "Twelve hours underground. Crawled through a seam eighteen inches high. Water dripping, candle flickering. Got the coal though. Always get the coal. That's what they pay us for.",
    "timestamp": "1820-02-28T18:30:00Z",
    "displayDate": "February 28, 1820",
    "likes": 11230,
    "comments": 2340,
    "shares": 3450,
    "accuracy": "inferred",
    "historicalContext": "Coal miners worked in horrific conditions - narrow seams, flooding, cave-ins, and explosive gases. Many seams were so narrow that miners worked lying down. Average life expectancy for miners was significantly lower than the general population.",
    "era": "industrial-revolution",
    "location": { "name": "Merthyr Tydfil, Wales", "modern": "Merthyr Tydfil, Wales" }
  },
  {
    "id": "ind-027",
    "authorId": "richard-arkwright",
    "type": "status",
    "content": "Cromford Mill is running day and night now. Three hundred workers. The water wheel never stops. We're making more cotton thread than all the spinners in England combined. This is just the beginning.",
    "timestamp": "1776-08-15T09:00:00Z",
    "displayDate": "August 15, 1776",
    "likes": 21340,
    "comments": 1890,
    "shares": 3450,
    "accuracy": "documented",
    "historicalContext": "Arkwright's Cromford Mill, opened in 1771, was the first successful water-powered cotton spinning factory. By 1776 it employed hundreds and operated continuously. Arkwright became immensely wealthy and was knighted in 1786.",
    "era": "industrial-revolution",
    "location": { "name": "Cromford, Derbyshire", "modern": "Cromford, Derbyshire, England" }
  },
  {
    "id": "ind-028",
    "authorId": "william-blake",
    "type": "status",
    "content": "The chimney sweeper's cry appalls. Little boys sent up flues, breathing soot, sometimes stuck and suffocating. This is what we've made of England. Heaven help us.",
    "timestamp": "1789-04-10T21:00:00Z",
    "displayDate": "April 10, 1789",
    "likes": 34560,
    "comments": 4560,
    "shares": 6780,
    "accuracy": "attributed",
    "historicalContext": "Blake's 'Songs of Innocence and Experience' included poems about chimney sweepers - young boys (some as young as 4) who climbed inside chimneys to clean them. Many suffered respiratory diseases, cancer, and death from getting stuck.",
    "era": "industrial-revolution",
    "location": { "name": "London, England", "modern": "London, England" }
  },
  {
    "id": "ind-029",
    "authorId": "george-stephenson",
    "type": "status",
    "content": "They laughed when I said locomotives could pull coal faster than horses. Called me an uneducated colliery man. I can barely read. But I can build engines. We'll see who's laughing.",
    "timestamp": "1814-07-25T15:00:00Z",
    "displayDate": "July 25, 1814",
    "likes": 28900,
    "comments": 2890,
    "shares": 4560,
    "accuracy": "inferred",
    "historicalContext": "George Stephenson built his first locomotive, Blücher, in 1814 for hauling coal. Despite his lack of formal education, his practical engineering skills revolutionized transportation. His Rocket of 1829 proved railways were the future.",
    "era": "industrial-revolution",
    "location": { "name": "Killingworth, Northumberland", "modern": "Killingworth, England" }
  },
  {
    "id": "ind-030",
    "authorId": "factory-child",
    "type": "status",
    "content": "Lost two fingers today. Got them caught in the spinning mule. The overlooker was angry about the blood on the cotton. Didn't even get to go home. Just wrapped my hand and kept working.",
    "timestamp": "1823-09-14T16:00:00Z",
    "displayDate": "September 14, 1823",
    "likes": 28760,
    "comments": 5670,
    "shares": 7890,
    "accuracy": "inferred",
    "historicalContext": "Injuries in textile mills were horrifyingly common. Children's small fingers were nimble for threading but easily caught in machinery. There was no compensation for injuries - workers who couldn't work simply weren't paid.",
    "era": "industrial-revolution",
    "location": { "name": "Manchester, England", "modern": "Manchester, England" }
  },
  {
    "id": "ind-031",
    "authorId": "josiah-wedgwood",
    "type": "status",
    "content": "Made the antislavery medallion today. 'Am I not a man and a brother?' The abolitionists wanted something everyone could wear. Pottery for a cause. My late friend Granville Sharp would be proud.",
    "timestamp": "1787-08-12T14:00:00Z",
    "displayDate": "August 12, 1787",
    "likes": 34560,
    "comments": 3450,
    "shares": 6780,
    "accuracy": "documented",
    "historicalContext": "Josiah Wedgwood designed the famous antislavery medallion in 1787, showing an enslaved man in chains asking 'Am I not a man and a brother?' It became one of the most reproduced images of the abolitionist movement.",
    "era": "industrial-revolution",
    "location": { "name": "Etruria, Staffordshire", "modern": "Stoke-on-Trent, England" }
  },
  {
    "id": "ind-032",
    "authorId": "michael-faraday",
    "type": "status",
    "content": "Sir Humphry hired me as his assistant after I attended his lectures. Me, a bookbinder's apprentice! I made notes from his lectures and sent them to him. He saw something. Now I get to work at the Royal Institution.",
    "timestamp": "1813-03-01T10:00:00Z",
    "displayDate": "March 1, 1813",
    "likes": 34560,
    "comments": 2890,
    "shares": 5670,
    "accuracy": "documented",
    "historicalContext": "Michael Faraday's journey from bookbinder's apprentice to renowned scientist began when he impressed Humphry Davy with detailed notes from his lectures. Davy hired him as an assistant, beginning one of history's greatest scientific careers.",
    "era": "industrial-revolution",
    "location": { "name": "Royal Institution, London", "modern": "London, England" }
  },
  {
    "id": "ind-033",
    "authorId": "railway-navvy",
    "type": "status",
    "content": "The locals hate us. Call us animals. We drink too much, they say. Well, try digging through solid rock for twelve hours and see if you don't need a drink. We're building their precious railway.",
    "timestamp": "1838-05-20T20:00:00Z",
    "displayDate": "May 20, 1838",
    "likes": 9870,
    "comments": 2340,
    "shares": 3450,
    "accuracy": "inferred",
    "historicalContext": "Railway navvies were often viewed with suspicion and hostility by local communities. Living in temporary camps, they had a reputation for drinking and fighting. Yet without them, Britain's railway network could never have been built.",
    "era": "industrial-revolution",
    "location": { "name": "Box Tunnel, Wiltshire", "modern": "Box, Wiltshire, England" }
  },
  {
    "id": "ind-034",
    "authorId": "isambard-brunel",
    "type": "status",
    "content": "Box Tunnel complete. Nearly two miles through solid rock. They said it was impossible. A hundred men died building it. But now trains will fly through the hill at sixty miles an hour.",
    "timestamp": "1841-06-30T12:00:00Z",
    "displayDate": "June 30, 1841",
    "likes": 45670,
    "comments": 4560,
    "shares": 7890,
    "accuracy": "documented",
    "historicalContext": "Box Tunnel on Brunel's Great Western Railway was the longest railway tunnel in the world when completed. Building it took five years and cost around 100 lives. It remains in use today.",
    "era": "industrial-revolution",
    "location": { "name": "Box, Wiltshire", "modern": "Box, Wiltshire, England" }
  },
  {
    "id": "ind-035",
    "authorId": "handloom-weaver",
    "type": "status",
    "content": "Broke my loom today. Smashed it to pieces. If I can't make a living from it, neither can anyone else. The constables came. Probably prison for me now. What does it matter?",
    "timestamp": "1812-04-16T22:00:00Z",
    "displayDate": "April 16, 1812",
    "likes": 15670,
    "comments": 3890,
    "shares": 4560,
    "accuracy": "inferred",
    "historicalContext": "During the Luddite uprisings of 1811-1816, desperate workers destroyed machinery they blamed for their poverty. Machine-breaking was made a capital offense in 1812. Many Luddites were hanged or transported to Australia.",
    "era": "industrial-revolution",
    "location": { "name": "Bolton, Lancashire", "modern": "Bolton, England" }
  },
  {
    "id": "ind-036",
    "authorId": "humphry-davy",
    "type": "status",
    "content": "Young Faraday is extraordinary. Better than me, I think. Not that I'd tell him that. Some discoveries I made first. But his work on electromagnetic rotation - that's pure genius.",
    "timestamp": "1821-12-10T19:00:00Z",
    "displayDate": "December 10, 1821",
    "likes": 23450,
    "comments": 2340,
    "shares": 4560,
    "accuracy": "attributed",
    "historicalContext": "The relationship between Davy and Faraday was complicated. Davy mentored Faraday but may have felt threatened by his brilliance. When asked about his greatest discovery, Davy allegedly replied 'Michael Faraday.'",
    "era": "industrial-revolution",
    "location": { "name": "Royal Institution, London", "modern": "London, England" }
  },
  {
    "id": "ind-037",
    "authorId": "domestic-servant",
    "type": "status",
    "content": "The mistress is hosting a party. That means polishing every piece of silver, scrubbing every floor, and standing ready until midnight. Then up at five tomorrow. At least there might be leftover cake.",
    "timestamp": "1825-12-20T07:00:00Z",
    "displayDate": "December 20, 1825",
    "likes": 6780,
    "comments": 1230,
    "shares": 2340,
    "accuracy": "speculative",
    "historicalContext": "Domestic servants made up the largest employment category in Victorian Britain. They worked long hours for low pay with little time off. Yet for working-class women, service was often preferable to factory work.",
    "era": "industrial-revolution",
    "location": { "name": "Manchester, England", "modern": "Manchester, England" }
  },
  {
    "id": "ind-038",
    "authorId": "lord-shaftesbury",
    "type": "status",
    "content": "The Factory Act passed. No child under nine may work in textile mills. Children nine to thirteen limited to eight hours. It's not enough. But it's a start. Parliament finally listened.",
    "timestamp": "1833-08-29T16:00:00Z",
    "displayDate": "August 29, 1833",
    "likes": 45670,
    "comments": 5670,
    "shares": 8900,
    "accuracy": "documented",
    "historicalContext": "The Factory Act of 1833 was a landmark in labor law. It set minimum age limits and maximum hours for child workers, and crucially, created factory inspectors to enforce the law. Further reforms would follow in 1844 and 1847.",
    "era": "industrial-revolution",
    "location": { "name": "London, England", "modern": "London, England" }
  },
  {
    "id": "ind-039",
    "authorId": "matthew-boulton",
    "type": "status",
    "content": "Watt worries too much. Always tinkering, never satisfied. I tell him - the engines work! Sell them! We have orders from half the mines in Cornwall. Let someone else make them perfect.",
    "timestamp": "1785-09-14T10:00:00Z",
    "displayDate": "September 14, 1785",
    "likes": 15670,
    "comments": 1890,
    "shares": 2890,
    "accuracy": "inferred",
    "historicalContext": "The partnership between the perfectionist engineer Watt and the practical businessman Boulton was highly successful but sometimes tense. Boulton pushed for sales and expansion while Watt focused on improvements and refinements.",
    "era": "industrial-revolution",
    "location": { "name": "Soho, Birmingham", "modern": "Birmingham, England" }
  },
  {
    "id": "ind-040",
    "authorId": "mary-shelley",
    "type": "status",
    "content": "Frankenstein published today. They put Percy's name in the preface so people assumed he wrote it. When they learn a woman wrote it, they'll either be impressed or horrified. Probably both.",
    "timestamp": "1818-01-01T12:00:00Z",
    "displayDate": "January 1, 1818",
    "likes": 56780,
    "comments": 5670,
    "shares": 12340,
    "accuracy": "documented",
    "historicalContext": "Frankenstein was published anonymously in 1818. The preface by Percy Shelley led many to assume he was the author. When Mary Shelley was revealed as the author, many were shocked that a 19-year-old woman had written such a dark, philosophical work.",
    "era": "industrial-revolution",
    "location": { "name": "London, England", "modern": "London, England" }
  },
  {
    "id": "ind-041",
    "authorId": "cotton-mill-worker",
    "type": "status",
    "content": "Peterloo. They charged us with cavalry. We came peacefully, asking for reform. Women and children cut down by sabres. Fifteen dead, hundreds wounded. This is what they think of working people.",
    "timestamp": "1819-08-16T15:00:00Z",
    "displayDate": "August 16, 1819",
    "likes": 45670,
    "comments": 6780,
    "shares": 12340,
    "accuracy": "documented",
    "historicalContext": "The Peterloo Massacre occurred when cavalry charged a peaceful crowd of 60,000 demanding parliamentary reform. 15 were killed and 400-700 injured. The name ironically referenced the Battle of Waterloo four years earlier.",
    "era": "industrial-revolution",
    "location": { "name": "St Peter's Field, Manchester", "modern": "Manchester, England" }
  },
  {
    "id": "ind-042",
    "authorId": "coal-miner",
    "type": "status",
    "content": "Got a Davy lamp now. Supposed to be safe. Still doesn't feel safe down there in the dark, water dripping, wondering if this is the day the roof comes down. But at least the lamp won't blow us up.",
    "timestamp": "1818-03-10T06:00:00Z",
    "displayDate": "March 10, 1818",
    "likes": 8760,
    "comments": 1890,
    "shares": 2340,
    "accuracy": "inferred",
    "historicalContext": "The Davy lamp reduced explosion deaths but mining remained extremely dangerous. Ironically, the lamp allowed mines to go deeper into more dangerous seams, potentially causing more deaths from other causes.",
    "era": "industrial-revolution",
    "location": { "name": "South Wales Coalfield", "modern": "Merthyr Tydfil, Wales" }
  },
  {
    "id": "ind-043",
    "authorId": "james-watt",
    "type": "status",
    "content": "Retiring at last. Boulton too. We've changed the world, I think. Every mine, every mill, every factory - our engines power them. Not bad for a man who started repairing instruments at Glasgow University.",
    "timestamp": "1800-01-05T14:00:00Z",
    "displayDate": "January 5, 1800",
    "likes": 34560,
    "comments": 3450,
    "shares": 5670,
    "accuracy": "inferred",
    "historicalContext": "Watt and Boulton retired in 1800 when their patent expired. By then, their steam engines powered industry across Britain and beyond. Watt continued inventing until his death in 1819.",
    "era": "industrial-revolution",
    "location": { "name": "Birmingham, England", "modern": "Birmingham, England" }
  },
  {
    "id": "ind-044",
    "authorId": "robert-owen",
    "type": "status",
    "content": "Leaving for America. Going to build a new community in Indiana. New Harmony, we'll call it. If Britain won't listen, perhaps America will. A society based on cooperation, not exploitation.",
    "timestamp": "1824-10-02T09:00:00Z",
    "displayDate": "October 2, 1824",
    "likes": 21340,
    "comments": 3450,
    "shares": 4560,
    "accuracy": "documented",
    "historicalContext": "Robert Owen bought the town of New Harmony, Indiana, in 1824 to create a utopian community. The experiment lasted only two years before internal conflicts caused it to fail, but it influenced later cooperative movements.",
    "era": "industrial-revolution",
    "location": { "name": "Liverpool, England", "modern": "Liverpool, England" }
  },
  {
    "id": "ind-045",
    "authorId": "george-stephenson",
    "type": "status",
    "content": "Liverpool to Manchester. First passenger railway in the world. Thousands came to watch. The Duke of Wellington opened it. This is only the beginning. Railways will connect every city in Britain.",
    "timestamp": "1830-09-15T10:00:00Z",
    "displayDate": "September 15, 1830",
    "likes": 56780,
    "comments": 5670,
    "shares": 9870,
    "accuracy": "documented",
    "historicalContext": "The Liverpool and Manchester Railway, opened September 15, 1830, was the world's first inter-city railway and first to rely entirely on steam power. Despite Huskisson's death that day, it was a commercial success that sparked railway mania.",
    "era": "industrial-revolution",
    "location": { "name": "Liverpool, England", "modern": "Liverpool, England" }
  },
  {
    "id": "ind-046",
    "authorId": "factory-child",
    "type": "status",
    "content": "Sunday. No work today. Went to Sunday school and learned some letters. Teacher says I'm clever. Doesn't matter though. Back to the mill tomorrow. Reading won't save me from the machines.",
    "timestamp": "1830-07-12T16:00:00Z",
    "displayDate": "July 12, 1830",
    "likes": 19870,
    "comments": 3890,
    "shares": 5670,
    "accuracy": "inferred",
    "historicalContext": "Sunday schools provided the only education many working-class children received. For factory children, Sunday was their only day off. Literacy rates improved throughout the era, though universal education wouldn't come until the 1870s.",
    "era": "industrial-revolution",
    "location": { "name": "Manchester, England", "modern": "Manchester, England" }
  },
  {
    "id": "ind-047",
    "authorId": "isambard-brunel",
    "type": "status",
    "content": "The Great Britain launched today. Iron hull, screw propeller, six masts. Biggest ship in the world. Everyone said iron wouldn't float. Look at her now.",
    "timestamp": "1843-07-19T11:00:00Z",
    "displayDate": "July 19, 1843",
    "likes": 45670,
    "comments": 4560,
    "shares": 8900,
    "accuracy": "documented",
    "historicalContext": "SS Great Britain was revolutionary - the first ocean-going ship with an iron hull and screw propeller. She was the largest ship afloat for several years. The ship survives today as a museum in Bristol.",
    "era": "industrial-revolution",
    "location": { "name": "Bristol, England", "modern": "Bristol, England" }
  },
  {
    "id": "ind-048",
    "authorId": "william-blake",
    "type": "status",
    "content": "To see a World in a Grain of Sand / And a Heaven in a Wild Flower. The factories can't touch this. They can darken the sky and poison the rivers, but they cannot kill imagination. They cannot kill the soul.",
    "timestamp": "1803-08-20T23:00:00Z",
    "displayDate": "August 20, 1803",
    "likes": 67890,
    "comments": 4560,
    "shares": 12340,
    "accuracy": "attributed",
    "historicalContext": "Blake's poetry represented a Romantic rejection of industrialization's dehumanizing effects. While factories transformed England, poets like Blake, Wordsworth, and Coleridge celebrated nature, imagination, and the human spirit.",
    "era": "industrial-revolution",
    "location": { "name": "Felpham, Sussex", "modern": "Felpham, West Sussex, England" }
  },
  {
    "id": "ind-049",
    "authorId": "eli-whitney",
    "type": "status",
    "content": "The musket contract for the government is almost done. Ten thousand muskets with interchangeable parts. Any piece fits any gun. They laughed at the idea. Who's laughing now?",
    "timestamp": "1809-01-15T14:00:00Z",
    "displayDate": "January 15, 1809",
    "likes": 21340,
    "comments": 2340,
    "shares": 3450,
    "accuracy": "documented",
    "historicalContext": "After the cotton gin, Whitney pioneered manufacturing with interchangeable parts. His musket contracts with the US government, while plagued by delays, helped establish the American system of manufacturing that would later revolutionize industry.",
    "era": "industrial-revolution",
    "location": { "name": "New Haven, Connecticut", "modern": "New Haven, Connecticut, USA" }
  },
  {
    "id": "ind-050",
    "authorId": "michael-faraday",
    "type": "status",
    "content": "The Christmas Lectures went well. Showed the children electric sparks and chemical reactions. Science should delight, not intimidate. If a bookbinder's apprentice can learn it, anyone can.",
    "timestamp": "1827-12-27T16:00:00Z",
    "displayDate": "December 27, 1827",
    "likes": 34560,
    "comments": 3450,
    "shares": 5670,
    "accuracy": "documented",
    "historicalContext": "Faraday's Royal Institution Christmas Lectures, begun in 1825, made science accessible to the public, especially children. The tradition continues today. Faraday gave nineteen series himself, including his famous 'Chemical History of a Candle.'",
    "era": "industrial-revolution",
    "location": { "name": "Royal Institution, London", "modern": "London, England" }
  }
]
