[
  {
    "id": "crusades-001",
    "authorId": "pope-urban-ii",
    "content": "Just gave the speech at Clermont. Everyone's crying, shouting DEUS VULT. Honestly wasn't expecting this reaction. I just wanted to help the Byzantines with their... Turkish problem. Now half of Europe wants to march to Jerusalem.",
    "displayDate": "November 27, 1095",
    "timestamp": "1095-11-27T15:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 892,
    "comments": 156,
    "shares": 234,
    "accuracy": "documented",
    "historicalContext": "Pope Urban II's speech at the Council of Clermont launched the First Crusade. His call to liberate Jerusalem and aid Byzantine Emperor Alexios I sparked a massive response across Western Europe.",
    "location": { "name": "Clermont, France" }
  },
  {
    "id": "crusades-002",
    "authorId": "richard-lionheart",
    "content": "Mother's running England while I'm here dying of fever outside Acre. Haven't seen home in years. Sometimes I forget what rain feels like. Not the scorching kind. The cold, English kind.",
    "displayDate": "August 1191",
    "timestamp": "1191-08-15T10:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 567,
    "comments": 89,
    "shares": 45,
    "accuracy": "inferred",
    "historicalContext": "Richard I spent only about 6 months of his 10-year reign in England. His mother Eleanor of Aquitaine acted as regent during his absence on the Third Crusade.",
    "location": { "name": "Acre, Palestine" }
  },
  {
    "id": "crusades-003",
    "authorId": "saladin",
    "content": "The Franks fight bravely, I'll give them that. But they don't understand this land. They wear full armor in summer. They build castles but don't know where the wells are. They'll learn. Or they won't.",
    "displayDate": "July 1187",
    "timestamp": "1187-07-01T14:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 723,
    "comments": 134,
    "shares": 89,
    "accuracy": "inferred",
    "historicalContext": "Saladin (Salah ad-Din) united Egypt and Syria and recaptured Jerusalem in 1187. He was known for his chivalry and military genius, earning respect even from his Crusader enemies.",
    "location": { "name": "Damascus, Syria" }
  },
  {
    "id": "crusades-004",
    "authorId": "crusader-knight",
    "content": "We took Jerusalem. I can't... I can't talk about what we did. I came to serve God. I'm not sure God was there today.",
    "displayDate": "July 15, 1099",
    "timestamp": "1099-07-15T18:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 234,
    "comments": 67,
    "shares": 23,
    "accuracy": "documented",
    "historicalContext": "The siege of Jerusalem in 1099 ended in a massacre. Crusaders killed thousands of Muslims and Jews in the city. Contemporary accounts describe blood running in the streets.",
    "location": { "name": "Jerusalem" }
  },
  {
    "id": "crusades-005",
    "authorId": "eleanor-aquitaine",
    "content": "Louis wants me to stay behind while he goes crusading. Louis can want many things. I'm going. Someone needs to make sure he doesn't get everyone killed.",
    "displayDate": "June 1147",
    "timestamp": "1147-06-11T09:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 678,
    "comments": 145,
    "shares": 89,
    "accuracy": "documented",
    "historicalContext": "Eleanor of Aquitaine accompanied her husband King Louis VII on the Second Crusade, one of few noblewomen to do so. The crusade was a disaster and contributed to their eventual divorce.",
    "location": { "name": "Paris, France" }
  },
  {
    "id": "crusades-006",
    "authorId": "templar-knight",
    "content": "Took my vows today. Poverty, chastity, obedience. No more taverns, no more women, no more silk shirts. Just prayer and sword. My mother cried. My father looked... proud? Or relieved he doesn't have to find me a wife.",
    "displayDate": "March 1150",
    "timestamp": "1150-03-20T11:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 345,
    "comments": 56,
    "shares": 34,
    "accuracy": "inferred",
    "historicalContext": "The Knights Templar, founded in 1119, combined monasticism with military service. Members took vows of poverty, chastity, and obedience while dedicating themselves to protecting Christian pilgrims.",
    "location": { "name": "Temple Mount, Jerusalem" }
  },
  {
    "id": "crusades-007",
    "authorId": "saladin",
    "content": "Jerusalem is ours again. No massacre. The Franks may leave peacefully if they pay the ransom. Some call me weak for this. I call it strength. We are not them.",
    "displayDate": "October 2, 1187",
    "timestamp": "1187-10-02T16:00:00Z",
    "era": "medieval-crusades",
    "type": "event",
    "likes": 1245,
    "comments": 234,
    "shares": 189,
    "accuracy": "verified",
    "historicalContext": "When Saladin retook Jerusalem in 1187, he allowed Christians to leave peacefully upon payment of ransom. Many who couldn't pay were freed anyway. This stood in stark contrast to the Crusader massacre of 1099.",
    "location": { "name": "Jerusalem" }
  },
  {
    "id": "crusades-008",
    "authorId": "byzantine-merchant",
    "content": "The Latins are back asking for more ships, more supplies, more money. They call us brothers in Christ but look at us like we're pagans because we pray in Greek. The Pope sent them. The Pope can pay for them.",
    "displayDate": "September 1203",
    "timestamp": "1203-09-15T12:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 234,
    "comments": 78,
    "shares": 23,
    "accuracy": "inferred",
    "historicalContext": "Relations between Western Crusaders and Byzantine Christians were often tense. The Fourth Crusade would soon sack Constantinople itself in 1204, a betrayal that shattered Christian unity.",
    "location": { "name": "Constantinople" }
  },
  {
    "id": "crusades-009",
    "authorId": "richard-lionheart",
    "content": "Met Saladin's brother today. Shared food, talked war, compared swords. If we weren't trying to kill each other, we might be friends. Strange thought.",
    "displayDate": "September 1191",
    "timestamp": "1191-09-08T18:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 567,
    "comments": 98,
    "shares": 67,
    "accuracy": "documented",
    "historicalContext": "Richard I and Saladin never met in person but exchanged gifts and respected each other. Richard did meet with Saladin's brother al-Adil (Saphadin) during negotiations.",
    "location": { "name": "Jaffa, Palestine" }
  },
  {
    "id": "crusades-010",
    "authorId": "hospital-nun",
    "content": "Forty wounded today. Running out of clean bandages. Running out of wine for washing wounds. Not running out of prayers but honestly wondering if anyone's listening.",
    "displayDate": "July 1191",
    "timestamp": "1191-07-20T21:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 189,
    "comments": 45,
    "shares": 12,
    "accuracy": "inferred",
    "historicalContext": "The Knights Hospitaller and various religious orders ran hospitals in the Crusader states. They provided care to wounded soldiers, pilgrims, and sometimes even Muslim patients.",
    "location": { "name": "Acre, Palestine" }
  },
  {
    "id": "crusades-011",
    "authorId": "frederick-barbarossa",
    "content": "Everyone said I was too old for crusade. I said nonsense, I've been fighting my whole life. Now my armor is too hot and my bones ache and I dream of German forests. But we press on.",
    "displayDate": "May 1190",
    "timestamp": "1190-05-18T08:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 456,
    "comments": 89,
    "shares": 45,
    "accuracy": "inferred",
    "historicalContext": "Frederick Barbarossa, Holy Roman Emperor, was nearly 70 when he led the German army on the Third Crusade. He would drown in the Saleph River in June 1190 before reaching the Holy Land.",
    "location": { "name": "Anatolia" }
  },
  {
    "id": "crusades-012",
    "authorId": "frederick-barbarossa",
    "content": "The river looks so cool. The armor is so heavy. The water is so inviting. Just a quick swim to cool down, then we march on.",
    "displayDate": "June 10, 1190",
    "timestamp": "1190-06-10T14:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 234,
    "comments": 156,
    "shares": 78,
    "accuracy": "documented",
    "historicalContext": "Frederick Barbarossa drowned in the Saleph River on June 10, 1190. Whether he fell from his horse, had a heart attack, or simply couldn't swim in his armor is still debated.",
    "location": { "name": "Saleph River, Anatolia" }
  },
  {
    "id": "crusades-013",
    "authorId": "crusader-peasant",
    "content": "They said Jerusalem. They said holy war. They didn't say three months of walking. They didn't say my shoes would fall apart in Hungary. My feet look like raw meat.",
    "displayDate": "July 1096",
    "timestamp": "1096-07-15T17:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 156,
    "comments": 34,
    "shares": 12,
    "accuracy": "inferred",
    "historicalContext": "The People's Crusade preceded the official First Crusade. Thousands of peasants and minor nobles marched across Europe, many dying of starvation or disease before even reaching Byzantine territory.",
    "location": { "name": "Hungary" }
  },
  {
    "id": "crusades-014",
    "authorId": "pope-urban-ii",
    "content": "Getting reports from the crusaders. Some good. Some... concerning. When I said take Jerusalem, I meant from the Turks. Not... not everyone on the way there.",
    "displayDate": "1096",
    "timestamp": "1096-08-01T10:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 234,
    "comments": 89,
    "shares": 34,
    "accuracy": "inferred",
    "historicalContext": "The Rhineland massacres of 1096 saw crusading mobs murder thousands of Jews in Germany and France. While some clergy tried to protect Jewish communities, others encouraged the violence.",
    "location": { "name": "Rome" }
  },
  {
    "id": "crusades-015",
    "authorId": "arab-physician",
    "content": "A Frankish knight brought me his sick friend today. I gave him good medicine. He gave me his horse. They're violent and crude but surprisingly generous when you save someone they love.",
    "displayDate": "1180",
    "timestamp": "1180-05-12T15:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 345,
    "comments": 67,
    "shares": 45,
    "accuracy": "inferred",
    "historicalContext": "Despite the warfare, cultural exchange occurred between Crusaders and Muslims. Arab medicine was generally more advanced, and Frankish nobles often sought treatment from Muslim physicians.",
    "location": { "name": "Acre, Palestine" }
  },
  {
    "id": "crusades-016",
    "authorId": "baldwin-iv",
    "content": "The doctors say the numbness will spread. They call it leprosy. They say I should abdicate. I'm sixteen. I'm King of Jerusalem. I will not abandon my kingdom to its enemies while I still breathe.",
    "displayDate": "1177",
    "timestamp": "1177-03-15T09:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 678,
    "comments": 123,
    "shares": 89,
    "accuracy": "documented",
    "historicalContext": "Baldwin IV became King of Jerusalem at 13, already showing signs of leprosy. Despite his illness, he personally led armies into battle and defeated Saladin at Montgisard in 1177.",
    "location": { "name": "Jerusalem" }
  },
  {
    "id": "crusades-017",
    "authorId": "baldwin-iv",
    "content": "Won at Montgisard today. Saladin's army scattered. I'm so tired I can barely hold a quill. Can't feel my hands anymore anyway. But we won. Today, we won.",
    "displayDate": "November 25, 1177",
    "timestamp": "1177-11-25T20:00:00Z",
    "era": "medieval-crusades",
    "type": "event",
    "likes": 789,
    "comments": 145,
    "shares": 123,
    "accuracy": "verified",
    "historicalContext": "The Battle of Montgisard was a stunning Crusader victory. The 16-year-old leper king led 500 knights against Saladin's 26,000-strong army and won decisively.",
    "location": { "name": "Montgisard, Palestine" }
  },
  {
    "id": "crusades-018",
    "authorId": "muslim-merchant",
    "content": "The Franks bought all my silk today. Paid well. Didn't try to convert me. Didn't insult my faith. Just... haggled. Like merchants. I can do business with that.",
    "displayDate": "1175",
    "timestamp": "1175-06-20T11:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 234,
    "comments": 45,
    "shares": 23,
    "accuracy": "inferred",
    "historicalContext": "Trade continued throughout the Crusades. Italian city-states maintained commercial relationships with both Crusader states and Muslim territories. Profit often transcended religious conflict.",
    "location": { "name": "Acre, Palestine" }
  },
  {
    "id": "crusades-019",
    "authorId": "eleanor-aquitaine",
    "content": "The heat. The dust. The interminable prayers. Louis prays for victory. I pray for a bath. Also possibly an annulment, but that's a longer conversation.",
    "displayDate": "1148",
    "timestamp": "1148-04-10T16:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 567,
    "comments": 98,
    "shares": 67,
    "accuracy": "inferred",
    "historicalContext": "Eleanor of Aquitaine's marriage to Louis VII deteriorated during the Second Crusade. They would eventually annul their marriage in 1152, and Eleanor would marry Henry II of England.",
    "location": { "name": "Antioch" }
  },
  {
    "id": "crusades-020",
    "authorId": "templar-knight",
    "content": "Lost four brothers at Hattin. Good men. The order says not to mourn, just pray. I'm doing both. I'm also sharpening my sword because I plan to discuss Hattin with Saladin personally.",
    "displayDate": "July 1187",
    "timestamp": "1187-07-06T21:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 345,
    "comments": 78,
    "shares": 34,
    "accuracy": "inferred",
    "historicalContext": "The Battle of Hattin (1187) was a catastrophic Crusader defeat. Saladin captured the True Cross and executed many Templar and Hospitaller knights, who had been his most formidable opponents.",
    "location": { "name": "Acre, Palestine" }
  },
  {
    "id": "crusades-021",
    "authorId": "richard-lionheart",
    "content": "Leaving tomorrow. Three years here and Jerusalem is still in Saracen hands. I can see it from the hills but I can't take it. Can't hold it. Going home feels like losing but staying means losing everything else.",
    "displayDate": "October 1192",
    "timestamp": "1192-10-09T06:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 456,
    "comments": 123,
    "shares": 67,
    "accuracy": "documented",
    "historicalContext": "Richard I negotiated a truce with Saladin in 1192, allowing Christian pilgrims access to Jerusalem while the city remained under Muslim control. Richard never reached Jerusalem itself.",
    "location": { "name": "Jaffa, Palestine" }
  },
  {
    "id": "crusades-022",
    "authorId": "byzantine-emperor",
    "content": "Asked Rome for help against the Turks. They sent an army. The army sacked Constantinople. My city. Our churches. Christian brothers, they called themselves. I have no words.",
    "displayDate": "April 1204",
    "timestamp": "1204-04-13T18:00:00Z",
    "era": "medieval-crusades",
    "type": "event",
    "likes": 678,
    "comments": 234,
    "shares": 156,
    "accuracy": "verified",
    "historicalContext": "The Fourth Crusade never reached the Holy Land. Instead, Crusaders sacked Constantinople in 1204, killing thousands of Christians and looting irreplaceable treasures. The Byzantine Empire never fully recovered.",
    "location": { "name": "Constantinople" }
  },
  {
    "id": "crusades-023",
    "authorId": "crusader-wife",
    "content": "Three years since Guillaume left. The children don't remember him. The crops need tending. The taxes still come. Everyone says I should be proud. I'm tired. I want my husband back or I want to stop waiting.",
    "displayDate": "1100",
    "timestamp": "1100-09-15T20:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 234,
    "comments": 67,
    "shares": 23,
    "accuracy": "inferred",
    "historicalContext": "Crusaders' wives often waited years for news. Many never returned. Women had to manage estates, raise children, and face legal complications if their husbands' fates remained unknown.",
    "location": { "name": "Burgundy, France" }
  },
  {
    "id": "crusades-024",
    "authorId": "saladin",
    "content": "Peace with the Franks. Richard leaves. My doctors say I'm dying. Maybe we both are, in our own ways. Strange to think I'll miss him.",
    "displayDate": "1192",
    "timestamp": "1192-10-15T14:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 567,
    "comments": 89,
    "shares": 78,
    "accuracy": "inferred",
    "historicalContext": "Saladin died in March 1193, just months after the Third Crusade ended. He had given away so much of his wealth to charity that there wasn't enough left to pay for his funeral.",
    "location": { "name": "Damascus, Syria" }
  },
  {
    "id": "crusades-025",
    "authorId": "venetian-doge",
    "content": "They couldn't pay for the ships. I suggested an alternative. Constantinople is rich. Constantinople is Orthodox. Constantinople is no longer a problem. Business is business.",
    "displayDate": "1203",
    "timestamp": "1203-06-23T10:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 189,
    "comments": 145,
    "shares": 56,
    "accuracy": "inferred",
    "historicalContext": "Doge Enrico Dandolo of Venice helped redirect the Fourth Crusade to Constantinople. Venice had commercial rivalries with Byzantium, and the crusaders' debt gave him leverage.",
    "location": { "name": "Venice" }
  },
  {
    "id": "crusades-026",
    "authorId": "children-crusade-boy",
    "content": "The priest says God will part the sea for us like Moses. We'll walk to Jerusalem. I'm scared but everyone's going. My mother cried. My father said I was a fool. Maybe they're right. But what if the priest is right?",
    "displayDate": "June 1212",
    "timestamp": "1212-06-15T08:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 156,
    "comments": 89,
    "shares": 34,
    "accuracy": "inferred",
    "historicalContext": "The Children's Crusade of 1212 saw thousands of young people march toward the Holy Land. Many died of starvation, turned back, or were reportedly sold into slavery. The sea did not part.",
    "location": { "name": "France" }
  },
  {
    "id": "crusades-027",
    "authorId": "hospital-nun",
    "content": "The pilgrims keep coming. Sunburned, dehydrated, robbed of everything by bandits. They expected streets of gold. They found desert and disease. We do what we can.",
    "displayDate": "1175",
    "timestamp": "1175-08-20T15:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 178,
    "comments": 34,
    "shares": 12,
    "accuracy": "inferred",
    "historicalContext": "Pilgrimage to Jerusalem was dangerous and expensive. The Hospitallers and Templars originally formed to protect and care for pilgrims, who faced bandits, disease, and harsh conditions.",
    "location": { "name": "Jerusalem" }
  },
  {
    "id": "crusades-028",
    "authorId": "arab-physician",
    "content": "The Frankish doctor tried to cure infection by cutting off the leg. The patient died. He tried to cure madness by cutting a cross into the skull. That patient died too. I'm starting to understand why they want our help.",
    "displayDate": "1180",
    "timestamp": "1180-11-05T14:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 345,
    "comments": 78,
    "shares": 56,
    "accuracy": "documented",
    "historicalContext": "Arab physician Usama ibn Munqidh documented stark differences between Frankish and Arab medicine. His memoirs describe Crusader medical practices with a mix of horror and dark humor.",
    "location": { "name": "Syria" }
  },
  {
    "id": "crusades-029",
    "authorId": "crusader-knight",
    "content": "Eight years since I left home. I've learned Arabic. I've learned to eat strange foods. I've learned that enemies can show mercy and allies can betray you. I'm not the same man who left Normandy.",
    "displayDate": "1107",
    "timestamp": "1107-03-12T10:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 234,
    "comments": 56,
    "shares": 34,
    "accuracy": "inferred",
    "historicalContext": "Many Crusaders who settled in the Levant adopted local customs, learned Arabic, and developed complex relationships with their Muslim neighbors. These 'Poulains' were sometimes looked down upon by new arrivals from Europe.",
    "location": { "name": "Kingdom of Jerusalem" }
  },
  {
    "id": "crusades-030",
    "authorId": "pope-urban-ii",
    "content": "Jerusalem has fallen. They did it. After three years. After so many dead. The Holy Sepulchre is ours. I wish I felt happier. The reports of what happened after... I need to pray.",
    "displayDate": "September 1099",
    "timestamp": "1099-09-01T09:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 456,
    "comments": 123,
    "shares": 89,
    "accuracy": "inferred",
    "historicalContext": "Pope Urban II died on July 29, 1099, just two weeks after Jerusalem fell. He never learned of the Crusaders' victory. The news took weeks to reach Rome.",
    "location": { "name": "Rome" }
  },
  {
    "id": "crusades-031",
    "authorId": "muslim-merchant",
    "content": "My grandfather traded with Byzantines. My father traded with Fatimids. I trade with Franks. Empires come and go. Spices and silk remain. Somehow I always find buyers.",
    "displayDate": "1185",
    "timestamp": "1185-04-18T11:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 267,
    "comments": 45,
    "shares": 23,
    "accuracy": "inferred",
    "historicalContext": "Trade routes persisted through wars and regime changes. Merchants from across the Mediterranean adapted to shifting powers, maintaining commercial networks that transcended religious and political boundaries.",
    "location": { "name": "Damascus, Syria" }
  },
  {
    "id": "crusades-032",
    "authorId": "templar-knight",
    "content": "The Grand Master says we're moving gold for the French king now. Banking, they call it. I joined to fight. Now I'm an accountant with a sword. The Lord works in mysterious ways.",
    "displayDate": "1220",
    "timestamp": "1220-07-14T09:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 289,
    "comments": 67,
    "shares": 45,
    "accuracy": "documented",
    "historicalContext": "The Knights Templar became medieval Europe's first international bankers. Their network of commanderies allowed pilgrims to deposit money in Europe and withdraw it in the Holy Land, reducing robbery risks.",
    "location": { "name": "Paris, France" }
  },
  {
    "id": "crusades-033",
    "authorId": "crusader-peasant",
    "content": "Died today. Dysentery. Not in battle. Not gloriously. Just... the water was bad. Three of us from my village gone this week. The priests say it's God's will. I say it's bad water.",
    "displayDate": "1098",
    "timestamp": "1098-08-03T05:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 134,
    "comments": 45,
    "shares": 12,
    "accuracy": "inferred",
    "historicalContext": "Disease killed far more Crusaders than combat. Dysentery, typhoid, and malaria devastated European armies unused to the climate and sanitation challenges of long campaigns in unfamiliar territory.",
    "location": { "name": "Antioch, Syria" }
  },
  {
    "id": "crusades-034",
    "authorId": "byzantine-merchant",
    "content": "The Latins burned the library. Centuries of knowledge. Homer. Aristotle. Medical texts. Maps. They couldn't read them anyway but they couldn't let us keep them either. Barbarians in silk.",
    "displayDate": "April 1204",
    "timestamp": "1204-04-15T12:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 456,
    "comments": 134,
    "shares": 89,
    "accuracy": "documented",
    "historicalContext": "The sack of Constantinople in 1204 destroyed countless manuscripts and works of art. The loss of knowledge and cultural treasures was immense, though some works were carried off to Venice and Western Europe.",
    "location": { "name": "Constantinople" }
  },
  {
    "id": "crusades-035",
    "authorId": "richard-lionheart",
    "content": "Captured. Ransomed. Imprisoned in Austria of all places. Leopold is still angry about that flag incident at Acre. A whole kingdom's treasury to get me home. Worth it? Ask me when I'm actually home.",
    "displayDate": "February 1193",
    "timestamp": "1193-02-04T10:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 567,
    "comments": 145,
    "shares": 89,
    "accuracy": "verified",
    "historicalContext": "Richard I was captured by Duke Leopold of Austria on his way home from the Crusade. The ransom of 150,000 marks of silver—roughly 35 tons—was an enormous sum that strained England's finances.",
    "location": { "name": "Dürnstein Castle, Austria" }
  },
  {
    "id": "crusades-036",
    "authorId": "eleanor-aquitaine",
    "content": "Seventy-three years old and riding across the Pyrenees to fetch my granddaughter for marriage. Some say I'm too old for this. Some can mind their own business. I'll rest when I'm dead.",
    "displayDate": "1200",
    "timestamp": "1200-01-15T08:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 789,
    "comments": 167,
    "shares": 134,
    "accuracy": "documented",
    "historicalContext": "Eleanor of Aquitaine crossed the Pyrenees at age 77 to fetch her granddaughter Blanche of Castile for marriage to the future Louis VIII. She remained politically active until her death in 1204.",
    "location": { "name": "Pyrenees Mountains" }
  },
  {
    "id": "crusades-037",
    "authorId": "acre-blacksmith",
    "content": "Fixed a Templar's sword yesterday. Frankish steel. Fixed a Mamluk's today. Damascus steel. They'll probably fight each other next week. They'll both come back for repairs. I get paid either way.",
    "displayDate": "1260",
    "timestamp": "1260-06-23T14:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 234,
    "comments": 56,
    "shares": 34,
    "accuracy": "inferred",
    "historicalContext": "Craftsmen in Crusader cities served diverse clienteles. The Crusader states became a place of cultural mixing, where European, Byzantine, Arab, and local Christian traditions intermingled.",
    "location": { "name": "Acre, Palestine" }
  },
  {
    "id": "crusades-038",
    "authorId": "crusader-wife",
    "content": "Letter from Guillaume. He's alive. He's coming home. After seven years. The children don't know him from a stranger. But he's alive. That's enough. That has to be enough.",
    "displayDate": "1104",
    "timestamp": "1104-05-20T16:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 345,
    "comments": 78,
    "shares": 45,
    "accuracy": "inferred",
    "historicalContext": "Many Crusaders who survived did eventually return home, though some remained in the East. Reunification with families after years of separation was often difficult, with returned crusaders sometimes finding their lands taken or their families changed.",
    "location": { "name": "Burgundy, France" }
  },
  {
    "id": "crusades-039",
    "authorId": "baldwin-iv",
    "content": "Can't grip a sword anymore. Can barely sit a horse. Named my nephew heir. I'm twenty-four years old and I'm dying. But Jerusalem still stands. While I breathe, Jerusalem stands.",
    "displayDate": "1185",
    "timestamp": "1185-02-10T20:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 678,
    "comments": 189,
    "shares": 145,
    "accuracy": "documented",
    "historicalContext": "Baldwin IV died in 1185 at age 24, having ruled Jerusalem for over a decade despite advanced leprosy. His death left the kingdom in the hands of less capable successors, leading to the disaster at Hattin.",
    "location": { "name": "Jerusalem" }
  },
  {
    "id": "crusades-040",
    "authorId": "saladin",
    "content": "They say I'm conquering for Islam. Some days I wonder if I'm just another warlord with better excuses. Then I pray. And keep fighting. What else can I do?",
    "displayDate": "1185",
    "timestamp": "1185-08-12T06:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 567,
    "comments": 123,
    "shares": 89,
    "accuracy": "inferred",
    "historicalContext": "Saladin unified Egypt and Syria through a combination of military conquest and political maneuvering. While celebrated as a holy warrior, he also fought many wars against fellow Muslims to consolidate power.",
    "location": { "name": "Damascus, Syria" }
  },
  {
    "id": "crusades-041",
    "authorId": "venetian-doge",
    "content": "I'm ninety years old and blind. Leading an army. Sacking cities. My enemies think I should be dead. I think they should try harder.",
    "displayDate": "April 1204",
    "timestamp": "1204-04-12T11:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 345,
    "comments": 89,
    "shares": 67,
    "accuracy": "documented",
    "historicalContext": "Enrico Dandolo, Doge of Venice, was over 90 and blind when he led the assault on Constantinople. He personally participated in the fighting, leading men from the front despite his age and disability.",
    "location": { "name": "Constantinople" }
  },
  {
    "id": "crusades-042",
    "authorId": "hospital-nun",
    "content": "A mother brought her baby today. Fever, won't eat. We have no medicine that will help. Sometimes prayer is all we have. Sometimes prayer isn't enough. I hate these days.",
    "displayDate": "1250",
    "timestamp": "1250-03-08T19:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 156,
    "comments": 45,
    "shares": 12,
    "accuracy": "inferred",
    "historicalContext": "Medieval medicine had severe limitations. Infant mortality was high across all societies. Hospital orders combined prayer with available medical knowledge, but many conditions remained untreatable.",
    "location": { "name": "Acre, Palestine" }
  },
  {
    "id": "crusades-043",
    "authorId": "arab-physician",
    "content": "The Frank asked why we wash our hands before surgery. I said the Prophet commands cleanliness. He laughed and said superstition. His patient died. Mine lived. Superstition, indeed.",
    "displayDate": "1175",
    "timestamp": "1175-09-14T13:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 456,
    "comments": 98,
    "shares": 67,
    "accuracy": "inferred",
    "historicalContext": "Islamic medical practice incorporated hygiene practices derived from religious requirements. These practices, not fully understood scientifically, often produced better outcomes than European medieval medicine.",
    "location": { "name": "Damascus, Syria" }
  },
  {
    "id": "crusades-044",
    "authorId": "frederick-barbarossa",
    "content": "They found my body in the river. My son is trying to preserve it in vinegar so I can be buried in Jerusalem. I appreciate the thought. I wish I could tell him it won't work.",
    "displayDate": "June 1190",
    "timestamp": "1190-06-12T08:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 234,
    "comments": 89,
    "shares": 45,
    "accuracy": "documented",
    "historicalContext": "After Barbarossa drowned, his son Frederick of Swabia tried to preserve his body in vinegar to fulfill his crusading vow. It didn't work. The flesh was buried in Antioch, the bones in Tyre.",
    "location": { "name": "Anatolia" }
  },
  {
    "id": "crusades-045",
    "authorId": "byzantine-emperor",
    "content": "Lost the city. Lost the throne. Wandering in exile while Latins sit in our palaces. We will return. Constantinople will be Roman again. Even if it takes decades. Even if I don't live to see it.",
    "displayDate": "1205",
    "timestamp": "1205-02-20T17:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 345,
    "comments": 89,
    "shares": 56,
    "accuracy": "inferred",
    "historicalContext": "Byzantine successor states in Nicaea, Trebizond, and Epirus preserved Roman traditions after 1204. The Nicaean Empire eventually recaptured Constantinople in 1261, restoring Byzantine rule.",
    "location": { "name": "Nicaea, Anatolia" }
  },
  {
    "id": "crusades-046",
    "authorId": "acre-blacksmith",
    "content": "The Mongols are coming, they say. Everyone's scared. I'm mostly curious. They need horses. Horses need shoes. Maybe I'll learn Mongol.",
    "displayDate": "1260",
    "timestamp": "1260-08-15T10:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 189,
    "comments": 45,
    "shares": 23,
    "accuracy": "inferred",
    "historicalContext": "The Mongol invasions reached the Middle East in the 1250s. In 1260, the Mamluks defeated the Mongols at Ain Jalut, one of the first major Mongol defeats and a turning point in world history.",
    "location": { "name": "Acre, Palestine" }
  },
  {
    "id": "crusades-047",
    "authorId": "children-crusade-boy",
    "content": "We reached the sea. It did not part. Some are turning back. Some got on ships. The ships went to Africa. I don't think they're going to Jerusalem. I should have listened to my father.",
    "displayDate": "August 1212",
    "timestamp": "1212-08-25T16:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 234,
    "comments": 78,
    "shares": 45,
    "accuracy": "inferred",
    "historicalContext": "The Children's Crusade ended in tragedy. Many children died on the journey, returned home, or—according to some accounts—were sold into slavery by merchants who promised them passage to the Holy Land.",
    "location": { "name": "Marseille, France" }
  },
  {
    "id": "crusades-048",
    "authorId": "muslim-merchant",
    "content": "Acre has fallen. The last Crusader city. Two hundred years of Franks in our land, and now it's over. My grandfather would have wept with joy. I mostly feel tired. And relieved. Mostly relieved.",
    "displayDate": "May 18, 1291",
    "timestamp": "1291-05-18T20:00:00Z",
    "era": "medieval-crusades",
    "type": "event",
    "likes": 567,
    "comments": 134,
    "shares": 89,
    "accuracy": "verified",
    "historicalContext": "The fall of Acre in 1291 ended the Crusader presence in the Holy Land. The Mamluks systematically destroyed the coastal cities to prevent future Crusader landings. The Crusader era was over.",
    "location": { "name": "Acre, Palestine" }
  },
  {
    "id": "crusades-049",
    "authorId": "templar-knight",
    "content": "Word came today. Acre has fallen. The Grand Master is dead. The Order is finished in the Holy Land. Two hundred years of fighting and dying for... for what? We're going back to France. What do old soldiers do when there's no more war?",
    "displayDate": "June 1291",
    "timestamp": "1291-06-01T09:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 345,
    "comments": 89,
    "shares": 56,
    "accuracy": "inferred",
    "historicalContext": "After Acre, the Templars retreated to Cyprus, then Europe. Without their original mission, they became targets. In 1307, Philip IV of France had them arrested on heresy charges and seized their wealth.",
    "location": { "name": "Cyprus" }
  },
  {
    "id": "crusades-050",
    "authorId": "crusader-knight",
    "content": "Home at last. The fields look the same. The church looks the same. But I'm not the same. I've seen too much. Done too much. The priest says confession will help. I've been confessing for a week. I'm not sure there's absolution for Jerusalem.",
    "displayDate": "1102",
    "timestamp": "1102-09-15T18:00:00Z",
    "era": "medieval-crusades",
    "type": "status",
    "likes": 278,
    "comments": 67,
    "shares": 34,
    "accuracy": "inferred",
    "historicalContext": "Many Crusaders returned home traumatized by their experiences. The Church promised spiritual rewards, but the psychological impact of prolonged violence and displacement lasted lifetimes.",
    "location": { "name": "Normandy, France" }
  }
]
