[
  {
    "id": "mj-001",
    "authorId": "emperor-meiji",
    "content": "The Charter Oath is proclaimed. We shall seek knowledge throughout the world. The evil customs of the past shall be broken off. All matters shall be decided by public discussion.",
    "displayDate": "April 6, 1868",
    "timestamp": "1868-04-06T10:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 567,
    "comments": 234,
    "shares": 445,
    "accuracy": "verified",
    "historicalContext": "The Charter Oath of April 1868 outlined the new Meiji government's principles: deliberative assemblies, unity of all classes, freedom of occupation, and seeking knowledge worldwide. It signaled Japan's commitment to modernization.",
    "location": { "name": "Kyoto, Japan", "coordinates": [35.0116, 135.7681] }
  },
  {
    "id": "mj-002",
    "authorId": "saigo-takamori",
    "content": "The Shogunate has fallen. The Emperor reigns again after 700 years. I have fought for this day. Now we must build a new Japan worthy of our ancestors.",
    "displayDate": "January 27, 1868",
    "timestamp": "1868-01-27T14:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 456,
    "comments": 189,
    "shares": 345,
    "accuracy": "attributed",
    "historicalContext": "Saigō Takamori was one of the key leaders who overthrew the Tokugawa Shogunate and restored imperial rule. He led Satsuma forces in the Boshin War that established the new Meiji government.",
    "location": { "name": "Kyoto, Japan", "coordinates": [35.0116, 135.7681] }
  },
  {
    "id": "mj-003",
    "authorId": "tokugawa-yoshinobu",
    "content": "I have surrendered power to the Emperor. 265 years of Tokugawa rule ends with me. Perhaps it is better this way. Japan must change or be devoured by the Western powers.",
    "displayDate": "November 9, 1867",
    "timestamp": "1867-11-09T16:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 345,
    "comments": 234,
    "shares": 189,
    "accuracy": "documented",
    "historicalContext": "Tokugawa Yoshinobu was the last Shogun of Japan. He voluntarily surrendered power in the Taisei Hōkan (restoration of imperial rule) in November 1867, hoping to maintain influence in the new government. Civil war followed anyway.",
    "location": { "name": "Edo Castle, Tokyo", "coordinates": [35.6852, 139.7528] }
  },
  {
    "id": "mj-004",
    "authorId": "okubo-toshimichi",
    "content": "We have seen the West. Their ships, their factories, their armies. We must learn everything they know, or Japan will become another China - carved up by foreigners.",
    "displayDate": "March 15, 1872",
    "timestamp": "1872-03-15T10:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 389,
    "comments": 178,
    "shares": 278,
    "accuracy": "attributed",
    "historicalContext": "Ōkubo Toshimichi was one of the 'Three Great Nobles' who led the Meiji Restoration. After traveling with the Iwakura Mission to America and Europe (1871-1873), he became convinced that rapid modernization was essential for Japan's survival.",
    "location": { "name": "Tokyo, Japan", "coordinates": [35.6762, 139.6503] }
  },
  {
    "id": "mj-005",
    "authorId": "fukuzawa-yukichi",
    "content": "Heaven does not create one man above or below another. Education is the path to equality. I have founded Keio to prove this - that any man can rise through learning.",
    "displayDate": "April 23, 1868",
    "timestamp": "1868-04-23T09:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 456,
    "comments": 234,
    "shares": 345,
    "accuracy": "verified",
    "historicalContext": "Fukuzawa Yukichi was Japan's most influential Meiji-era educator. His famous opening line 'Heaven does not create one man above another' challenged the rigid class system. He founded Keio University and promoted Western learning.",
    "location": { "name": "Tokyo, Japan", "coordinates": [35.6762, 139.6503] }
  },
  {
    "id": "mj-006",
    "authorId": "former-samurai",
    "content": "They have abolished our stipends. They have forbidden our swords. What am I now? A samurai without a sword is like a fish without water. How do I feed my family?",
    "displayDate": "March 28, 1876",
    "timestamp": "1876-03-28T08:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 345,
    "comments": 289,
    "shares": 189,
    "accuracy": "inferred",
    "historicalContext": "The Meiji government abolished samurai privileges in stages: stipends were converted to bonds (1876), and the Haitōrei edict (1876) banned wearing swords in public. Many samurai struggled to adapt to civilian life, some becoming police, teachers, or businessmen.",
    "location": { "name": "Kagoshima, Japan", "coordinates": [31.5969, 130.5571] }
  },
  {
    "id": "mj-007",
    "authorId": "saigo-takamori",
    "content": "The government has forgotten the warrior spirit that made Japan great. They worship Western money and machines. I will not bow to this corruption. If I must die as a samurai, so be it.",
    "displayDate": "February 15, 1877",
    "timestamp": "1877-02-15T06:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 567,
    "comments": 345,
    "shares": 456,
    "accuracy": "attributed",
    "historicalContext": "Saigō Takamori, once a hero of the Restoration, grew disillusioned with the new government's rapid Westernization. In 1877, he led the Satsuma Rebellion, the last stand of the samurai class against the modernizing state.",
    "location": { "name": "Kagoshima, Japan", "coordinates": [31.5969, 130.5571] }
  },
  {
    "id": "mj-008",
    "authorId": "emperor-meiji",
    "content": "Saigō Takamori is dead. He was a great man who loved Japan, even when he opposed us. Let him be remembered as a hero, not a rebel. His spirit lives on in our army.",
    "displayDate": "September 24, 1877",
    "timestamp": "1877-09-24T18:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 445,
    "comments": 289,
    "shares": 367,
    "accuracy": "attributed",
    "historicalContext": "Saigō Takamori died at the Battle of Shiroyama, the final battle of the Satsuma Rebellion. Despite being a rebel, Emperor Meiji posthumously pardoned him in 1889, and Saigō became a folk hero - 'the last true samurai.'",
    "location": { "name": "Tokyo, Japan", "coordinates": [35.6762, 139.6503] }
  },
  {
    "id": "mj-009",
    "authorId": "ito-hirobumi",
    "content": "The first railway is complete! From Tokyo to Yokohama in 53 minutes! The Emperor himself rode today. This is only the beginning - we will connect all of Japan by rail.",
    "displayDate": "October 14, 1872",
    "timestamp": "1872-10-14T12:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 567,
    "comments": 234,
    "shares": 445,
    "accuracy": "documented",
    "historicalContext": "Japan's first railway opened on October 14, 1872, connecting Tokyo (Shimbashi) to Yokohama. Built with British assistance, it symbolized Japan's rapid modernization. Emperor Meiji rode the inaugural train.",
    "location": { "name": "Tokyo-Yokohama Railway", "coordinates": [35.6652, 139.7580] }
  },
  {
    "id": "mj-010",
    "authorId": "japanese-farmer",
    "content": "They say we must send our children to school now. But who will work the fields? The new taxes are in money, not rice. Where do I get money? Everything is changing too fast.",
    "displayDate": "August 3, 1873",
    "timestamp": "1873-08-03T07:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 234,
    "comments": 189,
    "shares": 145,
    "accuracy": "inferred",
    "historicalContext": "The Meiji reforms hit farmers hard: land tax reform (1873) required payment in cash, not rice, forcing many into debt. Compulsory education (1872) took children from farm work. Many peasant uprisings occurred in the 1870s.",
    "location": { "name": "Niigata Prefecture, Japan", "coordinates": [37.9026, 139.0232] }
  },
  {
    "id": "mj-011",
    "authorId": "iwasaki-yataro",
    "content": "I have purchased the government's shipping line. They call it Mitsubishi - Three Diamonds. We will build ships, banks, mines. Japan needs zaibatsu to compete with the Western powers.",
    "displayDate": "February 1, 1875",
    "timestamp": "1875-02-01T10:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 345,
    "comments": 178,
    "shares": 234,
    "accuracy": "documented",
    "historicalContext": "Iwasaki Yatarō founded Mitsubishi in 1870. The government supported zaibatsu (industrial conglomerates) to compete with Western firms. Mitsubishi grew from shipping into banking, mining, and shipbuilding, becoming one of Japan's largest conglomerates.",
    "location": { "name": "Tokyo, Japan", "coordinates": [35.6762, 139.6503] }
  },
  {
    "id": "mj-012",
    "authorId": "shibusawa-eiichi",
    "content": "Commerce is not shameful. The Analects and the abacus can work together. I have helped create over 500 companies. A strong economy makes a strong nation.",
    "displayDate": "June 15, 1880",
    "timestamp": "1880-06-15T14:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 389,
    "comments": 167,
    "shares": 278,
    "accuracy": "attributed",
    "historicalContext": "Shibusawa Eiichi is called the 'father of Japanese capitalism.' A former samurai, he helped establish Japan's banking system and founded hundreds of companies. His philosophy of 'Rongo to Soroban' (Confucian ethics with business) shaped Japanese corporate culture.",
    "location": { "name": "Tokyo, Japan", "coordinates": [35.6762, 139.6503] }
  },
  {
    "id": "mj-013",
    "authorId": "ito-hirobumi",
    "content": "The Constitution is complete. Japan is now a constitutional monarchy like Prussia. The Emperor is sacred and inviolable. The Diet will have real power. We join the civilized nations.",
    "displayDate": "February 11, 1889",
    "timestamp": "1889-02-11T11:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 567,
    "comments": 345,
    "shares": 456,
    "accuracy": "documented",
    "historicalContext": "The Meiji Constitution, promulgated February 11, 1889, established Japan as a constitutional monarchy. Drafted primarily by Itō Hirobumi after studying European systems, it remained in effect until 1947. The Diet (parliament) was created, though the Emperor retained significant power.",
    "location": { "name": "Imperial Palace, Tokyo", "coordinates": [35.6852, 139.7528] }
  },
  {
    "id": "mj-014",
    "authorId": "empress-shoken",
    "content": "The women of Japan must also modernize. I have established the Red Cross Society. I have promoted girls' education. We are not merely ornaments - we are the soul of the nation.",
    "displayDate": "May 20, 1887",
    "timestamp": "1887-05-20T10:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 345,
    "comments": 234,
    "shares": 189,
    "accuracy": "attributed",
    "historicalContext": "Empress Shōken (consort of Emperor Meiji) promoted women's education, the Red Cross, and charitable works. She established schools for women and was an important symbol of female participation in modernization, though within traditional frameworks.",
    "location": { "name": "Tokyo, Japan", "coordinates": [35.6762, 139.6503] }
  },
  {
    "id": "mj-015",
    "authorId": "tsuda-umeko",
    "content": "I returned from America after eleven years. I was six when I left. Now I see Japan with new eyes - so much potential, yet women are still treated as children. I will change this through education.",
    "displayDate": "November 18, 1882",
    "timestamp": "1882-11-18T15:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 389,
    "comments": 178,
    "shares": 267,
    "accuracy": "attributed",
    "historicalContext": "Tsuda Umeko was sent to America at age 6 as one of the first Japanese female exchange students. She returned to found Tsuda University for women. Her image now appears on the 5,000 yen note.",
    "location": { "name": "Tokyo, Japan", "coordinates": [35.6762, 139.6503] }
  },
  {
    "id": "mj-016",
    "authorId": "yamagata-aritomo",
    "content": "The conscript army has defeated the samurai at Shiroyama. Peasants with rifles beat warriors with swords. This proves our reforms are correct. The modern army is the strength of Japan.",
    "displayDate": "September 25, 1877",
    "timestamp": "1877-09-25T08:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 345,
    "comments": 267,
    "shares": 189,
    "accuracy": "attributed",
    "historicalContext": "Yamagata Aritomo was the 'father of the Japanese army.' The Satsuma Rebellion's defeat proved that a conscript army of commoners could beat samurai warriors. Yamagata built Japan's modern military and later served as Prime Minister twice.",
    "location": { "name": "Tokyo, Japan", "coordinates": [35.6762, 139.6503] }
  },
  {
    "id": "mj-017",
    "authorId": "japanese-student",
    "content": "I am studying in Germany now. The laboratories, the universities, the precision! Japan has much to learn. When I return, I will teach everything I've discovered.",
    "displayDate": "April 10, 1886",
    "timestamp": "1886-04-10T14:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 234,
    "comments": 145,
    "shares": 178,
    "accuracy": "inferred",
    "historicalContext": "The Meiji government sent thousands of students abroad to study Western technology, medicine, law, and military science. Germany was particularly popular for medicine and military studies. These students returned to modernize Japan's institutions.",
    "location": { "name": "Berlin, Germany", "coordinates": [52.5200, 13.4050] }
  },
  {
    "id": "mj-018",
    "authorId": "meiji-factory-worker",
    "content": "Twelve hours in the silk mill. My fingers bleed from the thread. They say we build Japan's future. But my lungs hurt and the foreman beats the slow ones. Is this progress?",
    "displayDate": "July 22, 1890",
    "timestamp": "1890-07-22T19:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 289,
    "comments": 234,
    "shares": 145,
    "accuracy": "inferred",
    "historicalContext": "Industrialization brought harsh conditions to Japanese workers, especially young women in textile mills. Silk was Japan's main export. Factory laws for worker protection didn't come until 1911, after decades of exploitation.",
    "location": { "name": "Tomioka, Gunma", "coordinates": [36.2559, 138.8912] }
  },
  {
    "id": "mj-019",
    "authorId": "meiji-geisha",
    "content": "The foreigners come to see us now. They think we are all Japan. But Japan is factories and railways and warships. We are the old world they pay to forget the new.",
    "displayDate": "September 3, 1895",
    "timestamp": "1895-09-03T20:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 234,
    "comments": 178,
    "shares": 123,
    "accuracy": "inferred",
    "historicalContext": "As Japan modernized, traditional arts like geisha culture became tourist attractions and symbols of 'old Japan.' The tension between tradition and modernity defined the Meiji era.",
    "location": { "name": "Kyoto, Japan", "coordinates": [35.0116, 135.7681] }
  },
  {
    "id": "mj-020",
    "authorId": "ito-hirobumi",
    "content": "The unequal treaties are revised at last! After 40 years, Japan is recognized as an equal. No more extraterritoriality for foreigners. We have joined the community of civilized nations.",
    "displayDate": "July 16, 1899",
    "timestamp": "1899-07-16T10:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 456,
    "comments": 234,
    "shares": 345,
    "accuracy": "documented",
    "historicalContext": "The 'unequal treaties' imposed on Japan after Perry's arrival (1854) gave foreigners extraterritorial rights and tariff control. Treaty revision was a major Meiji goal, finally achieved in 1899 after Japan proved itself 'civilized' through modernization.",
    "location": { "name": "Tokyo, Japan", "coordinates": [35.6762, 139.6503] }
  },
  {
    "id": "mj-021",
    "authorId": "mutsu-munemitsu",
    "content": "China has refused our terms. Korea will be ours to protect. The great Qing Empire that we once admired - how hollow it has become. Japan will not be another China.",
    "displayDate": "August 1, 1894",
    "timestamp": "1894-08-01T09:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 345,
    "comments": 267,
    "shares": 234,
    "accuracy": "attributed",
    "historicalContext": "Mutsu Munemitsu was Foreign Minister during the First Sino-Japanese War (1894-1895). Japan's decisive victory shocked the world and established Japan as a regional power. China ceded Taiwan and recognized Korean independence.",
    "location": { "name": "Tokyo, Japan", "coordinates": [35.6762, 139.6503] }
  },
  {
    "id": "mj-022",
    "authorId": "togo-heihachiro",
    "content": "The Chinese fleet is destroyed at the Yalu. Our training, our discipline, our modern ships - all proven superior. Japan has announced itself to the world as a naval power.",
    "displayDate": "September 17, 1894",
    "timestamp": "1894-09-17T18:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 456,
    "comments": 234,
    "shares": 345,
    "accuracy": "documented",
    "historicalContext": "Admiral Tōgō Heihachirō participated in the Battle of the Yalu River, where Japan's modern navy destroyed China's Beiyang Fleet. This victory demonstrated the success of Japan's military modernization.",
    "location": { "name": "Yellow Sea", "coordinates": [39.5000, 124.0000] }
  },
  {
    "id": "mj-023",
    "authorId": "japanese-soldier-meiji",
    "content": "We march through Korea to fight the Chinese. The people here look at us strangely. Are we liberators or conquerors? I only know I must bring honor to Japan and my family.",
    "displayDate": "September 5, 1894",
    "timestamp": "1894-09-05T07:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 234,
    "comments": 178,
    "shares": 145,
    "accuracy": "inferred",
    "historicalContext": "Japanese soldiers fought through Korea during the Sino-Japanese War. Japan presented itself as liberating Korea from Chinese influence, but would annex Korea outright in 1910.",
    "location": { "name": "Korea", "coordinates": [37.5665, 126.9780] }
  },
  {
    "id": "mj-024",
    "authorId": "emperor-meiji",
    "content": "The Triple Intervention forces us to return the Liaodong Peninsula. Russia, France, Germany - they take what we won with blood. We will remember this humiliation.",
    "displayDate": "May 10, 1895",
    "timestamp": "1895-05-10T14:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 345,
    "comments": 289,
    "shares": 234,
    "accuracy": "attributed",
    "historicalContext": "After winning the Sino-Japanese War, Japan was forced by Russia, France, and Germany to return the Liaodong Peninsula to China. This 'Triple Intervention' humiliated Japan and fueled anti-Russian sentiment that led to the Russo-Japanese War.",
    "location": { "name": "Tokyo, Japan", "coordinates": [35.6762, 139.6503] }
  },
  {
    "id": "mj-025",
    "authorId": "yamagata-aritomo",
    "content": "Russia expands into Manchuria and eyes Korea. They think we are a small island nation they can ignore. They are wrong. In ten years, we will be ready to face them.",
    "displayDate": "January 15, 1900",
    "timestamp": "1900-01-15T10:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 345,
    "comments": 234,
    "shares": 189,
    "accuracy": "attributed",
    "historicalContext": "Russia's expansion into Manchuria and Korea threatened Japanese interests. Japan prepared methodically for war, signing the Anglo-Japanese Alliance (1902) to neutralize France and Germany if they intervened.",
    "location": { "name": "Tokyo, Japan", "coordinates": [35.6762, 139.6503] }
  },
  {
    "id": "mj-026",
    "authorId": "togo-heihachiro",
    "content": "Tonight we attack Port Arthur without declaration of war. The Russian fleet lies at anchor, unsuspecting. By dawn, they will know that Japan is to be feared.",
    "displayDate": "February 8, 1904",
    "timestamp": "1904-02-08T22:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 456,
    "comments": 345,
    "shares": 389,
    "accuracy": "documented",
    "historicalContext": "The Russo-Japanese War began with a surprise Japanese torpedo attack on the Russian Pacific Fleet at Port Arthur on February 8, 1904. Japan attacked before formally declaring war, a pattern repeated at Pearl Harbor.",
    "location": { "name": "Port Arthur, Manchuria", "coordinates": [38.8500, 121.2500] }
  },
  {
    "id": "mj-027",
    "authorId": "nogi-maresuke",
    "content": "Port Arthur has fallen after 11 months. 60,000 of my men are dead. Both my sons died on these hills. I will carry this guilt forever. But Japan has won.",
    "displayDate": "January 2, 1905",
    "timestamp": "1905-01-02T10:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 345,
    "comments": 289,
    "shares": 234,
    "accuracy": "documented",
    "historicalContext": "General Nogi Maresuke led the brutal siege of Port Arthur. Both his sons died in the assault. He became a national hero but was tormented by guilt. He and his wife committed ritual suicide on the day of Emperor Meiji's funeral in 1912.",
    "location": { "name": "Port Arthur, Manchuria", "coordinates": [38.8500, 121.2500] }
  },
  {
    "id": "mj-028",
    "authorId": "togo-heihachiro",
    "content": "The Russian Baltic Fleet is destroyed at Tsushima. Eight battleships sunk, four captured. They sailed 18,000 miles to meet death. Japan commands the seas of Asia now.",
    "displayDate": "May 27, 1905",
    "timestamp": "1905-05-27T19:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 678,
    "comments": 456,
    "shares": 567,
    "accuracy": "verified",
    "historicalContext": "The Battle of Tsushima (May 27-28, 1905) was one of history's most decisive naval victories. Japan destroyed the Russian Baltic Fleet that had sailed from Europe. It was the first modern victory of an Asian power over a European one.",
    "location": { "name": "Tsushima Strait", "coordinates": [34.5000, 129.5000] }
  },
  {
    "id": "mj-029",
    "authorId": "emperor-meiji",
    "content": "The war is won. Russia sues for peace. The Western powers must now treat Japan as an equal. We have paid for this recognition in blood - 100,000 dead. May it be worth the price.",
    "displayDate": "September 5, 1905",
    "timestamp": "1905-09-05T12:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 456,
    "comments": 345,
    "shares": 389,
    "accuracy": "attributed",
    "historicalContext": "The Treaty of Portsmouth (September 5, 1905) ended the Russo-Japanese War. Japan gained the southern half of Sakhalin, Russian recognition of Japanese interests in Korea, and railway rights in Manchuria. But many Japanese felt the terms weren't worth the cost.",
    "location": { "name": "Tokyo, Japan", "coordinates": [35.6762, 139.6503] }
  },
  {
    "id": "mj-030",
    "authorId": "japanese-soldier-meiji",
    "content": "We won the war but where are the reparations? 100,000 dead and no indemnity? The people riot in the streets of Tokyo. Was it all for nothing?",
    "displayDate": "September 6, 1905",
    "timestamp": "1905-09-06T18:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 234,
    "comments": 189,
    "shares": 145,
    "accuracy": "documented",
    "historicalContext": "The Hibiya Riots erupted when Japan failed to win war indemnities from Russia. Japanese civilians, exhausted by wartime sacrifices, were outraged. The government declared martial law - a sign that Japanese nationalism was outpacing its leaders.",
    "location": { "name": "Tokyo, Japan", "coordinates": [35.6762, 139.6503] }
  },
  {
    "id": "mj-031",
    "authorId": "ito-hirobumi",
    "content": "Korea is now a Japanese protectorate. I will serve as Resident-General to guide them toward civilization. They resist, but in time they will understand this is for their own good.",
    "displayDate": "December 21, 1905",
    "timestamp": "1905-12-21T10:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 234,
    "comments": 345,
    "shares": 189,
    "accuracy": "documented",
    "historicalContext": "After the Russo-Japanese War, Japan made Korea a protectorate. Itō Hirobumi became the first Resident-General, essentially ruling Korea. He was assassinated by a Korean nationalist in 1909, accelerating Japan's decision to annex Korea entirely.",
    "location": { "name": "Seoul, Korea", "coordinates": [37.5665, 126.9780] }
  },
  {
    "id": "mj-032",
    "authorId": "ahn-jung-geun",
    "content": "Itō Hirobumi is dead by my hand. He stole our nation's sovereignty. I am a Korean patriot, not an assassin. Korea will be free.",
    "displayDate": "October 26, 1909",
    "timestamp": "1909-10-26T09:30:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 389,
    "comments": 456,
    "shares": 345,
    "accuracy": "documented",
    "historicalContext": "An Jung-geun, a Korean independence activist, assassinated Itō Hirobumi at Harbin railway station. An is a hero in Korea, a terrorist in Japan. His act accelerated Japan's annexation of Korea in 1910.",
    "location": { "name": "Harbin, China", "coordinates": [45.8038, 126.5350] }
  },
  {
    "id": "mj-033",
    "authorId": "emperor-meiji",
    "content": "Korea is annexed. It is now part of Japan. The Emperor of Korea has abdicated. We call it 'Chōsen' now. Some call this empire-building. I call it survival.",
    "displayDate": "August 29, 1910",
    "timestamp": "1910-08-29T12:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 345,
    "comments": 389,
    "shares": 234,
    "accuracy": "documented",
    "historicalContext": "Japan formally annexed Korea on August 29, 1910, ending 500 years of the Joseon dynasty. Korean resistance was suppressed, the Korean language was discouraged, and Japanese colonization would last until 1945.",
    "location": { "name": "Tokyo, Japan", "coordinates": [35.6762, 139.6503] }
  },
  {
    "id": "mj-034",
    "authorId": "fukuzawa-yukichi",
    "content": "I am old now. I have seen Japan transform from a feudal backwater to a world power in my lifetime. 'Civilization and Enlightenment' - we achieved it. But at what cost to our souls?",
    "displayDate": "January 15, 1901",
    "timestamp": "1901-01-15T10:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 289,
    "comments": 234,
    "shares": 178,
    "accuracy": "attributed",
    "historicalContext": "Fukuzawa Yukichi died in 1901. He lived to see Japan become a modern power, defeating China and revising the unequal treaties. His phrase 'bunmei kaika' (civilization and enlightenment) defined the Meiji era's goal.",
    "location": { "name": "Tokyo, Japan", "coordinates": [35.6762, 139.6503] }
  },
  {
    "id": "mj-035",
    "authorId": "meiji-journalist",
    "content": "The newspapers multiply. Anyone can read now - the literacy rate approaches 90%. Ideas spread faster than the government can control. Democracy whispers in the streets.",
    "displayDate": "March 8, 1907",
    "timestamp": "1907-03-08T14:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 234,
    "comments": 178,
    "shares": 145,
    "accuracy": "inferred",
    "historicalContext": "Meiji Japan achieved near-universal literacy through compulsory education. Newspapers, magazines, and books spread new ideas. While the government censored political content, literacy empowered the growing middle class.",
    "location": { "name": "Tokyo, Japan", "coordinates": [35.6762, 139.6503] }
  },
  {
    "id": "mj-036",
    "authorId": "kotoku-shusui",
    "content": "The Emperor is a symbol they use to enslave us. Capitalism and imperialism are the real enemies. Japan's workers must unite! They will hang me for saying this, but truth cannot be killed.",
    "displayDate": "May 25, 1910",
    "timestamp": "1910-05-25T16:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 178,
    "comments": 234,
    "shares": 123,
    "accuracy": "attributed",
    "historicalContext": "Kōtoku Shūsui was a leading anarchist and socialist who opposed the emperor system and imperialism. He was executed in 1911 for allegedly plotting to assassinate the Emperor - the 'Great Treason Incident.' Many historians believe he was framed.",
    "location": { "name": "Tokyo, Japan", "coordinates": [35.6762, 139.6503] }
  },
  {
    "id": "mj-037",
    "authorId": "meiji-factory-worker",
    "content": "The Factory Law passes at last! No more children under 12 in the factories. Maximum 12 hours work. It's not enough, but it's a start. The workers have a voice now.",
    "displayDate": "March 29, 1911",
    "timestamp": "1911-03-29T18:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 234,
    "comments": 189,
    "shares": 145,
    "accuracy": "documented",
    "historicalContext": "Japan's first Factory Law (1911) set minimum standards for workers: minimum age 12, maximum 12-hour day, and some safety regulations. It was weak and poorly enforced, but marked the beginning of labor protection in Japan.",
    "location": { "name": "Osaka, Japan", "coordinates": [34.6937, 135.5023] }
  },
  {
    "id": "mj-038",
    "authorId": "shibusawa-eiichi",
    "content": "I have helped create 500 companies, banks, railways, and mills. But business without ethics is poison. Japan must be great, but it must also be good. I wonder if we remember that.",
    "displayDate": "November 11, 1909",
    "timestamp": "1909-11-11T10:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 345,
    "comments": 234,
    "shares": 189,
    "accuracy": "attributed",
    "historicalContext": "Shibusawa Eiichi advocated for ethical capitalism throughout his life. He helped establish Japan's first modern bank, first stock exchange, and many industries, but also promoted social welfare and education.",
    "location": { "name": "Tokyo, Japan", "coordinates": [35.6762, 139.6503] }
  },
  {
    "id": "mj-039",
    "authorId": "emperor-meiji",
    "content": "I am tired. Forty-four years on the throne. I have seen Japan remade. Feudalism is gone. We defeated China and Russia. We have an empire. But I feel my strength fading.",
    "displayDate": "January 1, 1912",
    "timestamp": "1912-01-01T08:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 345,
    "comments": 289,
    "shares": 234,
    "accuracy": "inferred",
    "historicalContext": "Emperor Meiji's health declined in his final years. He had reigned since 1867, presiding over Japan's transformation from feudal isolation to modern empire. He died on July 30, 1912.",
    "location": { "name": "Tokyo, Japan", "coordinates": [35.6762, 139.6503] }
  },
  {
    "id": "mj-040",
    "authorId": "nogi-maresuke",
    "content": "The Emperor is dead. The Meiji era ends. I have served him all my life. Now I will follow him in the old way. My wife understands. Japan will think this is madness. It is loyalty.",
    "displayDate": "September 13, 1912",
    "timestamp": "1912-09-13T18:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 389,
    "comments": 345,
    "shares": 289,
    "accuracy": "documented",
    "historicalContext": "General Nogi Maresuke and his wife committed junshi (ritual suicide following one's lord's death) on the day of Emperor Meiji's funeral. His act shocked modern Japan but also renewed interest in samurai values - foreshadowing the militarism to come.",
    "location": { "name": "Tokyo, Japan", "coordinates": [35.6762, 139.6503] }
  },
  {
    "id": "mj-041",
    "authorId": "japanese-farmer",
    "content": "The old Emperor is dead. My grandfather remembers when he was young. Everything has changed - railways, factories, wars. Will things finally settle down, or is this just the beginning?",
    "displayDate": "July 31, 1912",
    "timestamp": "1912-07-31T10:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 189,
    "comments": 145,
    "shares": 123,
    "accuracy": "inferred",
    "historicalContext": "Emperor Meiji's death marked the end of an era. The next 33 years (Taishō and early Shōwa periods) would see democracy's brief flowering, then militarism, then war with China and the West.",
    "location": { "name": "Rural Japan", "coordinates": [36.2048, 138.2529] }
  },
  {
    "id": "mj-042",
    "authorId": "former-samurai",
    "content": "I have become a businessman. My sword hangs on the wall. My grandson laughs at the old ways. But when General Nogi died like a samurai, I understood - some traditions never truly die.",
    "displayDate": "September 14, 1912",
    "timestamp": "1912-09-14T09:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 234,
    "comments": 189,
    "shares": 145,
    "accuracy": "inferred",
    "historicalContext": "Nogi's suicide sparked debate about tradition vs. modernity. To some, he was heroic; to others, a relic. The tension between old samurai values and modern civilization would shape Japan for decades.",
    "location": { "name": "Tokyo, Japan", "coordinates": [35.6762, 139.6503] }
  },
  {
    "id": "mj-043",
    "authorId": "tsuda-umeko",
    "content": "My school grows. More girls come each year to learn English, to think freely. The future belongs to educated women. Japan's modernization is incomplete without us.",
    "displayDate": "April 5, 1905",
    "timestamp": "1905-04-05T14:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 289,
    "comments": 178,
    "shares": 189,
    "accuracy": "attributed",
    "historicalContext": "Tsuda founded Joshi Eigaku Juku (now Tsuda University) in 1900 to provide women with English education and critical thinking skills. Despite social resistance, she persisted in promoting women's education.",
    "location": { "name": "Tokyo, Japan", "coordinates": [35.6762, 139.6503] }
  },
  {
    "id": "mj-044",
    "authorId": "empress-shoken",
    "content": "The Red Cross grows. In war, we cared for Japanese and Russian wounded alike. Civilization means humanity for all. Even enemies deserve mercy when they bleed.",
    "displayDate": "October 2, 1905",
    "timestamp": "1905-10-02T10:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 345,
    "comments": 234,
    "shares": 189,
    "accuracy": "attributed",
    "historicalContext": "Empress Shōken championed the Red Cross and humanitarian treatment of POWs. Japan's relatively humane treatment of Russian prisoners during the Russo-Japanese War won international praise and helped legitimize Japan as a 'civilized' nation.",
    "location": { "name": "Tokyo, Japan", "coordinates": [35.6762, 139.6503] }
  },
  {
    "id": "mj-045",
    "authorId": "meiji-journalist",
    "content": "I have covered wars in China, Korea, Manchuria. Japan wins every battle. But what happens when we run out of enemies? What happens when the army has more power than the Diet?",
    "displayDate": "December 1, 1910",
    "timestamp": "1910-12-01T16:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 234,
    "comments": 189,
    "shares": 145,
    "accuracy": "inferred",
    "historicalContext": "Some Meiji-era observers worried about rising militarism. The constitution gave the military direct access to the emperor, bypassing civilian control. This structural flaw would lead to military domination in the 1930s.",
    "location": { "name": "Tokyo, Japan", "coordinates": [35.6762, 139.6503] }
  },
  {
    "id": "mj-046",
    "authorId": "okakura-tenshin",
    "content": "We worship the West and forget our own beauty. Japanese art, tea ceremony, flower arranging - these are not backward. They are what make us Japanese. Asia must remember its soul.",
    "displayDate": "May 15, 1906",
    "timestamp": "1906-05-15T15:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 289,
    "comments": 178,
    "shares": 189,
    "accuracy": "attributed",
    "historicalContext": "Okakura Kakuzō (Tenshin) promoted the preservation of traditional Japanese and Asian art during the rush to Westernize. His 'Book of Tea' introduced Japanese aesthetics to the West. He helped found the Tokyo National Museum.",
    "location": { "name": "Tokyo, Japan", "coordinates": [35.6762, 139.6503] }
  },
  {
    "id": "mj-047",
    "authorId": "meiji-factory-worker",
    "content": "The Ashio Copper Mine poisons the river. Fish die. Crops fail. The company says it's progress. The farmers say it's murder. Who listens to the poor against the zaibatsu?",
    "displayDate": "February 24, 1897",
    "timestamp": "1897-02-24T08:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 189,
    "comments": 145,
    "shares": 123,
    "accuracy": "documented",
    "historicalContext": "The Ashio Copper Mine pollution was Japan's first major environmental disaster. Tanaka Shōzō, a politician, fought for the victims for decades. The case showed the dark side of rapid industrialization.",
    "location": { "name": "Ashio, Tochigi", "coordinates": [36.6200, 139.4500] }
  },
  {
    "id": "mj-048",
    "authorId": "japanese-student",
    "content": "I study law in Tokyo now. My father was a peasant. His father was a peasant. But I will be a lawyer. Education has remade Japan and remade me. Is this not a miracle?",
    "displayDate": "September 10, 1908",
    "timestamp": "1908-09-10T14:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 289,
    "comments": 178,
    "shares": 167,
    "accuracy": "inferred",
    "historicalContext": "Social mobility increased dramatically in Meiji Japan. The old class system was abolished (1871), and education enabled talented commoners to rise. By 1912, Japan had multiple universities and near-universal literacy.",
    "location": { "name": "Tokyo, Japan", "coordinates": [35.6762, 139.6503] }
  },
  {
    "id": "mj-049",
    "authorId": "tokugawa-yoshinobu",
    "content": "I am old now and forgotten. The Shogunate I surrendered has become a memory. Japan is unrecognizable. Trains, newspapers, an Emperor who rules. Perhaps I made the right choice after all.",
    "displayDate": "November 22, 1910",
    "timestamp": "1910-11-22T10:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 234,
    "comments": 189,
    "shares": 145,
    "accuracy": "inferred",
    "historicalContext": "Tokugawa Yoshinobu, the last Shogun, lived until 1913. He spent his later years in quiet retirement, pursuing photography and other hobbies. The Meiji government treated him relatively well, and he was made a prince in 1902.",
    "location": { "name": "Tokyo, Japan", "coordinates": [35.6762, 139.6503] }
  },
  {
    "id": "mj-050",
    "authorId": "emperor-meiji",
    "content": "My reign ends. The Meiji era closes. In 45 years, Japan went from isolation to empire. From swords to battleships. From feudalism to constitution. I did not create this Japan. The people did.",
    "displayDate": "July 29, 1912",
    "timestamp": "1912-07-29T23:00:00Z",
    "era": "meiji-japan",
    "type": "status",
    "likes": 567,
    "comments": 345,
    "shares": 456,
    "accuracy": "attributed",
    "historicalContext": "Emperor Meiji died on July 30, 1912, ending one of history's most remarkable transformations. In less than 50 years, Japan went from feudal isolation to defeating Russia, the first Asian nation to defeat a European power in modern times.",
    "location": { "name": "Imperial Palace, Tokyo", "coordinates": [35.6852, 139.7528] }
  }
]
