[
  {
    "id": "leonardo-mona-lisa-1503",
    "authorId": "leonardo-da-vinci",
    "type": "image",
    "content": "She smiled today. For one moment, the light caught her face just so, and I understood what I've been trying to capture all these years. Not a likeness but a life. The eyes follow you because they're alive. Tomorrow I'll work on the sfumato around her mouth again. This may take years more.",
    "timestamp": "1503-10-15T14:00:00Z",
    "displayDate": "October 15, 1503",
    "accuracy": "interpretive",
    "historicalContext": "Leonardo da Vinci worked on the Mona Lisa from around 1503 to 1519, famously never considering it 'finished.' His sfumato technique created the enigmatic quality of her expression.",
    "era": "renaissance",
    "location": { "name": "Florence, Italy" },
    "hashtags": ["#art", "#portrait", "#sfumato"],
    "likes": 4521,
    "comments": 312,
    "shares": 890
  },
  {
    "id": "leonardo-flying-machine-1505",
    "authorId": "leonardo-da-vinci",
    "type": "text",
    "content": "Watched the birds again this morning. The kite tilts its wing to turn, shifts weight to dive. Man will fly. I'm certain of it. Not by flapping - we haven't the strength - but by understanding the air itself. Have sketched three new designs. The Medici think me mad for this obsession. Perhaps. But the birds mock our walking.",
    "timestamp": "1505-03-22T08:30:00Z",
    "displayDate": "March 22, 1505",
    "accuracy": "interpretive",
    "historicalContext": "Leonardo's Codex on the Flight of Birds, completed around 1505, contained detailed studies of bird flight and designs for flying machines that anticipated modern aeronautics by centuries.",
    "era": "renaissance",
    "location": { "name": "Florence, Italy" },
    "hashtags": ["#flight", "#invention", "#nature"],
    "likes": 3892,
    "comments": 245,
    "shares": 567
  },
  {
    "id": "michelangelo-sistine-ceiling-1510",
    "authorId": "michelangelo",
    "type": "text",
    "content": "Four years. My neck is ruined. Paint drips in my eyes daily. The scaffold is my prison. But tonight I stepped down and looked up at Adam receiving life from God's finger, and I wept. Not from pride - from fear. What if this is the best I can do? What if it isn't enough?",
    "timestamp": "1510-09-01T20:00:00Z",
    "displayDate": "September 1, 1510",
    "accuracy": "interpretive",
    "historicalContext": "Michelangelo painted the Sistine Chapel ceiling from 1508-1512, working in difficult conditions on scaffolding he designed himself. He wrote poetry complaining about the physical toll.",
    "era": "renaissance",
    "location": { "name": "Vatican City, Rome" },
    "hashtags": ["#SistineChapel", "#fresco", "#Genesis"],
    "likes": 5234,
    "comments": 389,
    "shares": 1023
  },
  {
    "id": "michelangelo-david-1504",
    "authorId": "michelangelo",
    "type": "image",
    "content": "They gave me a ruined block. Botched by lesser hands, abandoned for decades. Everyone said the marble was worthless. But I saw him in there, waiting. David. Today he stands. Seventeen feet of defiance, ready to face Goliath. Florence faces her own giants. May he remind them of courage.",
    "timestamp": "1504-06-08T12:00:00Z",
    "displayDate": "June 8, 1504",
    "accuracy": "interpretive",
    "historicalContext": "Michelangelo's David was carved from a marble block that had been abandoned by previous sculptors. Completed in 1504, it became a symbol of Florentine civic pride and resistance to tyranny.",
    "era": "renaissance",
    "location": { "name": "Florence, Italy" },
    "hashtags": ["#sculpture", "#David", "#Florence"],
    "likes": 6012,
    "comments": 456,
    "shares": 1245
  },
  {
    "id": "galileo-telescope-jupiter-1610",
    "authorId": "galileo",
    "type": "text",
    "content": "I cannot sleep. Three nights ago, I turned my improved telescope to Jupiter. Four stars attend it, moving with it through the sky. But they're not stars. They're moons. MOONS. Orbiting Jupiter as our Moon orbits Earth. If Jupiter has moons, then not everything revolves around Earth. The Church will not like this.",
    "timestamp": "1610-01-10T03:00:00Z",
    "displayDate": "January 10, 1610",
    "accuracy": "documented",
    "historicalContext": "Galileo discovered Jupiter's four largest moons (Io, Europa, Ganymede, and Callisto) in January 1610. This observation provided key evidence against the geocentric model of the universe.",
    "era": "renaissance",
    "location": { "name": "Padua, Italy" },
    "hashtags": ["#astronomy", "#Jupiter", "#discovery"],
    "likes": 7823,
    "comments": 567,
    "shares": 2341
  },
  {
    "id": "galileo-trial-1633",
    "authorId": "galileo",
    "type": "text",
    "content": "Today I knelt before the Inquisition and recanted. I said the Earth stands still and the Sun moves. I lied. They have my words but not my knowledge. The mathematics remain true whether or not I am permitted to speak them. House arrest for life, they say. At least I'll have time to think.",
    "timestamp": "1633-06-22T16:00:00Z",
    "displayDate": "June 22, 1633",
    "accuracy": "documented",
    "historicalContext": "Galileo was tried by the Inquisition in 1633 for defending heliocentrism. He was forced to recant and spent the rest of his life under house arrest. Legend says he muttered 'Eppur si muove' (And yet it moves).",
    "era": "renaissance",
    "location": { "name": "Rome, Italy" },
    "hashtags": ["#Inquisition", "#truth", "#science"],
    "likes": 8934,
    "comments": 789,
    "shares": 3456
  },
  {
    "id": "shakespeare-hamlet-premiere-1600",
    "authorId": "shakespeare",
    "type": "text",
    "content": "The Globe shook today. Burbage as the Prince, wrestling with 'To be or not to be.' The groundlings stood silent - that never happens. When the poison did its work at the end, I heard weeping. Not just from women. This one is different. This one asks questions I cannot answer myself.",
    "timestamp": "1600-09-15T18:00:00Z",
    "displayDate": "September 15, 1600",
    "accuracy": "interpretive",
    "historicalContext": "Hamlet premiered around 1600-1601 at the Globe Theatre. Richard Burbage originated the title role. The play's psychological depth marked a turning point in dramatic literature.",
    "era": "renaissance",
    "location": { "name": "London, England" },
    "hashtags": ["#Hamlet", "#theatre", "#GlobeTheatre"],
    "likes": 5678,
    "comments": 412,
    "shares": 987
  },
  {
    "id": "shakespeare-sonnets-1609",
    "authorId": "shakespeare",
    "type": "text",
    "content": "They've printed the sonnets without my leave. All of them. The fair youth, the dark lady, every secret I poured onto the page thinking it would stay private. London will read my heart laid bare. Let them guess. They'll never know which parts are true.",
    "timestamp": "1609-05-20T10:00:00Z",
    "displayDate": "May 20, 1609",
    "accuracy": "interpretive",
    "historicalContext": "Shakespeare's Sonnets were published in 1609, possibly without his authorization. The poems have sparked centuries of speculation about the identities of the 'Fair Youth' and 'Dark Lady.'",
    "era": "renaissance",
    "location": { "name": "London, England" },
    "hashtags": ["#sonnets", "#poetry", "#scandal"],
    "likes": 4123,
    "comments": 345,
    "shares": 678
  },
  {
    "id": "newton-apple-gravity-1666",
    "authorId": "isaac-newton",
    "type": "text",
    "content": "Plague has closed Cambridge. I'm home at Woolsthorpe, thinking. An apple fell from the tree today and I wondered - does the same force that pulls the apple pull the Moon? The Moon is always falling toward Earth but moving sideways fast enough to miss. Could it be that simple? One force, everywhere?",
    "timestamp": "1666-09-01T15:00:00Z",
    "displayDate": "September 1, 1666",
    "accuracy": "interpretive",
    "historicalContext": "During the Great Plague of 1665-1666, Newton retreated to his family home where he developed early ideas on calculus, optics, and gravitation. The apple story, though embellished over time, was recounted by Newton himself.",
    "era": "renaissance",
    "location": { "name": "Woolsthorpe, England" },
    "hashtags": ["#gravity", "#physics", "#discovery"],
    "likes": 9234,
    "comments": 678,
    "shares": 2987
  },
  {
    "id": "newton-principia-1687",
    "authorId": "isaac-newton",
    "type": "text",
    "content": "Principia Mathematica is published. Twenty years of work. The laws of motion. Universal gravitation. The mathematics to describe the cosmos. Halley paid for the printing from his own pocket after I quarreled with the Royal Society. He is a better friend than I deserve. Now let the philosophers argue.",
    "timestamp": "1687-07-05T12:00:00Z",
    "displayDate": "July 5, 1687",
    "accuracy": "documented",
    "historicalContext": "Newton's Principia, published in 1687, laid the foundation for classical mechanics. Edmond Halley funded its publication and encouraged Newton to complete it despite Newton's difficult temperament.",
    "era": "renaissance",
    "location": { "name": "Cambridge, England" },
    "hashtags": ["#Principia", "#physics", "#mathematics"],
    "likes": 10234,
    "comments": 890,
    "shares": 4567
  },
  {
    "id": "luther-95-theses-1517",
    "authorId": "martin-luther",
    "type": "text",
    "content": "I have posted 95 theses on the church door at Wittenberg. Against indulgences. Against the idea that salvation can be purchased with coin while peasants starve. If the Pope can empty Purgatory with gold, why doesn't he do it for free out of love? Let us debate this. In Latin. In public.",
    "timestamp": "1517-10-31T14:00:00Z",
    "displayDate": "October 31, 1517",
    "accuracy": "documented",
    "historicalContext": "Martin Luther posted his 95 Theses on October 31, 1517, challenging the Catholic Church's sale of indulgences. This act is considered the beginning of the Protestant Reformation.",
    "era": "renaissance",
    "location": { "name": "Wittenberg, Germany" },
    "hashtags": ["#Reformation", "#theses", "#faith"],
    "likes": 8567,
    "comments": 934,
    "shares": 3456
  },
  {
    "id": "luther-diet-worms-1521",
    "authorId": "martin-luther",
    "type": "text",
    "content": "They demanded I recant everything. Emperor, princes, bishops - all staring, waiting. I said no. 'Here I stand, I can do no other.' My conscience is captive to the Word of God. They may burn me as they burned Hus. But the truth will not burn. The printing press has seen to that.",
    "timestamp": "1521-04-18T16:00:00Z",
    "displayDate": "April 18, 1521",
    "accuracy": "documented",
    "historicalContext": "At the Diet of Worms in 1521, Luther refused to recant before Emperor Charles V. His famous 'Here I stand' declaration led to his excommunication and the Edict of Worms declaring him an outlaw.",
    "era": "renaissance",
    "location": { "name": "Worms, Germany" },
    "hashtags": ["#DietOfWorms", "#conscience", "#Reformation"],
    "likes": 7890,
    "comments": 678,
    "shares": 2345
  },
  {
    "id": "elizabeth-armada-1588",
    "authorId": "queen-elizabeth-i",
    "type": "text",
    "content": "I have been to Tilbury. Told my soldiers I have the body of a weak and feeble woman but the heart and stomach of a king. They roared. Spain sends their Armada thinking England easy prey because our ruler wears skirts. Let Philip learn otherwise. My father's blood runs in these veins.",
    "timestamp": "1588-08-09T12:00:00Z",
    "displayDate": "August 9, 1588",
    "accuracy": "documented",
    "historicalContext": "Queen Elizabeth I delivered her famous Tilbury speech on August 9, 1588, as the Spanish Armada approached. The speech rallied English troops and has become one of history's most celebrated addresses.",
    "era": "renaissance",
    "location": { "name": "Tilbury, England" },
    "hashtags": ["#Armada", "#England", "#Tilbury"],
    "likes": 7234,
    "comments": 567,
    "shares": 1890
  },
  {
    "id": "elizabeth-never-marry-1559",
    "authorId": "queen-elizabeth-i",
    "type": "text",
    "content": "Parliament begs me to marry. Every day another ambassador with another prince's portrait. But I saw what marriage did to my sister, to my stepmothers. A husband would rule me, and I will be ruled by no man. I am married already - to England. That husband is demanding enough.",
    "timestamp": "1559-02-10T10:00:00Z",
    "displayDate": "February 10, 1559",
    "accuracy": "interpretive",
    "historicalContext": "Elizabeth I famously never married, earning the title 'Virgin Queen.' She used the prospect of marriage as a diplomatic tool while maintaining her independence and sole rule over England.",
    "era": "renaissance",
    "location": { "name": "London, England" },
    "hashtags": ["#VirginQueen", "#marriage", "#crown"],
    "likes": 5678,
    "comments": 456,
    "shares": 1234
  },
  {
    "id": "machiavelli-prince-1513",
    "authorId": "niccolo-machiavelli",
    "type": "text",
    "content": "I have written a little book for Lorenzo de' Medici. About power - how to get it, how to keep it. Not how princes should behave, but how they do. People call me cynical. I call myself honest. The world is as it is, not as priests wish it were. Better to be feared than loved, if you cannot be both.",
    "timestamp": "1513-12-10T14:00:00Z",
    "displayDate": "December 10, 1513",
    "accuracy": "documented",
    "historicalContext": "Machiavelli wrote The Prince in 1513 while exiled from Florence, hoping to regain favor with the Medici rulers. Its pragmatic approach to power shocked contemporaries but founded modern political science.",
    "era": "renaissance",
    "location": { "name": "San Casciano, Italy" },
    "hashtags": ["#ThePrince", "#power", "#politics"],
    "likes": 6345,
    "comments": 567,
    "shares": 1678
  },
  {
    "id": "gutenberg-bible-1455",
    "authorId": "johannes-gutenberg",
    "type": "text",
    "content": "The first Bible is printed. 180 copies. Each one identical. Perfect. What took a monk a year, my press does in days. Fust says I'm in debt and threatens to take everything. Let him try. The invention cannot be uninvented. Ideas will spread like fire now. The Church cannot control every copy.",
    "timestamp": "1455-02-23T10:00:00Z",
    "displayDate": "February 23, 1455",
    "accuracy": "interpretive",
    "historicalContext": "Gutenberg completed printing the Gutenberg Bible around 1455. His printing press revolutionized the spread of information, though financial troubles led his creditor Johann Fust to seize his equipment.",
    "era": "renaissance",
    "location": { "name": "Mainz, Germany" },
    "hashtags": ["#printing", "#Bible", "#innovation"],
    "likes": 8901,
    "comments": 678,
    "shares": 3456
  },
  {
    "id": "copernicus-heliocentric-1543",
    "authorId": "nicolaus-copernicus",
    "type": "text",
    "content": "My book is finally published, though I may not live to see its reception. De Revolutionibus. The Earth is not the center. We orbit the Sun like the other wandering stars. The mathematics works. It's simpler, more elegant. They gave me a copy on my deathbed. I touched it once and closed my eyes.",
    "timestamp": "1543-05-24T09:00:00Z",
    "displayDate": "May 24, 1543",
    "accuracy": "documented",
    "historicalContext": "Copernicus received his published book De revolutionibus orbium coelestium on May 24, 1543, reportedly on his deathbed. His heliocentric model revolutionized astronomy, though it wasn't widely accepted for decades.",
    "era": "renaissance",
    "location": { "name": "Frombork, Poland" },
    "hashtags": ["#heliocentrism", "#astronomy", "#revolution"],
    "likes": 7234,
    "comments": 534,
    "shares": 2123
  },
  {
    "id": "lorenzo-medici-patronage-1482",
    "authorId": "lorenzo-medici",
    "type": "text",
    "content": "Commissioned Botticelli to paint Venus rising from the sea. Not Christ, not saints - a pagan goddess, naked and beautiful. My grandfather would understand. Art glorifies God through beauty itself, whatever the subject. The Dominicans preach against luxury. Let them. Florence's glory will outlast their sermons.",
    "timestamp": "1482-03-15T11:00:00Z",
    "displayDate": "March 15, 1482",
    "accuracy": "interpretive",
    "historicalContext": "Lorenzo de' Medici was the greatest patron of Renaissance art, supporting artists like Botticelli, Michelangelo, and Leonardo. His secular commissions represented a revival of classical themes.",
    "era": "renaissance",
    "location": { "name": "Florence, Italy" },
    "hashtags": ["#Botticelli", "#patronage", "#art"],
    "likes": 4567,
    "comments": 345,
    "shares": 890
  },
  {
    "id": "lorenzo-medici-michelangelo-1489",
    "authorId": "lorenzo-medici",
    "type": "text",
    "content": "A boy in Ghirlandaio's workshop caught my eye today. Fourteen years old, already carving marble like he was born with a chisel in his hand. Michelangelo, they call him. I've taken him into my household, will educate him beside my sons. Bank business bores me. This - finding genius and feeding it - this is my true calling.",
    "timestamp": "1489-04-01T14:00:00Z",
    "displayDate": "April 1, 1489",
    "accuracy": "documented",
    "historicalContext": "Lorenzo de' Medici discovered the young Michelangelo and took him into the Medici household around 1489, providing him with education, access to the Medici art collection, and introduction to humanist philosophy.",
    "era": "renaissance",
    "location": { "name": "Florence, Italy" },
    "hashtags": ["#Michelangelo", "#discovery", "#patronage"],
    "likes": 5890,
    "comments": 423,
    "shares": 1234
  },
  {
    "id": "henry-viii-break-rome-1534",
    "authorId": "henry-viii",
    "type": "text",
    "content": "Parliament has declared me Supreme Head of the Church of England. The Pope in Rome no longer commands English souls. Did Clement truly think he could deny me an annulment and keep my allegiance? For Catherine's sake? I need a son. England needs an heir. God will judge who is right.",
    "timestamp": "1534-11-03T12:00:00Z",
    "displayDate": "November 3, 1534",
    "accuracy": "documented",
    "historicalContext": "The Act of Supremacy of 1534 made Henry VIII Supreme Head of the Church of England, breaking from Rome after Pope Clement VII refused to annul his marriage to Catherine of Aragon.",
    "era": "renaissance",
    "location": { "name": "London, England" },
    "hashtags": ["#ActOfSupremacy", "#ChurchOfEngland", "#break"],
    "likes": 6234,
    "comments": 567,
    "shares": 1890
  },
  {
    "id": "henry-viii-anne-boleyn-1536",
    "authorId": "henry-viii",
    "type": "text",
    "content": "Anne is dead. The swordsman from Calais did his work at dawn. She gave me Elizabeth but not the son I needed, and then... the rumors. The accusations. Was she guilty? The court said so. I signed the warrant. I had to. For England. Tonight I will dine with Jane. Life continues.",
    "timestamp": "1536-05-19T08:00:00Z",
    "displayDate": "May 19, 1536",
    "accuracy": "documented",
    "historicalContext": "Anne Boleyn was executed on May 19, 1536, on charges widely believed to be fabricated. Henry VIII became engaged to Jane Seymour the next day. The charges against Anne remain historically controversial.",
    "era": "renaissance",
    "location": { "name": "Tower of London, England" },
    "hashtags": ["#AnneBoleyn", "#execution", "#Tudor"],
    "likes": 7890,
    "comments": 890,
    "shares": 2345
  },
  {
    "id": "leonardo-last-supper-1498",
    "authorId": "leonardo-da-vinci",
    "type": "image",
    "content": "The Last Supper is finished. The prior complained I worked too slowly, wanted me there dawn to dusk like a laborer. I told the Duke that the faces of Judas and Christ required contemplation, not haste. If the prior persists in annoying me, I'll use his face for Judas. That silenced him.",
    "timestamp": "1498-02-09T16:00:00Z",
    "displayDate": "February 9, 1498",
    "accuracy": "documented",
    "historicalContext": "Leonardo completed The Last Supper in 1498. He famously told the Duke of Milan that his slow pace was necessary for artistic contemplation, and reportedly threatened to use the impatient prior as the model for Judas.",
    "era": "renaissance",
    "location": { "name": "Milan, Italy" },
    "hashtags": ["#LastSupper", "#fresco", "#Milan"],
    "likes": 5678,
    "comments": 456,
    "shares": 1234
  },
  {
    "id": "galileo-moon-1610",
    "authorId": "galileo",
    "type": "text",
    "content": "The Moon is not a perfect sphere as Aristotle claimed. Through my telescope I see mountains, craters, valleys - a world as rugged as our own. If the Moon is imperfect, why should the heavens be perfect? Everything we thought we knew about the cosmos is wrong. And I can prove it.",
    "timestamp": "1610-01-07T22:00:00Z",
    "displayDate": "January 7, 1610",
    "accuracy": "documented",
    "historicalContext": "Galileo's lunar observations in early 1610 revealed the Moon's mountainous surface, contradicting the Aristotelian view of celestial perfection. He published these findings in Sidereus Nuncius (Starry Messenger).",
    "era": "renaissance",
    "location": { "name": "Padua, Italy" },
    "hashtags": ["#Moon", "#telescope", "#discovery"],
    "likes": 6789,
    "comments": 567,
    "shares": 1890
  },
  {
    "id": "shakespeare-globe-fire-1613",
    "authorId": "shakespeare",
    "type": "text",
    "content": "The Globe has burned. A cannon during Henry VIII set the thatch alight and the whole thing went up in an hour. No one hurt, thank God, though one man's breeches caught fire (quickly doused with ale). Twenty years of memories in that wooden O, now ash. We'll rebuild. We always do.",
    "timestamp": "1613-06-29T15:00:00Z",
    "displayDate": "June 29, 1613",
    "accuracy": "documented",
    "historicalContext": "The Globe Theatre burned down on June 29, 1613, during a performance of Henry VIII when a theatrical cannon ignited the thatched roof. It was rebuilt the following year with a tiled roof.",
    "era": "renaissance",
    "location": { "name": "London, England" },
    "hashtags": ["#GlobeTheatre", "#fire", "#rebuild"],
    "likes": 4321,
    "comments": 345,
    "shares": 890
  },
  {
    "id": "michelangelo-pieta-1499",
    "authorId": "michelangelo",
    "type": "image",
    "content": "The Pieta is unveiled in St. Peter's. I carved the Virgin young - younger than her Son - because purity does not age. Some Romans whispered it was another sculptor's work. Tonight I crept in and carved my name across the Virgin's sash: MICHAELA[N]GELUS BONAROTUS FLORENTIN[US] FACIEBA[T]. Let them whisper now.",
    "timestamp": "1499-08-11T18:00:00Z",
    "displayDate": "August 11, 1499",
    "accuracy": "documented",
    "historicalContext": "Michelangelo carved the Pieta at age 23. After overhearing doubts about his authorship, he carved his name on the Virgin's sash - the only work he ever signed. He later regretted this pride.",
    "era": "renaissance",
    "location": { "name": "Vatican City, Rome" },
    "hashtags": ["#Pieta", "#sculpture", "#signature"],
    "likes": 6789,
    "comments": 534,
    "shares": 1567
  },
  {
    "id": "newton-leibniz-calculus-1699",
    "authorId": "isaac-newton",
    "type": "text",
    "content": "Leibniz claims he invented the calculus independently. Independently! I showed him my methods in 1676. Now he publishes his notation and Continental fools praise him as the inventor. I have documents, letters, witnesses. The Royal Society will investigate. History will know who was first. I will see to it.",
    "timestamp": "1699-01-15T11:00:00Z",
    "displayDate": "January 15, 1699",
    "accuracy": "interpretive",
    "historicalContext": "The Newton-Leibniz calculus controversy was one of history's bitterest scientific disputes. While both developed calculus independently, Newton accused Leibniz of plagiarism. Modern historians credit both.",
    "era": "renaissance",
    "location": { "name": "Cambridge, England" },
    "hashtags": ["#calculus", "#Leibniz", "#priority"],
    "likes": 4567,
    "comments": 678,
    "shares": 890
  },
  {
    "id": "gutenberg-movable-type-1450",
    "authorId": "johannes-gutenberg",
    "type": "text",
    "content": "After years of secret work, the type is ready. Each letter cast in metal, arranged in forms, pressed to paper. One page becomes a hundred, a hundred becomes a thousand. The Chinese had this idea but my press is different - faster, with type that can be reused infinitely. The world will change. I can feel it.",
    "timestamp": "1450-02-03T10:00:00Z",
    "displayDate": "February 3, 1450",
    "accuracy": "interpretive",
    "historicalContext": "Gutenberg developed his printing press with movable type around 1440-1450 in Mainz. His innovation combined metal type, oil-based inks, and a wooden press adapted from wine-making technology.",
    "era": "renaissance",
    "location": { "name": "Mainz, Germany" },
    "hashtags": ["#movableType", "#press", "#invention"],
    "likes": 7890,
    "comments": 567,
    "shares": 2345
  },
  {
    "id": "luther-bible-german-1534",
    "authorId": "martin-luther",
    "type": "text",
    "content": "My German Bible is complete. Not Latin, not for priests - German, for farmers and their wives and children. Let every Christian read God's Word in the language they speak at market and at home. Rome kept the Scripture locked away. The printing press is my weapon against their monopoly on truth.",
    "timestamp": "1534-09-21T14:00:00Z",
    "displayDate": "September 21, 1534",
    "accuracy": "documented",
    "historicalContext": "Luther completed his German translation of the Bible in 1534, making Scripture accessible to ordinary Germans. His translation influenced the development of the German language and inspired vernacular Bibles across Europe.",
    "era": "renaissance",
    "location": { "name": "Wittenberg, Germany" },
    "hashtags": ["#Bible", "#German", "#translation"],
    "likes": 6789,
    "comments": 534,
    "shares": 1890
  },
  {
    "id": "machiavelli-exile-1512",
    "authorId": "niccolo-machiavelli",
    "type": "text",
    "content": "Florence has fallen to the Medici. I, who served the Republic for fourteen years, am now nothing. They arrested me, tortured me on the strappado, suspected me of conspiracy. My shoulders still scream. Now I'm exiled to my farm, watching peasants while my city forgets me. There is nothing worse than impotence.",
    "timestamp": "1512-11-20T09:00:00Z",
    "displayDate": "November 20, 1512",
    "accuracy": "documented",
    "historicalContext": "After the Medici returned to power in 1512, Machiavelli was dismissed from office, imprisoned, and tortured. His exile led him to write his major works including The Prince, hoping to regain political favor.",
    "era": "renaissance",
    "location": { "name": "San Casciano, Italy" },
    "hashtags": ["#exile", "#Medici", "#Florence"],
    "likes": 3456,
    "comments": 234,
    "shares": 678
  },
  {
    "id": "copernicus-fear-publish-1540",
    "authorId": "nicolaus-copernicus",
    "type": "text",
    "content": "Friends urge me to publish. The manuscript has been ready for years. But I hesitate. To claim the Earth moves, that we are not the center of Creation - this could bring ridicule from astronomers and condemnation from the Church. Perhaps after I am dead. Let future generations judge my mathematics.",
    "timestamp": "1540-05-12T16:00:00Z",
    "displayDate": "May 12, 1540",
    "accuracy": "interpretive",
    "historicalContext": "Copernicus delayed publishing his heliocentric theory for years, fearing controversy. His book De revolutionibus was only published in 1543, reportedly delivered to him on his deathbed.",
    "era": "renaissance",
    "location": { "name": "Frombork, Poland" },
    "hashtags": ["#heliocentrism", "#fear", "#publish"],
    "likes": 4123,
    "comments": 345,
    "shares": 890
  },
  {
    "id": "leonardo-anatomy-1510",
    "authorId": "leonardo-da-vinci",
    "type": "text",
    "content": "Dissected my thirtieth corpse today. The hospital gives me the bodies no one claims. I draw what I see: the muscles, the tendons, the heart's four chambers. The Church says the body is sacred, not to be opened. But how can I paint the living if I don't understand what moves beneath the skin?",
    "timestamp": "1510-11-08T04:00:00Z",
    "displayDate": "November 8, 1510",
    "accuracy": "interpretive",
    "historicalContext": "Leonardo performed extensive human dissections, creating detailed anatomical drawings that were centuries ahead of their time. He dissected approximately 30 corpses, though his findings weren't published in his lifetime.",
    "era": "renaissance",
    "location": { "name": "Milan, Italy" },
    "hashtags": ["#anatomy", "#dissection", "#science"],
    "likes": 5234,
    "comments": 423,
    "shares": 1123
  },
  {
    "id": "elizabeth-mary-execution-1587",
    "authorId": "queen-elizabeth-i",
    "type": "text",
    "content": "Mary Stuart is dead. My cousin, my prisoner for nineteen years, now headless at Fotheringhay. I signed the warrant but claimed I never meant it sent. A convenient fiction. She plotted against me, against England, but she was a queen. What message does it send that queens can die on the block? I did not sleep last night.",
    "timestamp": "1587-02-08T10:00:00Z",
    "displayDate": "February 8, 1587",
    "accuracy": "documented",
    "historicalContext": "Mary Queen of Scots was executed on February 8, 1587, after being implicated in the Babington Plot. Elizabeth claimed her councilors sent the warrant without her knowledge, though historians debate her sincerity.",
    "era": "renaissance",
    "location": { "name": "London, England" },
    "hashtags": ["#MaryQueenOfScots", "#execution", "#regret"],
    "likes": 6789,
    "comments": 678,
    "shares": 1890
  },
  {
    "id": "henry-viii-dissolution-1536",
    "authorId": "henry-viii",
    "type": "text",
    "content": "Began dissolving the lesser monasteries today. Their wealth flows to the Crown now - their lands, their gold, their relics. Cromwell says we'll gain over a million pounds. The monks protest, call it sacrilege. But they grew fat on tithes from peasants while preaching poverty. Let them find honest work.",
    "timestamp": "1536-03-04T11:00:00Z",
    "displayDate": "March 4, 1536",
    "accuracy": "documented",
    "historicalContext": "The Dissolution of the Monasteries (1536-1541) transferred monastic wealth to the Crown. Henry VIII seized approximately 900 religious houses, dramatically reshaping English land ownership and religious life.",
    "era": "renaissance",
    "location": { "name": "London, England" },
    "hashtags": ["#dissolution", "#monasteries", "#wealth"],
    "likes": 5234,
    "comments": 567,
    "shares": 1234
  },
  {
    "id": "galileo-starry-messenger-1610",
    "authorId": "galileo",
    "type": "text",
    "content": "Sidereus Nuncius is printed. 550 copies, sold out in a week. Jupiter's moons. The Moon's mountains. The Milky Way resolved into countless stars. I've dedicated it to Cosimo de' Medici - named the Jovian moons after his family. If this doesn't get me called to Florence, nothing will.",
    "timestamp": "1610-03-13T14:00:00Z",
    "displayDate": "March 13, 1610",
    "accuracy": "documented",
    "historicalContext": "Galileo's Sidereus Nuncius (Starry Messenger) was published in March 1610 and sold out quickly. His dedication to the Medici succeeded - Cosimo II soon appointed him court philosopher and mathematician.",
    "era": "renaissance",
    "location": { "name": "Venice, Italy" },
    "hashtags": ["#SidereuNuncius", "#astronomy", "#publication"],
    "likes": 7234,
    "comments": 567,
    "shares": 2123
  },
  {
    "id": "shakespeare-macbeth-1606",
    "authorId": "shakespeare",
    "type": "text",
    "content": "Tomorrow, and tomorrow, and tomorrow. I wrote that line today and it frightens me. Life as a walking shadow, a tale told by an idiot. The Scottish play is dark. Maybe too dark. The king better like it.",
    "timestamp": "1606-04-20T21:00:00Z",
    "displayDate": "April 20, 1606",
    "accuracy": "interpretive",
    "historicalContext": "Macbeth was written around 1606, likely to please King James I, who was fascinated by witchcraft and was himself Scottish.",
    "era": "renaissance",
    "location": { "name": "London, England" },
    "hashtags": ["#Macbeth", "#tragedy", "#theatre"],
    "likes": 5234,
    "comments": 412,
    "shares": 890
  },
  {
    "id": "michelangelo-old-age-1560",
    "authorId": "michelangelo",
    "type": "text",
    "content": "Eighty-five years old. Still carving. My hands shake but they know the stone better than my mind does. The Rondanini Pietà will never be finished. Nothing is ever finished. You just stop.",
    "timestamp": "1560-02-15T10:00:00Z",
    "displayDate": "February 15, 1560",
    "accuracy": "interpretive",
    "historicalContext": "Michelangelo worked on the Rondanini Pietà until days before his death at 88. He never stopped creating, leaving several unfinished works.",
    "era": "renaissance",
    "location": { "name": "Rome, Italy" },
    "hashtags": ["#sculpture", "#aging", "#art"],
    "likes": 4567,
    "comments": 345,
    "shares": 678
  },
  {
    "id": "leonardo-mirror-writing-1490",
    "authorId": "leonardo-da-vinci",
    "type": "text",
    "content": "People ask why I write backwards. Left-handed, the ink smears otherwise. Also, let them work to read my thoughts. Not everything is for everyone. Some secrets should require effort.",
    "timestamp": "1490-06-12T09:00:00Z",
    "displayDate": "June 12, 1490",
    "accuracy": "interpretive",
    "historicalContext": "Leonardo wrote in mirror script, right to left. Whether for practical reasons or secrecy remains debated by scholars.",
    "era": "renaissance",
    "location": { "name": "Milan, Italy" },
    "hashtags": ["#writing", "#secrets", "#notebooks"],
    "likes": 3890,
    "comments": 289,
    "shares": 567
  },
  {
    "id": "newton-optics-prism-1672",
    "authorId": "isaac-newton",
    "type": "text",
    "content": "Light is not pure. It contains all colors. A prism separates them, another recombines them. The rainbow is in sunlight itself. Hooke disagrees, as Hooke always disagrees. Let him.",
    "timestamp": "1672-02-06T14:00:00Z",
    "displayDate": "February 6, 1672",
    "accuracy": "documented",
    "historicalContext": "Newton's experiments with prisms proved white light contains the full spectrum of colors. Robert Hooke criticized the work, beginning their famous rivalry.",
    "era": "renaissance",
    "location": { "name": "Cambridge, England" },
    "hashtags": ["#optics", "#light", "#science"],
    "likes": 6789,
    "comments": 534,
    "shares": 1234
  },
  {
    "id": "gutenberg-lawsuit-1455",
    "authorId": "johannes-gutenberg",
    "type": "text",
    "content": "Fust won the lawsuit. Everything is his now. The press, the type, the Bibles. Years of work, taken. He couldn't have done it without me. But the law says he owns it. I have nothing.",
    "timestamp": "1455-11-06T16:00:00Z",
    "displayDate": "November 6, 1455",
    "accuracy": "documented",
    "historicalContext": "Johann Fust sued Gutenberg for unpaid loans and won. Fust took over the printing operation and profited from Gutenberg's invention. Gutenberg died in relative obscurity.",
    "era": "renaissance",
    "location": { "name": "Mainz, Germany" },
    "hashtags": ["#lawsuit", "#betrayal", "#printing"],
    "likes": 4567,
    "comments": 567,
    "shares": 890
  },
  {
    "id": "galileo-daughter-1634",
    "authorId": "galileo",
    "type": "text",
    "content": "Virginia is dead. My eldest. Sister Maria Celeste, as she was known in the convent. She wrote me more than anyone, kept me alive during the trial. Now I am blind and she is gone. The stars mock me.",
    "timestamp": "1634-04-02T20:00:00Z",
    "displayDate": "April 2, 1634",
    "accuracy": "documented",
    "historicalContext": "Virginia Galilei (Sister Maria Celeste) died in 1634, a year after Galileo's trial. Her letters to her father survive. He was devastated and went blind within years.",
    "era": "renaissance",
    "location": { "name": "Arcetri, Italy" },
    "hashtags": ["#grief", "#daughter", "#loss"],
    "likes": 5678,
    "comments": 456,
    "shares": 890
  },
  {
    "id": "luther-table-talk-1538",
    "authorId": "martin-luther",
    "type": "text",
    "content": "Students keep writing down what I say at dinner. Every joke, every complaint. Katie says I talk too much. She's right. But they write anyway. Someday strangers will read my opinion on constipation. Wonderful.",
    "timestamp": "1538-03-14T19:00:00Z",
    "displayDate": "March 14, 1538",
    "accuracy": "interpretive",
    "historicalContext": "Luther's Table Talk was compiled from notes taken by students and guests at his dinner table. The collection includes everything from theology to personal complaints.",
    "era": "renaissance",
    "location": { "name": "Wittenberg, Germany" },
    "hashtags": ["#dinner", "#tableTalk", "#students"],
    "likes": 3456,
    "comments": 234,
    "shares": 456
  },
  {
    "id": "henry-viii-six-wives-1543",
    "authorId": "henry-viii",
    "type": "text",
    "content": "Catherine Parr. My sixth wife. She's kind, educated, argues theology with me. Maybe this one will last. I'm tired. My leg aches constantly. I just want peace. And a wife who doesn't make me kill her.",
    "timestamp": "1543-07-12T14:00:00Z",
    "displayDate": "July 12, 1543",
    "accuracy": "interpretive",
    "historicalContext": "Catherine Parr was Henry's sixth and final wife. She survived him and was instrumental in reconciling him with his daughters Mary and Elizabeth.",
    "era": "renaissance",
    "location": { "name": "Hampton Court", "modern": "London, England" },
    "hashtags": ["#marriage", "#Tudor", "#wives"],
    "likes": 5678,
    "comments": 678,
    "shares": 1234
  },
  {
    "id": "elizabeth-golden-speech-1601",
    "authorId": "queen-elizabeth-i",
    "type": "text",
    "content": "I have been your Queen for 44 years. Though you have had princes more mighty and wise, you never had one who loved you more. This is my Golden Speech. I may not have many more to give.",
    "timestamp": "1601-11-30T14:00:00Z",
    "displayDate": "November 30, 1601",
    "accuracy": "documented",
    "historicalContext": "Elizabeth's Golden Speech to Parliament in 1601 addressed concerns about royal monopolies. It was one of her last major addresses; she died in 1603.",
    "era": "renaissance",
    "location": { "name": "Whitehall Palace", "modern": "London, England" },
    "hashtags": ["#GoldenSpeech", "#Parliament", "#reign"],
    "likes": 6789,
    "comments": 567,
    "shares": 1567
  },
  {
    "id": "machiavelli-comedy-1518",
    "authorId": "niccolo-machiavelli",
    "type": "text",
    "content": "Wrote a comedy today. La Mandragola. It's filthy. The audience laughed. Florence forgets I exist except when I make them laugh. Better to be a remembered fool than a forgotten genius, I suppose.",
    "timestamp": "1518-02-02T21:00:00Z",
    "displayDate": "February 2, 1518",
    "accuracy": "documented",
    "historicalContext": "Machiavelli's comedy La Mandragola was a popular success. Unable to return to political life, he turned to writing plays and histories.",
    "era": "renaissance",
    "location": { "name": "Florence, Italy" },
    "hashtags": ["#comedy", "#theatre", "#Florence"],
    "likes": 3234,
    "comments": 234,
    "shares": 456
  },
  {
    "id": "copernicus-church-1533",
    "authorId": "nicolaus-copernicus",
    "type": "text",
    "content": "The Pope's secretary wants me to explain my theory in Rome. Perhaps they're more open-minded than I feared. Or they're setting a trap. At 60, I'm too old for games. Let the mathematics speak.",
    "timestamp": "1533-07-03T10:00:00Z",
    "displayDate": "July 3, 1533",
    "accuracy": "documented",
    "historicalContext": "Pope Clement VII showed interest in Copernican theory. The Vatican didn't officially condemn heliocentrism until 1616, long after Copernicus's death.",
    "era": "renaissance",
    "location": { "name": "Frombork, Poland" },
    "hashtags": ["#Pope", "#astronomy", "#theory"],
    "likes": 4567,
    "comments": 345,
    "shares": 678
  },
  {
    "id": "lorenzo-carnival-1490",
    "authorId": "lorenzo-medici",
    "type": "text",
    "content": "Carnival! The streets of Florence drunk and dancing. I wrote songs for the revelers. Tomorrow we return to banking and politics. Tonight, we celebrate being alive. How brief our joys, how fleet!",
    "timestamp": "1490-02-15T22:00:00Z",
    "displayDate": "February 15, 1490",
    "accuracy": "documented",
    "historicalContext": "Lorenzo de' Medici wrote carnival songs including 'Trionfo di Bacco e Arianna' with its famous line about fleeting youth and uncertain tomorrow.",
    "era": "renaissance",
    "location": { "name": "Florence, Italy" },
    "hashtags": ["#Carnival", "#Florence", "#songs"],
    "likes": 4123,
    "comments": 312,
    "shares": 567
  },
  {
    "id": "shakespeare-retirement-1611",
    "authorId": "shakespeare",
    "type": "text",
    "content": "The Tempest is done. Prospero drowns his book and breaks his staff. He's me. I'm leaving London, going home to Stratford. Anne has waited long enough. Time to be a husband again. A father.",
    "timestamp": "1611-11-01T17:00:00Z",
    "displayDate": "November 1, 1611",
    "accuracy": "interpretive",
    "historicalContext": "The Tempest is often seen as Shakespeare's farewell to the stage. Prospero's renunciation of magic mirrors the playwright's retirement to Stratford.",
    "era": "renaissance",
    "location": { "name": "London, England" },
    "hashtags": ["#Tempest", "#retirement", "#farewell"],
    "likes": 5678,
    "comments": 456,
    "shares": 890
  },
  {
    "id": "newton-alchemy-1680",
    "authorId": "isaac-newton",
    "type": "text",
    "content": "The philosophers' stone remains elusive. Mercury, sulfur, salt - I've tried every combination. The old texts speak in riddles. If anyone knew I spent more time on this than on mathematics, they'd think me mad. Perhaps I am.",
    "timestamp": "1680-09-15T23:00:00Z",
    "displayDate": "September 15, 1680",
    "accuracy": "documented",
    "historicalContext": "Newton wrote more about alchemy than physics. His extensive alchemical manuscripts were only revealed in the 20th century.",
    "era": "renaissance",
    "location": { "name": "Cambridge, England" },
    "hashtags": ["#alchemy", "#secrets", "#obsession"],
    "likes": 5234,
    "comments": 456,
    "shares": 789
  },
  {
    "id": "michelangelo-moses-1515",
    "authorId": "michelangelo",
    "type": "text",
    "content": "The tomb of Julius II is cursed. Forty years on this project. The Pope dies, then his heirs change the plans, then they reduce the scope. Now just Moses, sitting there, angry as I am. We understand each other.",
    "timestamp": "1515-02-21T15:00:00Z",
    "displayDate": "February 21, 1515",
    "accuracy": "documented",
    "historicalContext": "Michelangelo called the Julius II tomb 'the tragedy of my life.' The original plan for 40 statues was reduced to just 7. Moses remains his most famous sculptural work.",
    "era": "renaissance",
    "location": { "name": "Rome, Italy" },
    "hashtags": ["#Moses", "#sculpture", "#frustration"],
    "likes": 5890,
    "comments": 456,
    "shares": 890
  },
  {
    "id": "galileo-pendulum-1602",
    "authorId": "galileo",
    "type": "text",
    "content": "Watched a lamp swing in the cathedral today. Timed it with my pulse. Long swing or short, the period stays the same. This is useful. Clocks could be made more accurate. Everything hides mathematics.",
    "timestamp": "1602-01-08T11:00:00Z",
    "displayDate": "January 8, 1602",
    "accuracy": "documented",
    "historicalContext": "Galileo discovered the isochronism of pendulums, reportedly while watching a chandelier in the Pisa Cathedral. This led to advances in timekeeping.",
    "era": "renaissance",
    "location": { "name": "Pisa, Italy" },
    "hashtags": ["#pendulum", "#physics", "#time"],
    "likes": 5678,
    "comments": 423,
    "shares": 890
  },
  {
    "id": "leonardo-vegetarian-1508",
    "authorId": "leonardo-da-vinci",
    "type": "text",
    "content": "The butcher's shop disgusts me. Those cages of birds waiting to die. I bought some today just to set them free. My colleagues think me strange for not eating meat. I think them strange for not seeing the cruelty.",
    "timestamp": "1508-04-12T12:00:00Z",
    "displayDate": "April 12, 1508",
    "accuracy": "documented",
    "historicalContext": "Contemporary accounts suggest Leonardo was vegetarian and was known to buy caged birds to release them. He wrote against cruelty to animals.",
    "era": "renaissance",
    "location": { "name": "Florence, Italy" },
    "hashtags": ["#vegetarian", "#animals", "#compassion"],
    "likes": 4567,
    "comments": 389,
    "shares": 678
  },
  {
    "id": "henry-viii-music-1520",
    "authorId": "henry-viii",
    "type": "text",
    "content": "Composed a new song today. 'Pastime with Good Company.' They say a king shouldn't spend time on such things. But what's the point of being king if I can't sing and play? The lute knows no politics.",
    "timestamp": "1520-05-22T20:00:00Z",
    "displayDate": "May 22, 1520",
    "accuracy": "documented",
    "historicalContext": "Henry VIII was an accomplished musician who composed several pieces. 'Pastime with Good Company' remains his most famous work.",
    "era": "renaissance",
    "location": { "name": "Greenwich Palace", "modern": "London, England" },
    "hashtags": ["#music", "#composition", "#Tudor"],
    "likes": 4890,
    "comments": 345,
    "shares": 678
  },
  {
    "id": "luther-nightmare-1527",
    "authorId": "martin-luther",
    "type": "text",
    "content": "The Devil visited me again last night. Threw an inkwell at the wall. Katie says I was dreaming. Maybe. But the stain is real. The darkness is real. Faith is fighting every day.",
    "timestamp": "1527-08-03T06:00:00Z",
    "displayDate": "August 3, 1527",
    "accuracy": "documented",
    "historicalContext": "Luther claimed frequent visits from the Devil. The inkwell-throwing story became legend. Modern historians debate whether he suffered from depression or other conditions.",
    "era": "renaissance",
    "location": { "name": "Wartburg Castle", "modern": "Eisenach, Germany" },
    "hashtags": ["#Devil", "#faith", "#nightmares"],
    "likes": 4234,
    "comments": 356,
    "shares": 567
  },
  {
    "id": "elizabeth-essex-1601",
    "authorId": "queen-elizabeth-i",
    "type": "text",
    "content": "Essex is dead. I signed the warrant. He was brilliant, beautiful, impossible. He raised an army against me - against me, who loved him like a son. What choice did I have? None. I had none.",
    "timestamp": "1601-02-25T08:00:00Z",
    "displayDate": "February 25, 1601",
    "accuracy": "documented",
    "historicalContext": "The Earl of Essex was executed for rebellion. He had been Elizabeth's favorite. She reportedly never recovered from ordering his death.",
    "era": "renaissance",
    "location": { "name": "Whitehall Palace", "modern": "London, England" },
    "hashtags": ["#Essex", "#execution", "#regret"],
    "likes": 5890,
    "comments": 567,
    "shares": 1023
  },
  {
    "id": "newton-cat-door-1690",
    "authorId": "isaac-newton",
    "type": "text",
    "content": "The cat scratches at my door constantly. Disturbs my calculations. Cut a hole in it - now she comes and goes as she pleases. Her kittens too small to reach it. Cut a smaller hole beside it. Problem solved.",
    "timestamp": "1690-03-18T10:00:00Z",
    "displayDate": "March 18, 1690",
    "accuracy": "attributed",
    "historicalContext": "The story of Newton inventing the cat door is likely apocryphal but has been told since the 18th century. It reflects his reputation for practical problem-solving.",
    "era": "renaissance",
    "location": { "name": "Cambridge, England" },
    "hashtags": ["#cats", "#invention", "#practical"],
    "likes": 6789,
    "comments": 567,
    "shares": 1234
  },
  {
    "id": "shakespeare-son-death-1596",
    "authorId": "shakespeare",
    "type": "text",
    "content": "Hamnet is dead. My only son, eleven years old. I wasn't there. I'm never there. I write about fathers and sons and I wasn't there when mine needed me. The plays will continue. Life will not.",
    "timestamp": "1596-08-11T14:00:00Z",
    "displayDate": "August 11, 1596",
    "accuracy": "documented",
    "historicalContext": "Shakespeare's son Hamnet died at age 11 in Stratford while Shakespeare worked in London. Many scholars see echoes of this loss in Hamlet and King John.",
    "era": "renaissance",
    "location": { "name": "London, England" },
    "hashtags": ["#grief", "#son", "#loss"],
    "likes": 6234,
    "comments": 567,
    "shares": 890
  },
  {
    "id": "lorenzo-death-1492",
    "authorId": "lorenzo-medici",
    "type": "text",
    "content": "The doctors say I'm dying. Forty-three years old. Savonarola visited - that fanatic priest - and told me to repent. Repent what? Loving beauty? Loving Florence? I made this city what it is. That is my confession.",
    "timestamp": "1492-04-08T22:00:00Z",
    "displayDate": "April 8, 1492",
    "accuracy": "documented",
    "historicalContext": "Lorenzo de' Medici died on April 9, 1492. Savonarola did visit him, though accounts of their conversation vary. Florence's golden age ended with Lorenzo's death.",
    "era": "renaissance",
    "location": { "name": "Careggi", "modern": "Florence, Italy" },
    "hashtags": ["#death", "#Florence", "#Medici"],
    "likes": 5678,
    "comments": 456,
    "shares": 890
  },
  {
    "id": "michelangelo-quarrel-raphael-1511",
    "authorId": "michelangelo",
    "type": "text",
    "content": "Raphael stole my secrets. Watched me work on the Sistine and copied my style. Pretty boy painter with pretty smooth manners. Everyone loves him. I don't. He knows nothing of stone, of struggle. Only pleasing patrons.",
    "timestamp": "1511-03-15T20:00:00Z",
    "displayDate": "March 15, 1511",
    "accuracy": "documented",
    "historicalContext": "Michelangelo and Raphael were rivals in Rome. Michelangelo accused Raphael of copying his Sistine figures. Their contrasting personalities fueled the conflict.",
    "era": "renaissance",
    "location": { "name": "Rome, Italy" },
    "hashtags": ["#rivalry", "#Raphael", "#artists"],
    "likes": 4890,
    "comments": 412,
    "shares": 678
  },
  {
    "id": "galileo-heresy-defense-1615",
    "authorId": "galileo",
    "type": "text",
    "content": "The Bible tells us how to go to heaven, not how the heavens go. Cardinal Bellarmine disagrees. They want Scripture and science to be the same. They're not. Nature cannot lie. Nature speaks mathematics.",
    "timestamp": "1615-12-21T14:00:00Z",
    "displayDate": "December 21, 1615",
    "accuracy": "documented",
    "historicalContext": "Galileo wrote to the Grand Duchess Christina defending the compatibility of heliocentrism and Scripture. In 1616, the Church declared heliocentrism formally heretical.",
    "era": "renaissance",
    "location": { "name": "Florence, Italy" },
    "hashtags": ["#Scripture", "#science", "#heresy"],
    "likes": 6234,
    "comments": 567,
    "shares": 1234
  }
]
